[
  {
    "id": "9329dadd6f0abe5e",
    "title_original": "To Lam’s blueprint for a rising Vietnam: build fast, grow rich",
    "content_original": "If all goes to plan, in under three years the world’s largest stadium will tower over Hanoi’s southern suburbs as a shimmering monument to the good times ahead for Vietnam and, by extension, its leader To Lam, the secret policeman who now holds power. The golden, drum-shaped Trong Dong Stadium, with a capacity of 135,000, is the centrepiece of a proposed US$38 billion new town designed to ease Vietnamese capital’s chronic congestion. Vingroup, the country’s dominant cars-to-minimarts...",
    "url": "https://www.scmp.com/week-asia/politics/article/3344909/lams-blueprint-rising-vietnam-build-fast-grow-rich?utm_source=rss_feed",
    "published": "2026-03-01T00:00:09+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "To Lam’s blueprint for a rising Vietnam: build fast, grow rich",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "28284f1a1424bcd6",
    "title_original": "What to know about Iran’s Supreme Leader Ayatollah Ali Khamenei",
    "content_original": "When targeted by nationwide protests early this year, Iran’s Supreme Leader Ayatollah Ali Khamenei unleashed the bloodiest crackdown of his nearly four decades in power. But now a US or Israeli military strike may have ended his rule. There was no immediate Iranian comment about him Saturday after US President Donald Trump said Khamenei was dead. Israeli officials also told reporters earlier that he was killed in a major new attack by US and Israeli forces. The 86-year-old Khamenei tried to...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3345002/what-know-about-irans-supreme-leader-ayatollah-ali-khamenei?utm_source=rss_feed",
    "published": "2026-02-28T23:30:55+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Reports on the potential death of Iran's Supreme Leader Ayatollah Ali Khamenei",
    "translated": true,
    "relevant": true,
    "summary_en": "Unconfirmed reports suggest that Iran's Supreme Leader Ayatollah Ali Khamenei may have been killed in a US and Israeli military strike. This development comes amid ongoing conflict, with US President Donald Trump and Israeli officials commenting on his potential death. The impact on Iranian leadership and the conflict remains uncertain."
  },
  {
    "id": "7381659e1bbb8a5f",
    "title_original": "Hong Kong’s small office landlords turn to co-working, student hostels to survive",
    "content_original": "Hong Kong’s struggling office landlords are ramping up efforts to convert their assets into co-working spaces and student accommodation in a bid to adapt to intense competition and the flight to quality, according to analysts. With some 3.5 million sq ft of new premium office space expected to be completed this year and next, on top of the 4.5 million sq ft added in 2024 and 2025, tenants are increasingly choosing to relocate to new and modern offices, leading to diverging fortunes for big...",
    "url": "https://www.scmp.com/business/article/3344901/hong-kongs-small-office-landlords-turn-co-working-student-hostels-survive?utm_source=rss_feed",
    "published": "2026-02-28T23:30:08+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hong Kong landlords adapt properties to co-working and student hostels amid economic challenges",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "83538bb45cb8fb88",
    "title_original": "Burgers, then war: Trump’s bluffs before Iran strikes",
    "content_original": "On a visit to Texas on Friday, US President Donald Trump gave a raucous speech on the economy and then stopped off at a fast-food joint. “Hamburgers for everyone!” Trump declared to cheering customers at the Whataburger restaurant in Corpus Christi, before the 47th president left clutching a bag with order No 47. Nine hours later, in the dead of night, Trump announced from his Mar-a-Lago resort in Florida that he had ordered the start of a major attack against Iran. It was the culmination of a...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3345001/burgers-then-war-trumps-bluffs-iran-strikes?utm_source=rss_feed",
    "published": "2026-02-28T22:13:05+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Trump ordered major attack on Iran after public appearance",
    "translated": true,
    "relevant": true,
    "summary_en": "Former US President Donald Trump ordered a major attack on Iran after a public appearance in Texas, where he visited a fast-food restaurant. The attack was announced nine hours later from his Mar-a-Lago resort in Florida. This highlights the abrupt escalation and potential decision-making process during the conflict."
  },
  {
    "id": "f4dccbdbaf9bfc8a",
    "title_original": "‘Iron rice bowl’ vs the algorithm: why China’s economy may better withstand the AI shock",
    "content_original": "On a day typically considered one of the happiest on the calendar for Chinese workers – the eve of Chinese New Year, when families gather for dinner in the midst of an extended public holiday – the annual Spring Festival Gala, the world’s most-watched television programme, left some in the viewing audience with a sense of profound disillusionment. As a troupe of humanoid robots break-danced, flipped, swung swords and performed comedy sketches at the gala, domestic AI brands occupied the show’s...",
    "url": "https://www.scmp.com/economy/china-economy/article/3344920/iron-rice-bowl-vs-algorithm-why-chinas-economy-may-better-withstand-ai-shock?utm_source=rss_feed",
    "published": "2026-02-28T22:00:19+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China's economy may withstand AI shock due to 'iron rice bowl' policies",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "dbed2f472a2ea562",
    "title_original": "Why China steers clear of the West’s transactional diplomacy",
    "content_original": "In international relations, interactions between states are often understood through a transactional lens. A transactional approach treats diplomacy as a series of discrete deals, short-term and conditional exchanges governed by a strict calculus of quid pro quo. Its focus is immediate gain and measurable returns. The turbulence in transatlantic relations over the past year illustrates the strengths and weaknesses of such an approach. At the Munich Security Conference earlier this month, US...",
    "url": "https://www.scmp.com/opinion/china-opinion/article/3344449/why-china-steers-clear-wests-transactional-diplomacy?utm_source=rss_feed",
    "published": "2026-02-28T21:30:07+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Why China steers clear of the West’s transactional diplomacy",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ef700b27c670b148",
    "title_original": "US says it used drones based on Iran’s own Shaheds in attack: ‘American-made retribution’",
    "content_original": "The US military said on Saturday that it has been using single-use drones to attack Iran for the first time in combat, signalling adoption by the world’s wealthiest military of a technology already surging to prominence in the Ukraine-Russia war. “Task Force Scorpion Strike employed low-cost one-way attack drones for the first time in combat,” US Central Command (Centcom) said in a statement posted on social media. Centcom said the drones, which are expendable but cheaper than traditional...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3345000/us-says-it-used-drones-based-irans-own-shaheds-attack-american-made-retribution?utm_source=rss_feed",
    "published": "2026-02-28T21:20:22+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US uses Iran’s Shahed-based drones for attacks: ‘American-made retribution’",
    "translated": true,
    "relevant": true,
    "summary_en": "The US military has deployed single-use drones modeled after Iran’s Shahed drones for the first time in combat against Iran, marking a strategic shift in the ongoing conflict. This move by the US Central Command (CENTCOM) signifies the adoption of low-cost, expendable drone technology, previously prominent in the Ukraine-Russia war, for use against Iranian targets. The development highlights the evolving nature of warfare in the region and the US's adaptation of asymmetric tactics."
  },
  {
    "id": "73b92d4186339003",
    "title_original": "Trump gambles his Iran attack will save flailing Maga agenda",
    "content_original": "The US-Israeli attack on Tehran on Saturday marks a turning point for President Donald Trump, who is wagering that a war – the kind he once vowed not to start – will strengthen his second-term agenda. In a break from his campaign promises to keep the US out of foreign wars, Trump decided to attack – despite what Arab mediators described as significant progress in nuclear talks to Tehran, and in the face of polling showing most Americans oppose fresh military action. It came less than two months...",
    "url": "https://www.scmp.com/news/world/united-states-canada/article/3344999/trump-gambles-his-iran-attack-will-save-flailing-maga-agenda?utm_source=rss_feed",
    "published": "2026-02-28T18:46:15+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Trump gambles his Iran attack will save flailing Maga agenda",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses President Trump's decision to launch an attack on Tehran, marking a shift from his previous stance against foreign wars. This move aims to bolster his political agenda amidst opposition from most Americans and despite progress in nuclear talks with Iran. The strategic significance involves the potential escalation of the conflict and its impact on US domestic politics."
  },
  {
    "id": "daf13efe7c7b4daa",
    "title_original": "As US-Iran conflict flares, thousands of Middle East flights cancelled, airspace closed",
    "content_original": "Flights across the Middle East were being cancelled on Saturday as several countries slammed their airspace shut after the United States and Israel launched strikes on Iran. Iran, Iraq, Israel, Syria, Kuwait and the United Arab Emirates all announced at least partial closures of their skies in the hours after smoke began rising over Tehran and Iran began retaliatory attacks in the region. Iranian missiles hit capital cities around the wealthy Gulf region, killing at least one, as witnesses...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3344995/us-iran-conflict-flares-thousands-middle-east-flights-cancelled-airspace-closed?utm_source=rss_feed",
    "published": "2026-02-28T15:04:19+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US-Iran conflict flares leads to thousands of Middle East flights cancellations and airspace closures",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel launched strikes on Iran, prompting Iran to retaliate with missile attacks on Gulf region capitals, including one fatality. In response, multiple Middle Eastern countries, including Iran, Iraq, Israel, Syria, Kuwait, and the UAE, closed their airspace, leading to thousands of flight cancellations. This escalation highlights the regional impact and potential for broader conflict as hostilities intensify."
  },
  {
    "id": "fd04677b6a0cd6a9",
    "title_original": "Hi-tech aids proposed to help elderly climb stairs to fire-ravaged Tai Po flats",
    "content_original": "Some anxious residents of fire-ravaged Wang Fuk Court have urged Hong Kong authorities to help them climb stairs using makeshift aids when they return to their high-rise homes to collect personal belongings next month. Some lawmakers also proposed on Saturday that the government deploy wearable walking robots, stair-climbing trolleys or wheelchairs to assist elderly residents of the Tai Po estate devastated by the inferno that claimed 168 lives and displaced nearly 5,000 people in November. They...",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3344993/hi-tech-aids-proposed-help-elderly-climb-stairs-fire-ravaged-tai-po-flats?utm_source=rss_feed",
    "published": "2026-02-28T15:03:36+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hi-tech aids proposed to help elderly climb stairs to fire-ravaged Tai Po flats",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0c90503b03f521ae",
    "title_original": "Why US money may not be enough to break China’s rare earths dominance",
    "content_original": "The United States was out in force in Cape Town this month, throwing down a direct challenge to China at Africa’s biggest mining conference, the Investing in African Mining Indaba. While Chinese firms showed their technological leadership with automation and green energy solutions, officials from the State Department, the Department of Energy and several US development agencies were among the record number of American diplomats and financiers at the event in South Africa. Analysts said the US...",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3344957/why-us-money-may-not-be-enough-break-chinas-rare-earths-dominance?utm_source=rss_feed",
    "published": "2026-02-28T15:00:09+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Why US money may not be enough to break China’s rare earths dominance",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d66f292bf41360fa",
    "title_original": "Global powers divided as China expresses ‘deep concern’ over US-Israel strikes on Iran",
    "content_original": "The world woke to a drastically altered Middle East as global powers and regional neighbours scrambled to respond to “Operation Epic Fury”, a “massive and ongoing” joint military assault by the United States and Israel against Iran. Beijing joined a growing chorus of international alarm on Saturday, with the Chinese Foreign Ministry issuing a stern response to the strikes. However, in a display of diplomatic caution, it stopped short of an outright condemnation. “China is deeply concerned about...",
    "url": "https://www.scmp.com/news/us/diplomacy/article/3344994/global-powers-divided-china-expresses-deep-concern-over-us-israel-strikes-iran?utm_source=rss_feed",
    "published": "2026-02-28T14:48:19+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China expresses 'deep concern' over US-Israel strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "China has expressed deep concern over the ongoing joint military assault by the United States and Israel against Iran, indicating a global power divide in response to 'Operation Epic Fury'. This highlights the international community's alarm over the escalation of conflict in the Middle East, with Beijing opting for a cautious approach by not outright condemning the strikes."
  },
  {
    "id": "76f703dedf65ba58",
    "title_original": "Missiles streak across Gulf skies as Iran responds to US-Israel attack",
    "content_original": "Iran responded to Saturday’s attacks by the United States and Israel as it had been threatening to do for months - by first launching a wave of missiles and drones targeting Israel. It followed with strikes targeting US military installations in Bahrain, Kuwait and Qatar. Shrapnel from an Iranian missile attack on the capital of the United Arab Emirates killed one person, state media said. The UAE and Iraq shut down their airspace. Iran’s Foreign Ministry issued a defiant statement, saying that...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3344990/missiles-streak-across-gulf-skies-iran-responds-israel-us-attack?utm_source=rss_feed",
    "published": "2026-02-28T13:52:59+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Missiles streak across Gulf skies as Iran responds to US-Israel attack",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missiles and drones targeting Israel and US military installations in Bahrain, Kuwait, and Qatar in response to US-Israel attacks. The UAE and Iraq closed their airspace after Iranian missile shrapnel killed one person in the UAE capital. This escalation signifies a significant expansion of the conflict across multiple fronts in the region."
  },
  {
    "id": "4e3f220ec62630ec",
    "title_original": "Applications fall short of target as 670 Hongkongers settle in UK with BN(O) visa",
    "content_original": "Nearly 670 Hongkongers have been granted settlement in the United Kingdom under its bespoke BN(O) visa pathway, although the total number of applicants has fallen short of the British government’s lowest “core” estimate five years after its launch. While tens of thousands of Hongkongers are set to qualify for Indefinite Leave to Remain, or settled status, this year, experts suggested that uncertainties over the UK’s long-term settlement of migrants could deter future applications. The UK...",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3344988/670-hongkongers-granted-settlement-uk-under-bno-visa-scheme-launch?utm_source=rss_feed",
    "published": "2026-02-28T13:42:04+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "670 Hongkongers settle in UK with BN(O) visa as applications fall short of target",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "fea5dabee1d64851",
    "title_original": "US-Israeli strike on Iran signals new phase of global escalation",
    "content_original": "The coordinated US and Israeli strikes inside Iran mark more than another episode in a long-running confrontation. They represent a structural escalation – one whose consequences extend well beyond the Middle East. This is not the start of a new war. It is the next stage in a conflict that has been unfolding since October 2023, gradually shifting from proxy exchanges and shadow operations to direct state-on-state confrontation. On February 28, Washington moved from strategic backstop to visible...",
    "url": "https://www.scmp.com/opinion/world-opinion/article/3344982/us-israeli-strike-iran-signals-new-phase-global-escalation?utm_source=rss_feed",
    "published": "2026-02-28T13:20:08+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US-Israeli strike on Iran signals new phase of global escalation",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel conducted coordinated strikes inside Iran, marking a significant escalation in the ongoing conflict. This move signifies a shift from proxy warfare to direct state-on-state confrontation, with implications extending beyond the Middle East. The strikes, occurring on February 28, indicate a change in US strategy from a strategic backstop to a more visible role in the conflict."
  },
  {
    "id": "91c0e59a3664f3ae",
    "title_original": "Cathay Pacific suspends all Middle East operations after US-Israeli attack on Iran",
    "content_original": "Hong Kong flagship carrier Cathay Pacific Airways suspended all passenger and cargo flights to and from the Middle East on Saturday following a joint US-Israeli attack on Iran. The move was announced on Saturday evening after Hong Kong’s Airport Authority said that at least nine flights have been cancelled or postponed, while the government issued a fresh warning against travel to Iran. The warning came after the United States and Israel launched major air strikes on targets across Iran on...",
    "url": "https://www.scmp.com/news/hong-kong/politics/article/3344987/hong-kong-issues-fresh-warning-against-travel-iran-amid-us-israeli-air-strikes?utm_source=rss_feed",
    "published": "2026-02-28T13:16:45+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Cathay Pacific suspends Middle East flights after US-Israeli attack on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "Cathay Pacific has halted all passenger and cargo flights to and from the Middle East following a joint US-Israeli air strike on Iran. The suspension follows the cancellation or postponement of at least nine flights and a travel warning issued by Hong Kong's government. This development highlights the escalating regional tensions and disruptions to civilian aviation caused by the ongoing conflict."
  },
  {
    "id": "d8645814218d7e6c",
    "title_original": "Taiwan is buying expensive US weapons systems, but are they the right ones?",
    "content_original": "Taiwan’s procurement of three US arms packages has come under renewed scrutiny, with military experts now questioning their effectiveness in deterring Beijing. The debate has sharpened after opposition parties repeatedly blocked a proposed NT$1.25 trillion (US$40 billion) special defence budget in the legislature’s procedure committee last month. At the centre of the latest criticism are three US-approved systems for Taiwan: the Patriot PAC-3 missile defence system and its upgrades, the National...",
    "url": "https://www.scmp.com/news/china/military/article/3344968/taiwan-buying-expensive-us-weapons-systems-are-they-right-ones?utm_source=rss_feed",
    "published": "2026-02-28T13:00:09+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Taiwan's procurement of US weapons systems under scrutiny",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "466c2d82676a9208",
    "title_original": "US-Israel attack on Iran: how it unfolded",
    "content_original": "Starting before his first term, Donald Trump has issued a litany of threats against Washington’s arch-enemy Iran, while also urging it to talks. He warned in late January that “time is running out”, urging Tehran to “make a deal”. After indirect talks resumed between the two nations, he threatened Iran on February 12 with “very traumatic” consequences, giving them “10, 15 days, pretty much maximum” to reach an agreement. Israel’s leader Benjamin Netanyahu has for decades cast Iran’s nuclear...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3344984/us-israel-attack-iran-how-it-unfolded?utm_source=rss_feed",
    "published": "2026-02-28T12:18:15+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US-Israel attack on Iran: how it unfolded",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the escalating tensions between the US, Israel, and Iran, focusing on Trump's threats and urging Iran to negotiate. It highlights the potential for military action if Iran does not comply with demands, reflecting the ongoing conflict and the strategic significance of the situation in the region."
  },
  {
    "id": "0eb950b1914b0172",
    "title_original": "North Korea unveils image of Kim’s teenage daughter firing rifle at shooting range",
    "content_original": "North Korean leader Kim Jong-un gifted new sniper rifles to top government and military officials following a weeklong ruling party congress celebrating his leadership, with state media highlighting an image of his teenage daughter taking aim at a shooting range as her increasingly prominent appearances fuel speculation Kim is grooming her as a future leader. Kim presented the rifles to senior party and military officials on Friday, calling them a sign of his “absolute trust” and gratitude for...",
    "url": "https://www.scmp.com/news/asia/east-asia/article/3344959/north-korea-unveils-image-kims-teenage-daughter-firing-rifle-shooting-range?utm_source=rss_feed",
    "published": "2026-02-28T12:00:09+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Kim Jong-un gifts sniper rifles to officials, daughter seen at shooting range",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "65ceb31b4ebaaee7",
    "title_original": "CK Hutchison subsidiary slams Panama over ‘unnotified intrusion’ at storage site",
    "content_original": "A subsidiary of Hong Kong conglomerate CK Hutchison Holdings has accused Panamanian authorities of undermining due process by making an “unnotified intrusion” at a facility storing materials related to ongoing legal proceedings. The Panama Ports Company (PPC) on Friday accused the country’s government of creating a crisis, calling the “illegal takeover” of two port facilities at the Panama Canal a failure to comply with “constitutional, contractual and international obligations”. The former...",
    "url": "https://www.scmp.com/news/hong-kong/politics/article/3344983/ck-hutchison-subsidiary-slams-panama-over-unnotified-intrusion-storage-site?utm_source=rss_feed",
    "published": "2026-02-28T11:29:00+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "CK Hutchison subsidiary accuses Panama of illegal takeover of port facilities",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "72ab6bfc1e9dacef",
    "title_original": "What military assets does the US have in the Middle East?",
    "content_original": "The massive US military presence in the Middle East, including warships, fighter jets and refuelling aircraft, lays the foundation for a major campaign against Iran. Here we examine key US military assets deployed in the region, after Washington launched strikes that President Donald Trump said were targeting Tehran’s naval and missile forces. Ships Washington currently has more than a dozen warships in the Middle East, including aircraft carrier the USS Abraham Lincoln operating in the Arabian...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3344980/what-military-assets-does-us-have-middle-east?utm_source=rss_feed",
    "published": "2026-02-28T11:07:32+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US Military Assets in the Middle East Prepared for Campaign Against Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The US has deployed a significant military presence in the Middle East, including over a dozen warships, fighter jets, and refueling aircraft, with the USS Abraham Lincoln aircraft carrier operating in the Arabian Sea. This buildup is in response to recent US strikes targeting Iran's naval and missile forces, indicating a potential escalation in the conflict."
  },
  {
    "id": "5441556a5e530789",
    "title_original": "Scam-hit Cambodia tries to woo Hong Kong but travel agencies have doubts",
    "content_original": "The head of Cambodia’s tourism body is looking to build partnerships with Hong Kong travel agencies as part of a drive to get visitors returning to his country, which has been plagued by safety concerns in recent years. Cambodia Tourism Board CEO Kim Minea also told the South China Morning Post that the government was “determined” to eliminate the notorious scam compounds that had trapped thousands of people, including Hongkongers, in recent years. But Hong Kong tour operators said safety was...",
    "url": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344979/scam-hit-cambodia-tries-woo-hong-kong-travel-agencies-have-doubts?utm_source=rss_feed",
    "published": "2026-02-28T10:56:52+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Cambodia seeks to attract Hong Kong tourists amid safety concerns",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ac943fbf744d8a14",
    "title_original": "Aspiring taxi drivers taking tests each month up 30% after simplified assessment",
    "content_original": "The average number of aspiring Hong Kong taxi drivers taking a crucial industry test each month has increased by nearly 30 per cent following the launch of a simplified version of the assessment last year, the transport minister has said. Secretary for Transport and Logistics Mable Chan also said on Saturday that the government was increasing the number of dedicated meeting spaces for the city’s five premium taxi fleets at cultural and business landmarks. “We streamlined the written test...",
    "url": "https://www.scmp.com/news/hong-kong/transport/article/3344976/aspiring-taxi-drivers-taking-tests-each-month-30-after-simplified-assessment?utm_source=rss_feed",
    "published": "2026-02-28T10:06:20+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Aspiring taxi drivers taking tests up 30% after simplified assessment",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "42a745b066c14297",
    "title_original": "Why won’t Chile let China’s Silk Road Ark military hospital ship give medical aid?",
    "content_original": "The Chilean government has turned down a request from a Chinese military hospital ship to treat Chilean residents on board the vessel. The decision reflects Santiago’s tilt towards Washington and US efforts to exert more influence in the western hemisphere, according to a Chinese academic. The Chilean Ministry of Health said on Friday that it had reviewed the Silk Road Ark’s request and decided not to grant it, citing a health code that restricts such services to professionals accredited ‌in the...",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3344972/why-wont-chile-let-chinas-silk-road-ark-military-hospital-ship-give-medical-aid?utm_source=rss_feed",
    "published": "2026-02-28T10:00:30+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Chile rejects China's request for military hospital ship to provide medical aid",
    "relevant": true,
    "translated": true,
    "summary_en": "Chile has denied a request from China's Silk Road Ark military hospital ship to provide medical aid to Chilean residents, reflecting Santiago's alignment with Washington and US influence in the region. The decision highlights geopolitical tensions as the US seeks to exert more influence in the western hemisphere."
  },
  {
    "id": "6a2fe84b3c0ad618",
    "title_original": "China village holds ceremony where 600 men bow in homage to ancestors, igniting gender debate",
    "content_original": "A traditional ceremony in a village in eastern China, where men bow and kowtow in reverence to their ancestors while women watch from the sidelines, has ignited debate over gender roles in cultural practices. In February, a viral video captured a compelling scene from Dalei village in Yanggu county, Shandong province, during the Chinese New Year holiday. The footage shows more than 600 men from the Lei clan lined up along a red carpet in front of the ancestral hall. Arranged by age and lineage,...",
    "url": "https://www.scmp.com/news/people-culture/gender-diversity/article/3344612/china-village-holds-ceremony-where-600-men-bow-homage-ancestors-igniting-gender-debate?utm_source=rss_feed",
    "published": "2026-02-28T10:00:11+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China village ceremony sparks gender role debate",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0dca0ac85a7c99c5",
    "title_original": "US-Iran-Israel crisis: who are the main players?",
    "content_original": "The United States and Israel launched strikes against Iran on Saturday following failed negotiations and a crackdown on mass protests against the Islamic republic. Here are the key actors in the crisis: US President Donald Trump The president has sought to position himself as a global peacemaker, but on Iran he has taken a consistently hard line. Last year, his forces joined Israel’s war with the Islamic republic by conducting strikes on nuclear sites. During the mass protests that shook Iran...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3344974/us-iran-israel-crisis-who-are-main-players?utm_source=rss_feed",
    "published": "2026-02-28T09:44:05+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US-Iran-Israel crisis: who are the main players?",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the key actors in the ongoing US-Iran-Israel conflict, highlighting recent strikes by the US and Israel against Iran following failed negotiations and domestic unrest. It mentions US President Donald Trump's hardline stance and involvement in strikes on Iranian nuclear sites, indicating the strategic significance of the crisis and the involvement of multiple nations."
  },
  {
    "id": "4eb3cbdd5cefda3f",
    "title_original": "MWC 2026: Alibaba to launch new smart glasses powered by Qwen AI assistant",
    "content_original": "Alibaba Group Holding plans to launch new smart glasses powered by its artificial intelligence assistant Qwen at the coming MWC Barcelona trade show. On Saturday, a company representative confirmed the launch, adding that both online and offline presales would start on Monday, the first day of the annual trade show, formerly known as Mobile World Congress. Meanwhile, the company, which owns the South China Morning Post, is preparing a diverse product line-up this year for the global market,...",
    "url": "https://www.scmp.com/tech/article/3344971/mwc-2026-alibaba-launch-new-smart-glasses-powered-qwen-ai-assistant?utm_source=rss_feed",
    "published": "2026-02-28T09:16:43+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Alibaba to launch new smart glasses at MWC 2026",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "320ba2690f679784",
    "title_original": "Cruise ship calls in Hong Kong may top 200 this year, tourism minister says",
    "content_original": "Cruise ship calls in Hong Kong may exceed 200 this year, the city’s tourism minister has said, as she revealed that authorities will consider measures to create synergy between the terminal and an emerging cultural hub in Kai Tak. Secretary for Culture, Sports and Tourism Rosanna Law Shuk-pui on Saturday also said cruise ships made 189 port calls in 2025, representing 88 per cent of peak levels, and Chinese vessels might stop in the city this year, which she described as “refreshing news”. “It’s...",
    "url": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344969/cruise-ship-calls-hong-kong-may-top-200-year-tourism-minister-says?utm_source=rss_feed",
    "published": "2026-02-28T08:41:44+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Cruise ship calls in Hong Kong may top 200 this year",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "447f09ec4614627f",
    "title_original": "Why Japan should push back on Trump’s investment demands",
    "content_original": "Ahead of Japanese Prime Minister Sanae Takaichi’s scheduled summit next month with US President Donald Trump, the message from Tokyo appears to be that the US Supreme Court decision to invalidate Trump’s “reciprocal” tariffs will not affect Japan’s promised capital investment projects in the United States. That could prove a costly misstep for Japan. With the Supreme Court invalidating the legal basis for Trump’s reciprocal tariffs, countries that have concluded trade agreements with the US...",
    "url": "https://www.scmp.com/opinion/asia-opinion/article/3344733/why-japan-should-push-back-trumps-investment-demands?utm_source=rss_feed",
    "published": "2026-02-28T08:30:08+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Why Japan should push back on Trump’s investment demands",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "a53328fe4ee9bcea",
    "title_original": "From EVs to steel, how China’s price-setting deals are easing trade tensions",
    "content_original": "China and South Korea have resolved a trade dispute over hot-rolled steel coils through a price-undertaking deal, mirroring the solution used in China’s electric vehicle (EV) stand-off with the European Union. Analysts say the deal, which will see exporters raise export prices to avoid anti‑dumping duties, could avert punitive tariffs and safeguard market access for Chinese exports. The China Iron and Steel Association said in a statement issued on Thursday night that it “welcomed and supported”...",
    "url": "https://www.scmp.com/economy/china-economy/article/3344898/evs-steel-how-chinas-price-setting-deals-are-easing-trade-tensions?utm_source=rss_feed",
    "published": "2026-02-28T08:00:09+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China and South Korea resolve trade dispute over steel through price-undertaking deal",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b316ca429518e104",
    "title_original": "Pakistan-Taliban showdown risks becoming a protracted war of attrition",
    "content_original": "Pakistan and Afghanistan’s Taliban authorities are locked in a widening tit-for-tat confrontation that neither side seems willing to defuse, analysts said, warning the exchanges risked settling into a prolonged conflict along one of Asia’s most volatile borders. Islamabad has vowed to keep striking military targets inside Afghanistan until the Taliban takes action against the Tehreek-i-Taliban Pakistan (TTP) and other militant groups Pakistan says operate from Afghan soil. Pakistani warplanes...",
    "url": "https://www.scmp.com/week-asia/politics/article/3344965/pakistan-taliban-showdown-risks-becoming-protracted-war-attrition?utm_source=rss_feed",
    "published": "2026-02-28T08:00:08+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Pakistan-Taliban showdown risks becoming a protracted war of attrition",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b1ff2586b938653b",
    "title_original": "Trump tells Iranians to overthrow government as US-Israeli strikes start ‘major’ operation",
    "content_original": "Donald Trump called on the Iranian people to overthrow their government after the United States and Israel launched strikes against Iran early on Saturday in what the US president described as “major combat operations”. “We are going to destroy their missiles and raze their missile industry to the ground. It will be totally … obliterated. We are going to annihilate their navy. We’re going to ensure that the region’s terrorist proxies can no longer destabilise the region or the world and attack...",
    "url": "https://www.scmp.com/news/world/article/3344963/israel-launches-preemptive-strike-against-iran-saying-it-seeks-remove-threats?utm_source=rss_feed",
    "published": "2026-02-28T06:46:02+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Trump calls for Iranian regime change as US-Israeli strikes begin 'major' operation",
    "relevant": true,
    "translated": true,
    "summary_en": "Former US President Donald Trump urged Iranians to overthrow their government as the US and Israel initiated major combat operations against Iran, targeting missile sites and naval assets. This escalation aims to eliminate Iran's missile capabilities and deter regional proxy groups from destabilizing activities, signaling a significant intensification of the conflict."
  },
  {
    "id": "f3cdca9d9370dc34",
    "title_original": "Meet Habibi – the Chinese AI uniting 20 Arabic dialects in a Middle East first",
    "content_original": "Chinese researchers have released the world’s first open-source text-to-speech (TTS) model that unifies more than 20 Arabic dialects in an AI framework, a move poised to expand China’s technological influence in the Middle East, according to analysts. Led by Shanghai Jiao Tong University’s X-LANCE Lab – one of China’s top audiovisual and language processing research entities – the model is named Habibi, meaning “my dear” in Arabic. In presenting their findings, the research team spearheaded by...",
    "url": "https://www.scmp.com/news/china/article/3344955/meet-habibi-chinese-ai-uniting-20-arabic-dialects-middle-east-first?utm_source=rss_feed",
    "published": "2026-02-28T06:00:26+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Chinese AI Unites 20 Arabic Dialects in Middle East First",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ac4058bd8a02d56a",
    "title_original": "India’s AI superpower dream lands US$200 billion – now comes the hard part",
    "content_original": "As tech titans and world leaders descended on New Delhi for the India AI Impact Summit in February, Prime Minister Narendra Modi set out his ambition for the country to become a major global power in artificial intelligence – a technology currently dominated by the United States and China. “My vision is that India should be among the top three AI superpowers globally, not just in the consumption of AI but in creation,” Modi told Asian News International in an interview about the summit. Top tech...",
    "url": "https://www.scmp.com/week-asia/economics/article/3344919/indias-ai-superpower-dream-lands-us200-billion-now-comes-hard-part?utm_source=rss_feed",
    "published": "2026-02-28T06:00:13+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "India aims to become a top AI superpower with $200 billion investment",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8b0b57052b258490",
    "title_original": "Quirky China: panda won’t return phone, talented piglet spared from dinner, affordable gold rush",
    "content_original": "A panda in China which would not let go of a mobile phone a tourist accidentally dropped into his enclosure has been dubbed a ‘smartphone addict’ by online observers. On February 22, a visitor accidentally dropped their mobile phone while filming the giant panda, Qingling, at the Dujiangyan Panda Base in southwestern China’s Sichuan province. The three-year-old panda grabbed the phone as if it were his new toy. He played around with it and even held it in a way that looked like he was taking a...",
    "url": "https://www.scmp.com/news/people-culture/trending-china/article/3344599/quirky-china-panda-wont-return-phone-talented-piglet-spared-dinner-affordable-gold-rush?utm_source=rss_feed",
    "published": "2026-02-28T06:00:11+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Quirky China: panda won’t return phone, talented piglet spared from dinner, affordable gold rush",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8acd81dc4eb5a185",
    "title_original": "No Exchange Fund withdrawal in next 5 years after latest transfers: Paul Chan",
    "content_original": "Hong Kong does not plan to make another transfer from its Exchange Fund in the next five years, the finance chief has said, citing a new medium-range forecast that explains why the rare move will not be repeated. Financial Secretary Paul Chan Mo-po elaborated on his plan on Saturday, after his budget announcement that he would withdraw HK$150 billion (US$19.2 billion) from the government’s main investment arm and de facto sovereign wealth fund sparked concerns about the city’s financial...",
    "url": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3344962/no-exchange-fund-transfers-planned-next-5-years-hong-kongs-paul-chan-says?utm_source=rss_feed",
    "published": "2026-02-28T05:49:01+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hong Kong Finance Chief Rules Out Exchange Fund Withdrawal for Next 5 Years",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9002c86f8d79ea36",
    "title_original": "Plane carrying money crashes in Bolivia, killing 15 and sparking rush to pick bills",
    "content_original": "A cargo plane carrying money crashed on Friday near Bolivia’s capital, damaging about a dozen vehicles on the highway, scattering bills on the ground and leaving at least 15 people dead and others injured, an official said. Defence Minister Marcelo Salinas said the Hercules C-130 plane was transporting newly printed Bolivian currency when it “landed and veered off the runway” at an airport in El Alto, a city near the capital of La Paz, before ending up in a nearby field. Firefighters managed to...",
    "url": "https://www.scmp.com/news/world/americas/article/3344961/plane-carrying-money-crashes-bolivia-killing-15-and-sparking-rush-pick-bills?utm_source=rss_feed",
    "published": "2026-02-28T05:25:57+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Cargo plane carrying money crashes in Bolivia, killing 15",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "38e388ce1c944906",
    "title_original": "US government seeks delay on tariff refund court hearing, faces above 2,000 lawsuits",
    "content_original": "The Trump administration is seeking to delay court proceedings over whether it must refund importers billions of dollars in tariffs recently struck down by the US Supreme Court, marking a contentious start to the next phase of the legal fight. The government wants to wait as long as four months before reviving litigation before the US Court of International Trade on the refund question, according to a filing by the Justice Department late Friday. “Complexity in the future counsels appropriately...",
    "url": "https://www.scmp.com/news/us/economy-trade-business/article/3344958/us-government-seeks-delay-tariff-refund-court-hearing-faces-above-2000-lawsuits?utm_source=rss_feed",
    "published": "2026-02-28T04:27:05+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "US government seeks delay on tariff refund court hearing",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "6f8a9638daaca9ab",
    "title_original": "Cutting-edge Chinese gene-editing technique raises prospect of new autism treatments",
    "content_original": "Chinese scientists have used a cutting-edge gene-editing tool to correct a DNA mutation responsible for cognitive and behavioural problems – a move that could eventually lead to the development of new autism therapies. In lab tests, mice that had been engineered to have the mutation showed a striking change in their behaviour, such as the way they interacted with other mice, after being given an injection to introduce the edited genes. The Shanghai-based research team is looking for ways to...",
    "url": "https://www.scmp.com/news/china/science/article/3344950/cutting-edge-chinese-gene-editing-technique-raises-prospect-new-autism-treatments?utm_source=rss_feed",
    "published": "2026-02-28T04:00:21+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Chinese gene-editing breakthrough could lead to new autism treatments",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "1977e141d5d57626",
    "title_original": "Commercial EV use needs boost after car owner tax break ends, green groups say",
    "content_original": "Hong Kong environmental groups have urged the government to focus on accelerating the commercial use of electric vehicles and enhancing green infrastructure, after scrapping a tax concession scheme for private cars that has cost HK$30 billion over the past decade. Green groups said on Friday that they supported the government’s decision to end the first registration tax (FRT) concessions for private electric cars, including the “One-for-One Replacement Scheme”. The move was announced by...",
    "url": "https://www.scmp.com/news/hong-kong/transport/article/3344934/commercial-ev-use-needs-boost-after-car-owner-tax-break-ends-green-groups-say?utm_source=rss_feed",
    "published": "2026-02-28T04:00:16+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Commercial EV use needs boost after car owner tax break ends, green groups say",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ed164aaf664bca70",
    "title_original": "Operation Santa Claus: Hong Kong children find joy and inclusion in mochi-making",
    "content_original": "Corporate volunteers from Hong Kong’s Chinachem Group joined children with special educational needs for a mochi-making workshop held ahead of Chinese New Year, as part of the company’s annual charity campaign. The workshop, held in partnership with the charity TREATS, brought participants together to make traditional festive food. TREATS is among the beneficiaries of Operation Santa Claus (OSC), an annual fundraising campaign jointly organised by the South China Morning Post and RTHK. Amy Wu,...",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3344956/operation-santa-claus-hong-kong-children-find-joy-and-inclusion-mochi-making?utm_source=rss_feed",
    "published": "2026-02-28T03:41:04+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hong Kong children participate in mochi-making workshop for Chinese New Year",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "5e63a6283cec640d",
    "title_original": "UN rights chief slams violence against women, calls it ‘a global emergency’",
    "content_original": "The UN rights chief on Friday decried mounting threats to women’s rights worldwide, highlighting rampant femicide and horrific abuse exposed in cases like that of US sex offender Jeffrey Epstein. Addressing the United Nations Human Rights Council in Geneva, Volker Turk denounced “social systems that silence women and girls” allowing powerful men to abuse them with impunity. “Violence against women, including femicide, is a global emergency,” the High Commissioner for Human Rights told the UN’s...",
    "url": "https://www.scmp.com/news/world/article/3344952/un-rights-chief-slams-violence-against-women-calls-it-global-emergency?utm_source=rss_feed",
    "published": "2026-02-28T03:15:35+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "UN rights chief calls violence against women a global emergency",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "71ee5a57151e4c10",
    "title_original": "Afghanistan’s Taliban open to talks with Pakistan as ‘open war’ continues",
    "content_original": "Afghanistan’s Taliban rulers said on Friday they were willing to negotiate after Pakistan ⁠bombed their forces in major cities and said the allies-turned-foes were in “open war”. Pakistan struck the Afghan capital Kabul, the city of Kandahar, where Taliban leaders were based, and other towns, a Taliban spokesman said. The attacks were its first directly targeting Afghanistan’s government over allegations it harbours militants seeking to overthrow the Islamabad government. Taliban spokesman...",
    "url": "https://www.scmp.com/news/asia/south-asia/article/3344949/afghanistans-taliban-open-talks-pakistan-open-war-continues?utm_source=rss_feed",
    "published": "2026-02-28T02:09:21+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Taliban open to talks with Pakistan amid ongoing conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan launched airstrikes on Taliban forces in Kabul, Kandahar, and other Afghan cities, marking a significant escalation in tensions between the two nations. The attacks were in response to allegations that the Taliban harbors militants targeting Pakistan's government. This development could have regional implications for stability and security in South Asia."
  },
  {
    "id": "47d06b64c01241d3",
    "title_original": "Man claiming to have Aids arrested after hijacking Hong Kong bus, causing crash",
    "content_original": "A man who claims to have Aids has been arrested after hijacking a bus in Hong Kong and causing it to crash, the South China Morning Post has learned. A source said the 28-year-old mainland Chinese man, surnamed Miao, had blood stains on his hands when he was apprehended. The man also incoherently spoke in Chinese and appeared dazed, according to the insider. The 54-year-old Citybus driver, surnamed Choi, made a report to police at 6.45pm on Friday after upper-deck passengers told him that Miao...",
    "url": "https://www.scmp.com/news/hong-kong/law-and-crime/article/3344948/man-claiming-have-aids-arrested-after-hijacking-hong-kong-bus-causing-crash?utm_source=rss_feed",
    "published": "2026-02-28T02:02:12+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Man claiming to have Aids arrested after hijacking Hong Kong bus, causing crash",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7c62a5ea6efc085f",
    "title_original": "The big cornerstone comeback: what’s driving investors back to Hong Kong IPOs?",
    "content_original": "Until last year, Fidelity International’s most significant cornerstone commitments on the Hong Kong initial public offering (IPO) market dated back to 2021, when Chinese short-video platform Kuaishou Technology raised US$5.4 billion and healthcare firm Medlive Technology completed a US$543.4 million listing. Then for the next four years, the asset manager went quiet. Late last year it returned to Chinese assets in force. It backed gold miner Zijin Gold International’s US$3.2 billion listing in...",
    "url": "https://www.scmp.com/business/banking-finance/article/3344890/big-cornerstone-comeback-whats-driving-investors-back-hong-kong-ipos?utm_source=rss_feed",
    "published": "2026-02-28T02:00:57+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Investors return to Hong Kong IPOs",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7107a66f6ddf9e87",
    "title_original": "China’s pivot from GDP obsession sparks cadre confusion, testing local governance",
    "content_original": "Ahead of China’s annual legislative meetings – typically a window into Beijing’s top-level policy agenda – this is the second entry in a series examining the complex economic recalibration driving China’s growth philosophy and its wide-ranging implications for local governments, financial investors and private enterprises. Beijing’s campaign to purge the bureaucracy of a growth-at-all-costs mindset has caught some local officials off guard, triggering a mix of confusion and contradictory...",
    "url": "https://www.scmp.com/economy/china-economy/article/3344887/chinas-pivot-gdp-obsession-sparks-cadre-confusion-testing-local-governance?utm_source=rss_feed",
    "published": "2026-02-28T02:00:49+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China’s pivot from GDP obsession sparks cadre confusion, testing local governance",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "2148eba6472e2ab7",
    "title_original": "Breakthrough or hype? How WeRide aims to steer past rivals in crowded robotaxi field",
    "content_original": "WeRide, one of China’s big three robotaxi companies, has cut research and development (R&amp;D) costs by “millions” of US dollars by using artificial intelligence to train its fleet in virtual worlds, its CEO said. While rivals had also developed AI models simulating the physical world, WeRide’s efforts stood out as it was using its world model Genesis to support its global expansion strategy, said Tony Han. “It’s the first real marriage between physical AI and generative AI,” Han told the South...",
    "url": "https://www.scmp.com/tech/article/3344817/breakthrough-or-hype-how-weride-aims-steer-past-rivals-crowded-robotaxi-field?utm_source=rss_feed",
    "published": "2026-02-28T02:00:38+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Breakthrough or hype? How WeRide aims to steer past rivals in crowded robotaxi field",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "969f1233a57ec7ad",
    "title_original": "Central Asia’s plan to bypass Russia and Iran? Railways through Afghanistan and Pakistan",
    "content_original": "Central Asia has long been someone else’s crossroads. Squeezed between an overbearing Russia to the north and an increasingly unstable Iran to the west, the region’s landlocked ex-Soviet republics have settled on a different solution: send railways south, through Taliban-controlled Afghanistan, all the way to the Arabian Sea. Kazakhstan and Uzbekistan – Central Asia’s two largest economies – have in recent months struck preliminary multilateral agreements for the construction of two...",
    "url": "https://www.scmp.com/week-asia/economics/article/3344798/central-asias-plan-bypass-russia-and-iran-railways-through-afghanistan-and-pakistan?utm_source=rss_feed",
    "published": "2026-02-28T02:00:14+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Central Asia plans to bypass Russia and Iran with railways through Afghanistan and Pakistan",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "fa0bbe12ee37808e",
    "title_original": "After celebrating its surplus, Hong Kong must work on sustaining it",
    "content_original": "Following a challenging cycle, Financial Secretary Paul Chan Mo-po has delivered a budget returning Hong Kong to the black. After consecutive operating deficits, the operating account has returned to profit. Simultaneously, the consolidated account records a HK$2.9 billion (US$370.6 million) surplus for 2025/26, signalling stability. This turnaround is driven largely by a buoyant stock market and a stabilising property sector, reviving stamp duty revenues and investment income. This provides...",
    "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3344819/after-celebrating-its-surplus-hong-kong-must-work-sustaining-it?utm_source=rss_feed",
    "published": "2026-02-28T01:30:07+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hong Kong records budget surplus after period of deficits",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "4a771ca3122d302f",
    "title_original": "Denmark warns of interference from Russia, US in its election",
    "content_original": "Denmark’s intelligence services have warned that foreign powers may seek to interfere in the country’s March 24 general election, singling out Russia as the primary threat but also flagging the US and China as potential sources of influence. In a statement published on Friday night, the Danish Security and Intelligence Service said it was “highly likely” that Denmark was a prioritised target for Russian influence activities due to the Nordic nation’s support for Ukraine. It also cited rising...",
    "url": "https://www.scmp.com/news/world/europe/article/3344947/denmark-warns-interference-russia-us-its-election?utm_source=rss_feed",
    "published": "2026-02-28T01:10:37+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Denmark warns of election interference from Russia, US, and China",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "5d1883fbc11ee58a",
    "title_original": "Cultural clash: K-pop superstar G-Dragon divides China fans with ‘Lunar New Year’ greetings",
    "content_original": "K-pop superstar G-Dragon ignited the ire of Chinese netizens with his choice of “Lunar New Year” greetings during a recent performance in Dubai. His reported act of liking a post that supported his terminology afterwards was interpreted as a provocative stance. The controversy emerged on February 17, coinciding with the first day of Chinese New Year. The KRAZY Super Concert, headlined by G-Dragon, featured an array of K-pop artists and pop singers from across Asia, including Indonesian singer...",
    "url": "https://www.scmp.com/news/people-culture/trending-china/article/3344922/cultural-clash-k-pop-superstar-g-dragon-divides-china-fans-lunar-new-year-greetings?utm_source=rss_feed",
    "published": "2026-02-28T01:00:20+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "K-pop star G-Dragon sparks controversy with Lunar New Year greetings in China",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "829980e19c42b9bd",
    "title_original": "Once close allies, Pakistan and Afghan Taliban are now trading fire. What went wrong?",
    "content_original": "Pakistan has been the Afghan Taliban’s closest friend for decades. It was Islamabad ⁠that helped give birth to the Taliban in the ⁠early 1990s – as a way to give Pakistan “strategic depth” in its ⁠rivalry with India. What’s gone wrong? Pakistan carried out air strikes on Afghanistan’s major cities overnight, officials in Islamabad and Kabul said on Friday, escalating months of border clashes between the Islamic neighbours. The air and ground strikes, which hit Taliban military posts,...",
    "url": "https://www.scmp.com/news/asia/south-asia/article/3344904/once-close-allies-pakistan-and-afghan-taliban-are-now-trading-fire-what-went-wrong?utm_source=rss_feed",
    "published": "2026-02-28T01:00:13+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Pakistan launches air strikes on Afghan Taliban targets",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan carried out air and ground strikes on Taliban military posts in major Afghan cities, escalating months of border clashes. This signifies a breakdown in relations between former allies and could further destabilize the region. The strikes highlight Pakistan's attempt to address security concerns along its border with Afghanistan."
  },
  {
    "id": "efcb9ba59fd485d8",
    "title_original": "First batch of Hong Kong landlords spend millions fixing subdivided flats ahead of new law",
    "content_original": "Some Hong Kong landlords have spent millions renovating their subdivided flats to be among the first to meet the new standards coming into effect on Sunday, but many others remain taken aback by the high costs and are unsure whether to proceed. Building experts have also warned of the challenges facing landlords seeking certification under the new law, including meeting waterproofing and fire safety requirements, which will require professional advice and supervision. Matthew Lau Chi-kwong, a...",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3344935/hong-kong-landlords-split-over-costly-upgrades-meet-subdivided-housing-law?utm_source=rss_feed",
    "published": "2026-02-28T00:00:15+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Hong Kong landlords renovate subdivided flats ahead of new law",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ddffb7956b7d4c15",
    "title_original": "Why ‘twin look’ of North Korea’s Kim Jong-un, daughter sparks succession talk",
    "content_original": "During North Korea’s latest military parade, images of its leader Kim Jong-un and his daughter wearing near-identical leather coats have prompted Pyongyang observers to speculate whether the stage is set for the next chapter in the ruling family’s history. For them, the “twin look” is another instance of carefully directed political theatre to burnish the standing of the Kims in the reclusive country for the long term. At the close of the ruling Workers’ Party’s ninth congress on Wednesday...",
    "url": "https://www.scmp.com/week-asia/politics/article/3344929/why-twin-look-north-koreas-kim-jong-un-daughter-sparks-succession-talk?utm_source=rss_feed",
    "published": "2026-02-28T00:00:13+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Why ‘twin look’ of North Korea’s Kim Jong-un, daughter sparks succession talk",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "e0f7cab2359b3d66",
    "title_original": "Anthropic vows to sue US after Trump’s call to stop using firm’s AI, OpenAI reaches deal",
    "content_original": "President Donald Trump told the US government on Friday to “immediately” stop using Anthropic’s technology after the AI start-up rejected the Pentagon’s demand that it agree to unconditional military use of its Claude models. Anthropic insists its technology should not be used for the mass surveillance of US citizens or deployed in fully autonomous weapons systems, while the Pentagon says it operates within the law and that contracted suppliers cannot set terms on how their products are...",
    "url": "https://www.scmp.com/news/world/united-states-canada/article/3344946/trump-tells-us-government-immediately-stop-using-anthropic-ai-tech?utm_source=rss_feed",
    "published": "2026-02-27T22:19:58+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Anthropic threatens to sue US after Trump calls to halt AI firm's tech use",
    "relevant": true,
    "translated": true,
    "summary_en": "Anthropic, an AI startup, is in conflict with the US government after rejecting the Pentagon's demand for unconditional military use of its Claude models. President Trump has urged the US to stop using Anthropic's technology, while the company insists its AI should not be used for mass surveillance or autonomous weapons. This dispute highlights tensions over AI ethics and military applications."
  },
  {
    "id": "1c925073b9907307",
    "title_original": "Sherry Xue jailed for funnelling Chinese investor funds to Trump campaign",
    "content_original": "A New York businesswoman was sentenced on Friday to nine years in federal prison over a financial scheme that ripped off more than US$30 million from foreign investors and funnelled some of the stolen money into American political campaigns, including a fundraiser for US President Donald Trump. Sherry Xue Li was also ordered to forfeit US$31.5 million, as well as property at three locations, and to make restitution to her victims. The 54-year-old Oyster Bay resident, who has been detained since...",
    "url": "https://www.scmp.com/news/world/united-states-canada/article/3344944/sherry-xue-jailed-funnelling-chinese-investor-funds-trump-campaign?utm_source=rss_feed",
    "published": "2026-02-27T22:03:17+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Sherry Xue jailed for funnelling Chinese investor funds to Trump campaign",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b5318b3f1dbf61c9",
    "title_original": "5 years and 1 election later, why China’s Myanmar dilemma still isn’t over",
    "content_original": "Early in 2021, Chinese Foreign Minister Wang Yi visited Myanmar’s capital Naypyidaw and held talks with both General Min Aung Hlaing, the chief of the armed forces, and Aung San Suu Kyi, the de facto leader of the civilian government. The meeting was a chance for China to voice support for Myanmar’s “national conditions” development path and signal China’s long-term pragmatic approach to ties with its southwestern neighbour, irrespective of who was in power. That strategy, however, came under...",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3343830/5-years-and-1-election-later-why-chinas-myanmar-dilemma-still-isnt-over?utm_source=rss_feed",
    "published": "2026-02-27T22:00:10+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "China's Myanmar dilemma persists despite leadership changes",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "635e55f6a2f5d838",
    "title_original": "Taipei must break free of its abusive relationship with Washington",
    "content_original": "If Caligula were the president of the United States, Taiwan’s leader William Lai Ching-te might still kowtow to him. By now, it seems pretty clear that US President Donald Trump has no real policies to speak of, only caprice and vague ideological preferences. That was how bad emperors acted, and Trump obviously sees himself as some kind of king, unrestrained by anything other than his personal inclinations. It’s not surprising there have been “No Kings” protests across the US. From his lifelong...",
    "url": "https://www.scmp.com/opinion/china-opinion/article/3344682/taipei-must-break-free-its-abusive-relationship-washington?utm_source=rss_feed",
    "published": "2026-02-27T21:30:08+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Taipei must break free of its abusive relationship with Washington",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "02257919ffa0d4d2",
    "title_original": "CPC Central Committee, State Council congratulate Chinese Winter Olympics delegation",
    "content_original": "CPC Central Committee, State Council congratulate Chinese Winter Olympics delegation",
    "url": "https://www.globaltimes.cn/page/202602/1355612.shtml",
    "published": "2026-02-24T00:00:00+00:00",
    "source_name": "Global Times",
    "source_category": "state-aligned",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "CPC Central Committee, State Council congratulate Chinese Winter Olympics delegation",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  }
]