[
  {
    "id": "92872722ed90ed57",
    "title_original": "Israeli officials informed Khamenei assassinated in Iran strike, body said to be found in rubble",
    "content_original": "Ali Khamenei, Iran’s supreme leader since 1989, was killed in an Israeli strike, official confirmed. His death marks a major turning point for the Islamic Republic’s leadership.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888283",
    "published": "2026-02-28T21:39:17+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Israeli officials claim Khamenei assassinated in Iran strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Israeli officials reported that Iran's Supreme Leader Ali Khamenei was killed in an Israeli strike, marking a significant turning point for Iran's leadership. This development could lead to major instability within Iran's government and potentially escalate the ongoing conflict with Israel and its allies. The strategic implications are profound given Khamenei's central role in Iranian decision-making and IRGC operations."
  },
  {
    "id": "999e2e0aaa0df67c",
    "title_original": "UAE thwarts Iranian missiles: Residents receive safety alerts, reassured of safety",
    "content_original": "\"Your safety is our top priority. Please stay indoors in safe places, wait for official instructions, and only trust updates from official sources,\" authorities said.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888304",
    "published": "2026-02-28T20:52:40+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "UAE thwarts Iranian missiles, issues safety alerts to residents",
    "translated": true,
    "relevant": true,
    "summary_en": "The UAE successfully intercepted Iranian missiles targeting its territory, prompting authorities to issue safety alerts urging residents to stay indoors and follow official instructions. This incident highlights the ongoing threat posed by Iranian missile attacks and the UAE's active air defense measures in response."
  },
  {
    "id": "a1b9e48856d7b5b5",
    "title_original": "Where is the Mossad in the shadows of Israel-US joint strikes on Iran? - analysis",
    "content_original": "No one knows what the Mossad is doing at this moment - but there is little question that its agents are, behind the scenes, at the eye of the storm.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888305",
    "published": "2026-02-28T20:41:06+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Mossad's Role in Israel-US Joint Strikes on Iran - Analysis",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses the potential involvement of Mossad in the ongoing joint operations between Israel and the US against Iran. It suggests that Mossad agents are likely playing a covert role in intelligence gathering and operational support. This is significant as it highlights the depth of Israeli-US intelligence cooperation amidst the conflict and the potential impact on Iranian military and nuclear facilities."
  },
  {
    "id": "3674cae284885468",
    "title_original": "No US combat casualties despite Iranian retaliation, US military says",
    "content_original": "Despite \"hundreds of Iranian missile and drone attacks,\" there have been no reported US casualties or combat-related injuries, CENTCOM wrote.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888303",
    "published": "2026-02-28T20:37:31+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "No US combat casualties despite Iranian retaliation",
    "translated": true,
    "relevant": true,
    "summary_en": "The US military reported no combat casualties or injuries despite Iran launching hundreds of missile and drone attacks. This highlights the effectiveness of US defenses and the ongoing Iranian retaliation against US forces in the region."
  },
  {
    "id": "1077e8a68a833d29",
    "title_original": "Israel may have killed dozens of senior Iranian officials, with Ali Khamenei as top target",
    "content_original": "Among those targeted were aides Ali Larijani and Ali Shamkhani, IRGC chiefs including Esmail Qaani, and the Iranian defense minister • Israel targeted assassinations as US focused elsewhere",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888302",
    "published": "2026-02-28T20:35:01+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Israel may have killed dozens of senior Iranian officials, with Ali Khamenei as top target",
    "translated": true,
    "relevant": true,
    "summary_en": "Israel reportedly conducted targeted assassinations of numerous senior Iranian officials, including IRGC chiefs, defense minister, and aides to Khamenei, with the supreme leader himself as the primary target. This operation occurred while US focus was on other aspects of the conflict. The assassinations signify a significant escalation by Israel against Iran's leadership and military command structure."
  },
  {
    "id": "9ce5387ffa831502",
    "title_original": "איך הופתעה איראן? תוכנית ההטעיה נחשפת - ולמה השרים קנו אוכל באבו גוש",
    "content_original": "אינסוף דיבורים על אפשרות למלחמה, אבל איראן בכל זאת הופתעה. איך זה קרה? בטהרן ציפו למכת פתיחה לילית, הלוויין הסיני דיווח על \"מטוסים שמוצבים במקומם ואין סימנים לפעולה גדולה\" - ושרים ובכירים התבקשו להימנע מרכישה של אוכל לחמ\"לים לקראת שבת",
    "url": "https://www.ynet.co.il/news/article/sjsrhslyze",
    "published": "2026-02-28T20:28:47+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran's Surprise: Deception Plan Exposed and Ministers' Actions in Abu Ghosh",
    "relevant": true,
    "summary_en": "Iran was caught off guard by a US-led operation despite expecting a nighttime attack, as Chinese satellite data suggested no significant military movement. Iranian officials, including ministers, were reportedly advised against purchasing food for war rooms in anticipation of a quiet weekend.",
    "translated": true
  },
  {
    "id": "474dbb47e9041f35",
    "title_original": "ההימור הגדול של טראמפ: הפלת משטר באיראן תציל את כהונתו בבית הלבן",
    "content_original": "טראמפ הבטיח לאמריקנים כי תחת שלטונו \"לא יהיו מלחמות חדשות\" ותיאר את עצמו כאיש של שלום - שראוי לפרס נובל. הלילה, בניגוד לדעת הקהל בארה\"ב ולהבטחותיו, טראמפ פתח במתקפה על איראן - שעשויה לשקם את הקדנציה שלו",
    "url": "https://www.ynet.co.il/news/article/syyny9etwe",
    "published": "2026-02-28T20:22:25+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump's Gamble: Overthrowing Iran's Regime Could Save His Presidency",
    "relevant": true,
    "summary_en": "The article suggests that Trump has launched an attack on Iran, despite previous promises of peace and against public opinion in the US. This move is seen as an attempt to salvage his presidency by potentially overthrowing the Iranian regime. The strategic significance lies in the potential escalation of the ongoing conflict and its impact on US domestic politics and foreign policy.",
    "translated": true
  },
  {
    "id": "4a5da3c89376f818",
    "title_original": "‘I stand against Israel’: Candace Owens drives America First backlash after Iran strikes",
    "content_original": "The remarks came hours after US President Donald Trump announced the US had begun “major combat operations in Iran,” as Washington and Jerusalem opened a new phase of confrontation with Tehran.",
    "url": "https://www.jpost.com/international/article-888296",
    "published": "2026-02-28T20:06:42+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Candace Owens faces backlash for anti-Israel stance amid Iran-US conflict escalation",
    "translated": true,
    "relevant": true,
    "summary_en": "Candace Owens' comments against Israel sparked controversy as the US and Israel escalated military operations against Iran following President Trump's announcement of major combat operations. The situation highlights internal political divisions within the US regarding its stance on Israel during the conflict with Iran. This could impact US domestic support and strategic coordination with Israel in ongoing operations."
  },
  {
    "id": "005651c9fb809b3b",
    "title_original": "Trump’s Iran strikes set off bipartisan war powers revolt on Capitol Hill",
    "content_original": "Operation Epic Fury began early Saturday, with Trump confirming US strikes on Iran alongside Israel, igniting debate in Washington over escalation and presidential authority.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888299",
    "published": "2026-02-28T19:49:18+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Trump’s Iran strikes spark bipartisan war powers debate in Congress",
    "translated": true,
    "relevant": true,
    "summary_en": "President Trump confirmed US strikes on Iran in coordination with Israel, triggering a bipartisan debate in Washington over the escalation of hostilities and presidential war powers. The operation, named Epic Fury, began on Saturday and has heightened concerns about the scope of executive authority in military actions against Iran."
  },
  {
    "id": "32218271ab7173ce",
    "title_original": "Travel in chaos as airlines cancel flights after US, Israel strikes on Iran",
    "content_original": "Flight maps showed airspace over Iran, Iraq, Kuwait, Israel and Bahrain virtually empty as Israel said it struck Iran and the US military initiated a series of strikes against targets in the country.",
    "url": "https://www.jpost.com/business-and-innovation/article-888298",
    "published": "2026-02-28T19:40:06+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Airlines cancel flights amid US and Israeli strikes on Iran",
    "translated": true,
    "relevant": true,
    "summary_en": "Airlines have canceled flights and airspace over Iran, Iraq, Kuwait, Israel, and Bahrain is nearly empty following US and Israeli strikes on Iran. The US military initiated a series of strikes on Iranian targets, while Israel also conducted its own attacks. This development indicates a significant escalation in the conflict, disrupting civilian travel and potentially signaling further military actions in the region."
  },
  {
    "id": "885b46fb763d4026",
    "title_original": "Iran-linked plot tried to assassinate Trump, hidden camera footage shows",
    "content_original": "The footage shows the suspect demonstrating the alleged plan using a vape pen placed on a napkin to represent his intended target.",
    "url": "https://www.jpost.com/international/article-888295",
    "published": "2026-02-28T19:30:13+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Iran-linked plot attempted to assassinate Trump",
    "translated": true,
    "relevant": true,
    "summary_en": "An assassination plot linked to Iran targeted former US President Donald Trump. Hidden camera footage revealed a suspect demonstrating the plan using a vape pen as a prop to represent Trump. This incident signifies an escalation in Iran's covert operations against US targets and could provoke further US retaliation."
  },
  {
    "id": "cd2fcb0b0ce1d058",
    "title_original": "‘Iran is going to use all of its capabilities’: Expert warns Iran cornered by ‘existential war’",
    "content_original": "Former IDF intelligence official Yossi Kuperwasser said Iran now views the conflict as an existential war, warning the regime is likely to escalate and use all military and proxy capabilities.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888297",
    "published": "2026-02-28T19:24:18+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Iran likely to escalate conflict using all capabilities: Expert",
    "translated": true,
    "relevant": true,
    "summary_en": "Former IDF intelligence official Yossi Kuperwasser warned that Iran perceives the conflict as existential and may escalate by deploying all military and proxy capabilities. This suggests potential increased aggression from Iran and its proxies across multiple fronts, posing a heightened threat to US and allied forces in the region."
  },
  {
    "id": "aeddaef43084f7a9",
    "title_original": "IRGC tell ships passage through Strait of Hormuz 'not allowed'",
    "content_original": "Vessels in the Gulf reported receiving messages warning that no ships were allowed to pass the Strait of Hormuz, according to EU and UK agencies, though Iran has not confirmed any closure.",
    "url": "https://www.jpost.com/middle-east/article-888294",
    "published": "2026-02-28T19:03:31+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "IRGC warns ships against passage through Strait of Hormuz",
    "translated": true,
    "relevant": true,
    "summary_en": "The IRGC has issued warnings to vessels, reportedly through maritime channels, that passage through the Strait of Hormuz is prohibited. This development, if confirmed, could severely disrupt global oil shipments and heighten tensions in the Gulf region, as the Strait is a critical maritime chokepoint. The lack of official confirmation from Iran adds uncertainty to the situation, but the warning itself indicates potential escalation in the ongoing conflict."
  },
  {
    "id": "6485f92e527760ea",
    "title_original": "Israeli Air Force conducts its largest-ever attack as over 200 aircraft strike 500 targets in Iran",
    "content_original": "In the Tabriz area, the IDF struck a major site from which the Islamic Republic has fired dozens of ballistic missiles at Israel.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888293",
    "published": "2026-02-28T18:57:32+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Israeli Air Force conducts its largest-ever attack on Iran with over 200 aircraft striking 500 targets",
    "translated": true,
    "relevant": true,
    "summary_en": "The Israeli Air Force launched its largest-ever attack on Iran, deploying over 200 aircraft to strike 500 targets, including a major ballistic missile site near Tabriz from which Iran had launched attacks on Israel. This operation signifies a significant escalation in Israeli operations against Iranian military infrastructure and is a direct response to Iran's missile attacks on Israel."
  },
  {
    "id": "63fe2ee8076f2add",
    "title_original": "Hezbollah signals support for Iran without pledging involvement",
    "content_original": "Hezbollah expressed solidarity with Iran following US and Israeli strikes, warning of regional consequences while stopping short of saying it would enter the conflict.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888292",
    "published": "2026-02-28T18:45:51+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Hezbollah signals support for Iran without pledging involvement",
    "translated": true,
    "relevant": true,
    "summary_en": "Hezbollah has expressed solidarity with Iran following recent US and Israeli strikes, warning of potential regional consequences. However, they have not committed to direct involvement in the conflict, indicating a cautious approach to escalation."
  },
  {
    "id": "844f52a79c74acc6",
    "title_original": "UK says British forces aiding regional defense but not striking Iran",
    "content_original": "British Prime Minister Keir Starmer said UK forces and aircraft are taking part in coordinated defensive efforts in the region but are not involved in US and Israeli strikes on Iran.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888291",
    "published": "2026-02-28T18:32:29+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "UK forces aiding regional defense but not striking Iran",
    "translated": true,
    "relevant": true,
    "summary_en": "British Prime Minister Keir Starmer confirmed that UK forces are participating in coordinated defensive operations in the region but are not directly involved in US and Israeli strikes on Iran. This highlights the UK's strategic stance of supporting regional security without escalating direct military action against Iran."
  },
  {
    "id": "ec0c5b3835099d0c",
    "title_original": "איראן טוענת: \"70 נהרגו בתקיפת בית ספר\" | דיווחים על כאוס בטהרן ומחסור במזון",
    "content_original": "הרשויות הודיעו כי בית ספר לבנות בדרום איראן נפגע בתקיפות וטענו כי עשרות נהרגו - בישראל בודקים את הדיווחים. במערב דווח על כאוס בטהרן ועל תורי ענק בתחנות הדלק, בשל רצון של תושבים לעזוב. במקביל: הפגנות תמיכה במשטר",
    "url": "https://www.ynet.co.il/news/article/rjgqnvlkzx",
    "published": "2026-02-28T17:51:22+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran claims 70 killed in school attack | Reports of chaos in Tehran and fuel shortages",
    "relevant": true,
    "summary_en": "Iran alleges that a girls' school in southern Iran was targeted, resulting in dozens of casualties, with Israel investigating the reports. The incident has reportedly caused chaos in Tehran, with long lines at fuel stations as residents attempt to flee, while pro-regime demonstrations are also taking place.",
    "translated": true
  },
  {
    "id": "34445f608f2c6a2c",
    "title_original": "נער בן 17 נפצע קל מרסיסים בכפר קאסם, רכבים נשרפו בראש העין | התמונות ממרכז הארץ",
    "content_original": "צעיר כבן 17 נפצע באורח קל במטח האחרון למרכז, הוא הועבר לטיפול במרכז לרפואת ילדים שניידר. בראש העין רסיסים גרמו לשריפה ללא נפגעים",
    "url": "https://www.ynet.co.il/news/article/hjoblyeyze",
    "published": "2026-02-28T17:48:48+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "17-year-old injured by shrapnel in Kfar Qasim, vehicles set ablaze in Rosh HaAyin",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "10c33266ecd94d17",
    "title_original": "הרמטכ\"ל: \"לפנינו מערכה משמעותית וחסרת תקדים - נעמוד בפני מבחן קשה\"",
    "content_original": "הרמטכ\"ל: \"לפנינו מערכה משמעותית וחסרת תקדים - נעמוד בפני מבחן קשה\"",
    "url": "https://www.ynet.co.il/news/article/bjmjutxfzg",
    "published": "2026-02-28T17:40:35+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "IDF Chief of Staff: 'We are facing an unprecedented and significant campaign - we will face a difficult test'",
    "relevant": true,
    "summary_en": "The IDF Chief of Staff warns of an unprecedented and significant military campaign, indicating Israel may be preparing for a major operation. This suggests potential escalation in conflicts with regional adversaries like Hezbollah, Hamas, or Iran. The statement underscores the severity of the current security situation and Israel's readiness for a challenging confrontation.",
    "translated": true
  },
  {
    "id": "22202963688b8e88",
    "title_original": "לסרב להתרגל לטירוף",
    "content_original": "מי שמרגישים היום שוב כלא יותר מאשר כלי משחק בידיים לא אחראיות, שלא מבינים איך אלה שלא נתנו דין וחשבון על מחדלים קודמים רק מגדילים את סכום ההימור על חיים של אחרים, לא צריכים להתבייש",
    "url": "https://www.ynet.co.il/news/article/rkwy7klfbg",
    "published": "2026-02-28T17:15:43+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Refuse to Get Used to Madness",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "bf6549280dce0525",
    "title_original": "עשרת הכללים להתנהלות נכונה במלחמת התודעה",
    "content_original": "להתעדכן רק ממקורות רשמיים, לא להפיץ מידע לא מאומת, לדווח על תוכן מסית ולשתף תוכן מאחד: כך נצלח בשלום את המלחמה בזירה הווירטואלית",
    "url": "https://www.ynet.co.il/news/article/rkitjugkwl",
    "published": "2026-02-28T16:48:17+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Ten Rules for Proper Conduct in the War of Consciousness",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "7fd9ec65d602b268",
    "title_original": "\"חוסלו אולי שני מפקדים, זו משימה בלתי אפשרית\": המסר של איראן לטראמפ",
    "content_original": "בריאיון ל-NBC, שר החוץ האיראני עבאס עראקצ'י צינן את האופטימיות הישראליות, טען ש\"ככל שידוע\" לו המנהיג העליון עלי חמינאי לא חוסל וכי \"רוב הפקידים בריאים ובטוחים\". עוד הבהיר כי חילופי משטר באיראן הם בגדר \"משימה בלתי אפשרית\" והביע רצון לשוב למו\"מ - בתנאי שייפסקו התקיפות",
    "url": "https://www.ynet.co.il/news/article/r14uo00lfwl",
    "published": "2026-02-28T16:47:22+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian Foreign Minister Dismisses Claims of Leadership Assassinations, Calls Regime Change 'Impossible'",
    "relevant": true,
    "summary_en": "Iranian Foreign Minister Abbas Araghchi refuted Israeli optimism about the assassination of Iranian leaders, stating that Supreme Leader Ali Khamenei and most officials are safe. He emphasized that regime change in Iran is impossible and expressed willingness to return to negotiations if attacks cease, signaling Iran's stance on the ongoing conflict and potential diplomatic solutions.",
    "translated": true
  },
  {
    "id": "3f9765fde727d898",
    "title_original": "סובב אותם על האצבע: תרגיל ההונאה של טראמפ בשיחות המשא ומתן | אילנה שושן",
    "content_original": "בנאום דרמטי מסגר דונלד טראמפ את המערכה נגד איראן לא כמתקפה, אלא כמעשה הגנה הכרחי למען הבוחר בטקסס ובאוהיו. טראמפ מנסה שוב להוכיח ש\"אמריקה פירסט\" היא לא רק סיסמה, אלא דוקטרינה צבאית",
    "url": "https://www.maariv.co.il/news/opinions/article-1290242",
    "published": "2026-02-28T16:25:00+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump's Deception Tactics in Iran Negotiation Talks",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "2ed8d23e7e4c95fe",
    "title_original": "Israel, US preparing for 'at least a week' of joint strikes on Iran, officials say",
    "content_original": "The officials also said that the strike at a US Navy base in Bahrain left no injuries, with the Iranian missile only hitting an empty building.",
    "url": "https://www.jpost.com/israel-news/defense-news/article-888281",
    "published": "2026-02-28T16:15:34+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Israel, US preparing for 'at least a week' of joint strikes on Iran, officials say",
    "relevant": true,
    "translated": true
  },
  {
    "id": "5e6278ad4d2a1826",
    "title_original": "אופטימיות זהירה: מסתמן שחמינאי חוסל במכת הפתע על איראן",
    "content_original": "אופטימיות זהירה: מסתמן שחמינאי חוסל במכת הפתע על איראן",
    "url": "https://www.ynet.co.il/news/article/sjwpvuey11e",
    "published": "2026-02-28T16:08:20+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Cautious Optimism: Signs Suggest Khamenei Eliminated in Surprise Strike on Iran",
    "relevant": true,
    "summary_en": "Unspecified actors reportedly conducted a surprise strike targeting Iran's Supreme Leader Ali Khamenei, potentially eliminating him. This development, if confirmed, could have significant implications for Iran's command structure and the ongoing conflict. The strategic impact on Iran's military operations and decision-making processes remains uncertain.",
    "translated": true
  },
  {
    "id": "14d832baff828f9d",
    "title_original": "10,000 שקל ויאכטה - במקום טיסה: כך תצאו מישראל כשהשמיים סגורים",
    "content_original": "אין טיסות, יש ים: עם סגירת המרחב האווירי נפתח נתיב יציאה חדש - הפלגות פרטיות לקפריסין במחירים של 3,000 עד 10,000 שקלים. הפלגה ראשונה כבר מלאה ועברה ביקורת גבולות כחוק",
    "url": "https://www.maariv.co.il/news/israel/article-1290225",
    "published": "2026-02-28T15:31:14+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Alternative sea routes from Israel due to closed airspace",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "808c22da0a2abc97",
    "title_original": "שיתוף פעולה ראשון בעקבות המלחמה עם איראן: המדינות הערביות שמות האגו בצד",
    "content_original": "נראה כי המציאות הביטחונית המתוחה והאגרסיביות הגוברת מצד טהראן מאלצות את ריאד ואבו דאבי לשים את המחלוקות בצד | מעבר להצהרות התמיכה השגרתיות לכאורה, מדובר באירוע חריג בנוף הדיפלומטי המפרצי",
    "url": "https://www.maariv.co.il/news/world/article-1290227",
    "published": "2026-02-28T15:11:43+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "First Cooperation Amid Iran War: Arab States Set Aside Differences",
    "relevant": true,
    "summary_en": "Saudi Arabia and the UAE are reportedly putting aside their disputes to cooperate due to the escalating security threats from Tehran. This marks a significant shift in the diplomatic landscape, as these Arab states move beyond routine statements of support to take concrete actions. The development underscores the regional impact of Iran's aggression and the urgency for a united front.",
    "translated": true
  },
  {
    "id": "f83cae4a1bf33dce",
    "title_original": "בלי הודעה חצי שעה לפני: מדרג ההתרעות של פיקוד העורף | מדריך",
    "content_original": "בכל הארץ כבר נכנסו למרחבים המוגנים מאז פתיחת מבצע \"שאגת הארי\", ובצה\"ל מחדדים: עם קבלת ההנחיה המקדימה בטלפונים יש לשהות בסמוך למרחב המוגן, להיכנס אליו בהישמע האזעקה, ולצאת - רק עם הודעה מפורשת. ynet עושה סדר בהנחיות - ובשינויים מ\"עם כלביא\"",
    "url": "https://www.ynet.co.il/news/article/sjpulvlfbl",
    "published": "2026-02-28T15:02:16+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel's Home Front Command Raises Alert Level Amid Conflict",
    "relevant": true,
    "summary_en": "Israel's Home Front Command has raised its alert level nationwide as part of ongoing operations, including 'Operation Shaked Haari'. The public is instructed to stay near protected spaces and follow specific guidelines for taking shelter during alerts. This signifies a potential escalation in regional tensions and threats to Israeli security.",
    "translated": true
  },
  {
    "id": "6a7fad1cdcedceb5",
    "title_original": "מקרון: \"ההסלמה חייבת להיפסק\"; המתווך העומאני: \"אני המום\"",
    "content_original": "העולם מגיב לתחילת המלחמה, ומשרד החוץ במוסקבה הכריז: \"זה מעשה תוקפנות ללא כל התגרות\". טהרן דרשה לכנס את מועצת הביטחון, נשיא צרפת הצטרף - אך יישר קו עם טראמפ ונתניהו: \"המשטר צריך להפסיק לערער את יציבות האזור\". המתווך מעומאן: \"קורא לארה\"ב לא להיגרר\"",
    "url": "https://www.ynet.co.il/news/article/hke4zpey11l",
    "published": "2026-02-28T14:49:13+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "World Reacts to Escalation of Iran-US Conflict; Oman Mediator Calls for De-escalation",
    "relevant": true,
    "summary_en": "The international community is responding to the escalation of the Iran-US conflict, with Moscow condemning US actions as unprovoked aggression. Tehran has called for a UN Security Council meeting, while France's president aligns with the US and Israel, urging Iran to stop destabilizing the region. The Omani mediator is calling on the US to avoid further escalation.",
    "translated": true
  },
  {
    "id": "5947d0ac61e2a831",
    "title_original": "השלום שהתפוצץ בלילה: המתווך העומאני חלם על היסטוריה - והתעורר למלחמה אזורית",
    "content_original": "בדר אל-בוסעידי, שר החוץ של עומאן, היה מאוד אופטימי לאחר סבב השיחות בז'נבה בסוף השבוע. החלום שלו התנפץ עם פתיחת המלחמה באיראן על ידי ישראל וארצות הברית",
    "url": "https://www.maariv.co.il/news/world/article-1290213",
    "published": "2026-02-28T14:48:01+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Omani Peace Initiative Derailed by US-Israel Attack on Iran",
    "relevant": true,
    "summary_en": "Oman's Foreign Minister Badr Al-Busaidi's optimism for peace following Geneva talks was shattered by the outbreak of war in Iran initiated by Israel and the US. This highlights the escalating regional conflict and the failure of diplomatic efforts to prevent military escalation between Iran and the US-Israel alliance.",
    "translated": true
  },
  {
    "id": "dbb3eb67404e664a",
    "title_original": "באיראן מאבדים שליטה - ומנהיגים: רשימת הבכירים שחוסלו עד כה | דיווח",
    "content_original": "בסוכנות הידיעות רויטרס דיווחי כי מפקד משמרות המהפכה ושר ההגנה האיראני נהרגו במכת הפתיחה של חיל האוויר באיראן וגם מפקד משמרות המהפכה נהרג",
    "url": "https://www.maariv.co.il/news/politics/article-1290199",
    "published": "2026-02-28T14:05:37+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran Loses Control - Senior Leaders Killed in Airstrikes",
    "relevant": true,
    "summary_en": "US airstrikes in Iran reportedly killed a senior IRGC commander and the Iranian Defense Minister, marking a significant escalation in the conflict. The loss of high-ranking officials could further destabilize Iran's military leadership and decision-making capabilities. This development highlights the ongoing strategic targeting of Iran's command structure by US forces.",
    "translated": true
  },
  {
    "id": "2da84053f6ed1576",
    "title_original": "הצמרת האיראנית על הכוונת - בכמה מוקדים: מכת הפתיחה של \"שאגת הארי\"",
    "content_original": "חמינאי ופזשכיאן היו בין היעדים, בצבא אומדים את התוצאות: התוכנית המבצעית פותחה במשך חודשים, ובמרכזה - מאמץ מודיעיני לזהות הזדמנות מבצעית שבה בכירי המשטר יתכנסו. ההחלטה לתקוף בבוקר - הפתעה טקטית, דיווחים בארה\"ב: ישראל מאחורי תקיפת ההנהגה ולא ארה\"ב, כחלק מחלוקת העבודה",
    "url": "https://www.ynet.co.il/news/article/ry7rduef11e",
    "published": "2026-02-28T14:04:25+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian Leadership Targeted - 'Lion's Roar' Operation: Intelligence Effort Identifies Opportunity to Strike Regime's Top Officials",
    "relevant": true,
    "summary_en": "Israel reportedly launched a covert operation named 'Lion's Roar' targeting Iran's Supreme Leader Ayatollah Khamenei and President Ebrahim Raisi, among other top officials. The operation, months in the making, involved extensive intelligence efforts to pinpoint a moment when regime leaders would be gathered. The timing of the strike, occurring in the morning, was a tactical surprise. US sources indicate Israel, not the US, was behind the leadership attack, reflecting a division of labor in the conflict.",
    "translated": true
  },
  {
    "id": "839015502ff41195",
    "title_original": "התרחיש שנבדק: חמינאי נקבר תחת ההריסות | כך נראה מעונו מהלוויין",
    "content_original": "באיראן טענו כי המנהיג העליון \"בריא ושלם\", אך תמונות לוויין שפורסמו ב\"ניו יורק טיימס\" הציגו נזק קשה במתחם מגוריו. ההערכה שאם היה שם, הרי שהוא נקבר תחת ההריסות - ולא בטוח ששרד",
    "url": "https://www.ynet.co.il/news/article/rybnzlxtzl",
    "published": "2026-02-28T13:40:34+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Satellite Images Suggest Potential Destruction of Khamenei's Residence",
    "relevant": true,
    "summary_en": "Satellite images published by the New York Times show severe damage to the residential complex of Iran's Supreme Leader, Ayatollah Khamenei, raising questions about his survival as Iran claims he is 'healthy and safe'. The potential death or injury of Khamenei would be a significant development in the ongoing conflict, potentially causing leadership instability within Iran.",
    "translated": true
  },
  {
    "id": "bd2fc52111df8e58",
    "title_original": "ההבטחה של טראמפ למפגינים - שקוימה",
    "content_original": "בעוד שבמהלך \"מלחמת 12 הימים\" המיקוד היה בהשמדת תכנית הגרעין ופגיעה במערכים צבאיים תומכים, הרי שהשעות הראשונות למערכה מלמדות כי בלב הרעיון התכנוני למערכה עומד היעד שתכליתו ערעור שווי המשקל של המשטר - והאצת השעונים הפנימיים שיביאו להקרסת האייתוללות מבית ולשינוי משטרי עמוק",
    "url": "https://www.ynet.co.il/news/article/bkl9gigywg",
    "published": "2026-02-28T13:35:10+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump's Promise to Protesters - Fulfilled",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "cd5a0f040585963b",
    "title_original": "\"נמשיך להתנגד\": המפלגה בכנסת שמגנה את המלחמה מול איראן",
    "content_original": "מתקפת המנע הישראלית-אמריקאית עוררה גל תגובות בכנסת. בעוד שרוב היושבים במשכן הביעו תמיכה ועידוד לחיילי צה\"ל, יש מי שהתנגד והתבטא בקיצוניות: \"מתקפה פשיסטית\"",
    "url": "https://www.maariv.co.il/news/politics/article-1290188",
    "published": "2026-02-28T13:31:02+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israeli Knesset party condemns war with Iran",
    "relevant": true,
    "summary_en": "A political party in the Israeli Knesset has publicly criticized the ongoing military operations against Iran, calling it a 'fascist attack.' This opposition comes as the majority of the Knesset expresses support for IDF soldiers amidst the conflict. The statement highlights internal political divisions within Israel regarding the war.",
    "translated": true
  },
  {
    "id": "afaaf8eadf9fbad8",
    "title_original": "יד אחת משותקת - ויד שנייה מברזל: כל הפרטים על היעד מס' 1 של ישראל וארה\"ב",
    "content_original": "עלי חמינאי, יליד שנת 1939, לא סומן מראש כיורש הטבעי של מייסד הרפובליקה האסלאמית. בשנת 1981 אף שרד ניסיון התנקשות שהותיר את ידו הימנית משותקת. בעזרת בניית בריתות פוליטיות חזקות, הפך למנהיג העליון",
    "url": "https://www.maariv.co.il/news/military/article-1290191",
    "published": "2026-02-28T13:28:14+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Target #1 of Israel and the US: Details on Ali Khamenei",
    "relevant": true,
    "summary_en": "The article discusses Ali Khamenei, the Supreme Leader of Iran, as a primary target of Israel and the US. It highlights his background, including surviving an assassination attempt in 1981 that left his right arm paralyzed, and his rise to power through strategic political alliances. The military/strategic significance lies in the focus on Khamenei as a key target, indicating potential escalation in the conflict.",
    "translated": true
  },
  {
    "id": "3a8a5e02c4e64e60",
    "title_original": "הסנאטור לינדזי גרהאם חושף: המטרה לא הייתה גרעין - אלא המשטר",
    "content_original": "לפני יומיים נפגש עם דונלד טראמפ, בתחילת החודש ביקר בישראל - עכשיו הסנאטור הרפובליקני לינדזי גרהאם מדבר וחושף את היקף המבצע הישראלי-אמריקאי באיראן ומטרתו",
    "url": "https://www.maariv.co.il/news/world/article-1290168",
    "published": "2026-02-28T13:19:40+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Senator Lindsey Graham Reveals: The Target Was Not Nuclear - But the Regime",
    "relevant": true,
    "summary_en": "Senator Lindsey Graham disclosed that the joint Israeli-American operation in Iran aimed at regime change rather than targeting nuclear facilities. This revelation comes after his recent meetings with Donald Trump and visit to Israel, highlighting potential shifts in US and Israeli strategy against Iran. The statement could signal increased pressure on the Iranian regime and a potential escalation in the ongoing conflict.",
    "translated": true
  },
  {
    "id": "e6ea3422c2027cd5",
    "title_original": "ימים היסטוריים",
    "content_original": "האתגר האמריקאי כרגע מול איראן הוא לא רק לנהל מבצע, אלא לעצב מהפיכה. זה החזון המתחייב מגודל השעה: לפעול לאורך זמן, ללא הפסקה, בקנה מידה חסר תקדים, על מנת לגרום להפלת המשטר. זה המענה הראוי היחיד לאיום האיראני שמתפתח בעקביות מאז 1979",
    "url": "https://www.ynet.co.il/news/article/bymvsref11e",
    "published": "2026-02-28T13:17:51+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US Faces Challenge of Regime Change in Iran",
    "relevant": true,
    "summary_en": "The article discusses the US's strategic challenge in the ongoing conflict with Iran, emphasizing the need for long-term, unprecedented operations aimed at regime change. This reflects a response to the persistent threat posed by Iran since 1979, highlighting the evolving military and political dimensions of the conflict.",
    "translated": true
  },
  {
    "id": "3b139a5d83d823d4",
    "title_original": "מי בעד ישראל ומי נגדה? התגובות בעולם על המתקפה באיראן",
    "content_original": "לאחר מתקפת המנע האמריקאית-ישראלית באיראן, לא כל מדינות העולם מביעות תמיכה, למרות האיום הגרעיני והבליסטי. מי תומך בישראל ומי בצד של משטר האייתולות האיראני?",
    "url": "https://www.maariv.co.il/news/world/article-1290151",
    "published": "2026-02-28T12:44:59+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Global Reactions to US-Israel Attack on Iran",
    "relevant": true,
    "summary_en": "The article discusses international responses to the US-Israel joint attack on Iran, highlighting differing levels of support for Israel and Iran. This is significant as it reflects the global political alignment and potential diplomatic fallout from the attack amidst ongoing nuclear and ballistic missile threats from Iran.",
    "translated": true
  },
  {
    "id": "07837da33a1329d2",
    "title_original": "רסיס חדר בקומה 20 ועצר ב-14: פצועים קל ונזקים לרכוש במטחים מאיראן | תיעוד",
    "content_original": "\"קרה לנו נס גדול\", העיד תושב הבניין שנפגע בטירת הכרמל, שם נפצע אדם אחד קל. תושב אום אל-פחם נפגע מנפילת רסיס בחצר ביתו, פצועים קל ביישוב נוסף בצפון. דיווחים על נפילות ורסיסים בירושלים, בית שמש, כפר מנדא, כפר הרי\"ף ועוד. תושבי ישראל מתבקשים לשהות בקרבת מרחבים מוגנים",
    "url": "https://www.ynet.co.il/news/article/rkcaxbxtbg",
    "published": "2026-02-28T12:41:57+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian missile attack causes damage and injuries in Israel",
    "relevant": true,
    "summary_en": "Iran launched missile attacks targeting multiple locations in Israel, including Tirat Carmel, Umm al-Fahm, and other northern towns, resulting in minor injuries and property damage. The attacks also affected areas like Jerusalem and Beit Shemesh, prompting Israeli authorities to advise citizens to stay near protected spaces. This escalation highlights the ongoing conflict's reach into Israeli territory.",
    "translated": true
  },
  {
    "id": "d972faab95afc667",
    "title_original": "הערכה בישראל: חוסל מפקד משמרות המהפכה - שנכנס לתפקיד ב\"עם כלביא\"",
    "content_original": "מוחמד פאכפור נכנס לתפקידו במקום חוסיין סלאמי שחוסל במבצע \"עם כלביא\". על פי ההערכות בישראל, הוא חוסל במהלומת הפתיחה. באיראן הכחישו, אך מקור המקורב למשטר אמר לרויטרס: כמה מפקדים בכירים וגורמים פוליטיים נהרגו. גורמים ישראלים: \"גם עלי לריג'אני היה על הכוונת\"",
    "url": "https://www.ynet.co.il/news/article/hjfs4heyzl",
    "published": "2026-02-28T12:39:41+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israeli assessment: IRGC commander killed in 'With the Strength of a Lion' operation",
    "relevant": true,
    "summary_en": "An IRGC commander, Mohammed Fakhrpour, was reportedly killed in an Israeli operation named 'With the Strength of a Lion', which targeted senior IRGC and political figures in Iran. This follows the elimination of his predecessor, Hossein Salami, and suggests ongoing Israeli operations targeting high-level Iranian military leadership.",
    "translated": true
  },
  {
    "id": "266ef076e1de1cba",
    "title_original": "סדר חדש במזה\"ת: ישראל השפילה לא רק את איראן - ארדואן המום | אבי אשכנזי",
    "content_original": "על פי ההערכות ראשונות חיל האוויר הישראלי וצבא ארה״ב פועלים בסדר עבודה מתוכנן שהוכן מראש | החבירה לארה״ב במהלך התקיפה הראשון דחק והשפיל את טורקיה והנשיא שלה",
    "url": "https://www.maariv.co.il/news/military/article-1290157",
    "published": "2026-02-28T12:39:14+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel's New Order in the Middle East: Turkey's Erdogan Stunned by Israeli and US Coordination",
    "relevant": true,
    "summary_en": "Israel and the US have demonstrated coordinated military operations, likely against Iranian targets, which has undermined Turkey's regional influence and left President Erdogan surprised. This suggests a shift in Middle Eastern power dynamics and potential escalation in US-Israeli operations against Iran-linked threats.",
    "translated": true
  },
  {
    "id": "aedcf5e7adc1fba5",
    "title_original": "מומחית לאיראן: איראן חשבה שתפחיד את המפרץ - ודחפה אותו לזרועות ישראל",
    "content_original": "אלה רוזנברג מסבירה: כל פגיעה במכלית נפט, כל איום על מדינות המפרץ - דוחק אותן יותר לזרועות ישראל וארה\"ב. טהרן לא מבינה שהיא עושה גול עצמי אסטרטגי",
    "url": "https://www.maariv.co.il/news/opinions/article-1290144",
    "published": "2026-02-28T12:31:59+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran's Actions Push Gulf States Closer to Israel and US",
    "relevant": true,
    "summary_en": "Iran's threats and attacks on Gulf oil tankers and states are backfiring, driving these nations closer to Israel and the US. This strategic miscalculation by Tehran is further isolating Iran and strengthening its adversaries' alliances in the region.",
    "translated": true
  },
  {
    "id": "7bf81df750d6287a",
    "title_original": "השאלה שבמוקד - יציבות המשטר האיראני",
    "content_original": "המלחמה מוצאת את איראן במצבה הקשה ביותר מאז המהפכה האסלאמית ב-1979. קשה להעריך מה תהיה השפעתה של התקיפה הישראלית-אמריקאית על יציבות המשטר, אך ככל שהיא תכלול עריפה של בכירים בצמרת הפוליטית והביטחונית האיראנית, תחליש את יכולתם של כוחות הביטחון לדכא אתגרים פנימיים על יציבות המשטר כך גם יגבר הסיכוי להתערערות יסודותיו",
    "url": "https://www.ynet.co.il/news/article/skgpcgetbe",
    "published": "2026-02-28T12:14:09+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Impact of Israeli-American Attacks on Iranian Regime Stability",
    "relevant": true,
    "summary_en": "The ongoing conflict has put Iran in its most challenging situation since the 1979 Islamic Revolution. The article discusses how Israeli and American attacks targeting senior political and security leadership in Iran could weaken the regime's ability to suppress internal challenges, potentially leading to instability within the regime's foundations.",
    "translated": true
  },
  {
    "id": "43ab3c805d0018a0",
    "title_original": "טהרן צוהלת ושמחה אחרי התקיפה: רוקדים ברחובות ומוחאים כפיים | צפו",
    "content_original": "המתקפה האמריקנית-ישראלית על משטר האייתולות הבוקר עוררה גל שמחה ברחובות טהרן. תושבים יצאו לרחובות בריקודים, \"הם פגעו במתחם של המנהיג העליון\", צהלה אישה אחת מגג ביתה",
    "url": "https://www.maariv.co.il/news/world/article-1290140",
    "published": "2026-02-28T12:12:01+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Celebrations in Tehran After US-Israeli Attack on Ayatollah's Complex",
    "relevant": true,
    "summary_en": "Residents of Tehran are celebrating in the streets after a US-Israeli attack targeted the Supreme Leader's complex. The attack has elicited public displays of joy, with people dancing and clapping in the streets. This indicates potential unrest or shifts in public sentiment within Iran amidst ongoing hostilities.",
    "translated": true
  },
  {
    "id": "566a0afdd7659998",
    "title_original": "שומרי המעברה",
    "content_original": "במבחן המזרחיות המדומיין זה בכלל לא משנה היכן גדלו הוריך ומה התרבות שינקת, מה שחשוב הוא האם אתה מתיישר עם השלטון | לצערם של מציבי החומות, מזרחים הם חלק מהימין ומהשמאל | לצערנו, זה לא הולך להשתפר: האינטרס הוא להסיח את הדעת מהמציאות לטובת שיח של זהויות",
    "url": "https://www.ynet.co.il/news/article/yokra14692079",
    "published": "2026-02-28T11:53:22+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Examination of Eastern Identity in Israel",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "69401de7edc0a1c3",
    "title_original": "גויסו 160 אלף אנשי מילואים. צה\"ל: \"המטרה ליצור תנאים להפלת המשטר. יהיו ימים מורכבים\"",
    "content_original": "בתדרוך לעיתונאים נמסר כי חיל האוויר וצבא ארה\"ב משתפים פעולה בתקיפה באיראן, כשהעדיפות היא לטילי קרקע-קרקע ומערכי פיקוד ושליטה: \"עוקבים אחר האזור למקרה שיתפתח אירוע רב-זירתי\". אין בשלב זה מידע על הצלחת מכת הפתיחה. צה\"ל מגייס מילואים בעיקר להגנת הגבולות ופיקוד העורף",
    "url": "https://www.ynet.co.il/news/article/sktvtnekzg",
    "published": "2026-02-28T11:51:15+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Mobilizes 160,000 Reservists Amid Joint US-Israeli Strikes on Iran",
    "relevant": true,
    "summary_en": "Israel has mobilized 160,000 reservists primarily for border defense and rear command as the IDF and US Air Force collaborate in strikes on Iran, targeting missile and command systems. The IDF states the goal is to create conditions for regime change, indicating potential for increased regional escalation.",
    "translated": true
  },
  {
    "id": "c4aea8f7ac322c2b",
    "title_original": "חיכו שייתכנסו: התקיפה תוכננה סביב רגע אחד שבו כל הבכירים יהיו יחד",
    "content_original": "חודשים של איסוף מודיעין מדויק, תיאום מלא בין ישראל לארה\"ב ובניית בנק מטרות מפורט אפשרו את מהלומת הפתיחה; צה\"ל פתח בגל תקיפות נוסף במערב איראן בניסיון לצמצם את שיגורי הטילים לישראל",
    "url": "https://www.maariv.co.il/news/military/article-1290127",
    "published": "2026-02-28T11:50:13+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel and US coordinated attack on Iranian leadership targets",
    "relevant": true,
    "summary_en": "Israel, in coordination with the US, launched a series of attacks targeting senior Iranian leadership in western Iran. The operation followed months of intelligence gathering and was aimed at disrupting Iran's missile capabilities targeting Israel. This represents a significant escalation in the ongoing conflict between Israel and Iran.",
    "translated": true
  },
  {
    "id": "04fdfbe73fcee86b",
    "title_original": "למה ירו על ישראל מעט טילים? מפקד חיל האוויר לשעבר על השיקול האיראני",
    "content_original": "אחרי מטח הטילים על ישראל מאיראן, אלוף במיל' איתן בן אליהו, לשעבר מפקד חיל האוויר, מספר על השיעור הגדול שנלמד מהמלחמה הקודמת ומסביר גם את שיקולי האסטרטגיה של האויב",
    "url": "https://www.maariv.co.il/news/israel/article-1290128",
    "published": "2026-02-28T11:35:53+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Former Israeli Air Force Commander Explains Iran's Limited Missile Attack on Israel",
    "relevant": true,
    "summary_en": "The article discusses insights from former Israeli Air Force Commander, Major General (Ret.) Eitan Ben Eliyahu, on Iran's recent missile attack on Israel. He explains the strategic considerations behind Iran's limited use of missiles, referencing lessons learned from previous conflicts. This analysis is significant for understanding Iran's military decision-making and potential future escalations in the ongoing conflict.",
    "translated": true
  },
  {
    "id": "2f6aa9b4ab572704",
    "title_original": "איראן במתקפה על בסיסי ארה\"ב במפרץ: הרוג באמירויות | תיעוד",
    "content_original": "איראן הודיעה שיצאה למבצע \"הבטחת האמת 4\", ותקפה בסיסים בקטאר, כוויית, בחריין והאמירויות - שם נשמעו פיצוצים בדובאי ואבו דאבי: \"אזרח אסיה נהרג מרסיסים, זכותנו להגיב\". בעיראק: \"3 הרוגים במפקדות מיליציות פרו-איראניות\". החות'ים איימו לתקוף בים האדום. צפו: הפגיעה במפקדת הצי החמישי בבחריין",
    "url": "https://www.ynet.co.il/news/article/s17cimxywg",
    "published": "2026-02-28T11:05:44+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran Attacks US Bases in Gulf: One Killed in UAE | Footage",
    "relevant": true,
    "summary_en": "Iran launched 'Operation Pledge to the Truth 4', striking bases in Qatar, Kuwait, Bahrain, and the UAE, causing explosions in Dubai and Abu Dhabi. One Asian civilian was killed by shrapnel, and Iran claimed the right to retaliate. In Iraq, three pro-Iran militia commanders were killed. The Houthis threatened attacks in the Red Sea, and footage showed damage to the US Fifth Fleet headquarters in Bahrain.",
    "translated": true
  },
  {
    "id": "3fc16c999a47dee9",
    "title_original": "\"זה יכול להיות קשה ותובעני, אבל זוהי השכונה שלנו ואין לנו לאן ללכת\" | אבי בניהו",
    "content_original": "\"המערכה מול איראן דורשת ממלכתיות, חוסן אזרחי ואמון בצה\"ל - ואנחנו כולם 'חיילים ללא מדים' במערכה הזו\". תא\"ל מיל' אבי בניהו במסר חשוב לציבור וגם לפוליטיקאים",
    "url": "https://www.maariv.co.il/news/opinions/article-1290112",
    "published": "2026-02-28T11:03:50+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israeli Official Emphasizes National Resolve and Civilian Resilience in Confronting Iran",
    "relevant": true,
    "summary_en": "Avi Benayahu, a retired Israeli general, highlights the importance of national unity, civilian strength, and trust in the IDF while addressing the public and politicians. He describes the situation as a collective effort, referring to all citizens as 'soldiers without uniforms' in the struggle against Iran. This underscores Israel's focus on maintaining domestic resilience and preparedness amid ongoing regional tensions with Iran.",
    "translated": true
  },
  {
    "id": "2ed7b758a241dd3a",
    "title_original": "הנוסעים הגיעו לנתב\"ג - וגילו בצ'ק-אין על הביטול: \"לא חשבתי שזה יקרה לי\"",
    "content_original": "לקראת המתקפה האיראנית, ברשות שדות התעופה נערכו היטב והפעילו שאטלים משער 32 לחניונים. לאחר סגירת המרחב האווירי של ישראל, נוסעים רבים שעמדו לטוס, נתקעו בנתב\"ג וכעת מחפשים דרכים לשוב לבתיהם",
    "url": "https://www.maariv.co.il/news/military/article-1290118",
    "published": "2026-02-28T10:59:27+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Passengers stranded at Ben Gurion Airport after Iran attack alert",
    "relevant": true,
    "summary_en": "Following Iran's attack alert, Israel's airspace closure led to many passengers being stranded at Ben Gurion Airport. The airport activated emergency protocols, including shuttle services from gate 32 to parking lots. This incident highlights the disruption caused by the ongoing conflict and the immediate impact on civilian travel.",
    "translated": true
  },
  {
    "id": "2b07ed98fddae7de",
    "title_original": "בעקבות המלחמה עם איראן: מערכת החינוך בישראל מושבתת",
    "content_original": "הערכת משרד החינוך היא שהלימודים יושבתו לפחות עד אחרי פורים | בהנחיית פיקוד העורף נסגרות כל המסגרות בכל הגילים | במקביל נבחנת היערכות ללמידה מרחוק",
    "url": "https://www.maariv.co.il/news/education/article-1290113",
    "published": "2026-02-28T10:54:31+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel's Education System Shuts Down Due to War with Iran",
    "relevant": true,
    "summary_en": "Israel's education system has been suspended following the ongoing war with Iran, with the Ministry of Education estimating that schools will remain closed at least until after the Purim holiday. The decision was made under the guidance of the Home Front Command, affecting all educational frameworks across all age groups. The situation is also being assessed for potential remote learning arrangements.",
    "translated": true
  },
  {
    "id": "f075461bf536522c",
    "title_original": "בצה\"ל חושפים: שפל היסטורי לחמינאי - זו הסיבה לתקיפה באיראן",
    "content_original": "במשך שנים משטר הטרור האיראני השקיע משאבים וכספים בקידום טרור, אלימות וערעור היציבות האזורית תוך התעלמות מוחלטת מרווחת האזרחים. הישגי 'עם כלביא', המחאות והלחצים הבינלאומיים הביאו אותם לשפל היסטורי",
    "url": "https://www.maariv.co.il/news/military/article-1290101",
    "published": "2026-02-28T10:52:00+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "IDF Reveals: Historic Low for Khamenei - Reason Behind Attack on Iran",
    "relevant": true,
    "summary_en": "The IDF has disclosed that Iran's Supreme Leader Khamenei is experiencing a historic low, which is linked to recent attacks on Iran. This is attributed to the success of 'Operation Lion Cubs', internal protests, and international pressure, which have weakened Iran's capacity to project power and fund regional instability.",
    "translated": true
  },
  {
    "id": "acdae73e5779ecfa",
    "title_original": "התרעות חירום ברחבי המדינה | ההנחיות המעודכנות",
    "content_original": "התרעה יזומה נשמעה עם פתיחת המתקפה באיראן, ובהמשך נשמעו התרעות באזורים נרחבים. בכל המדינה נדרשים לשהות ליד מרחבים מוגנים. שר הביטחון הכריז על מצב מיוחד בעורף, מעתה: אין לימודים, וחל איסור על התקהלויות והגעה למקומות עבודה שאינם חיוניים",
    "url": "https://www.ynet.co.il/news/article/khntfdxou",
    "published": "2026-02-28T10:49:28+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Nationwide Emergency Alerts Issued Amid Conflict with Iran",
    "relevant": true,
    "summary_en": "Israel has activated emergency alerts and issued updated safety instructions nationwide following the initiation of attacks on Iran. The Defense Minister has declared a special state of emergency in the home front, suspending schools and non-essential work while mandating sheltering in protected areas. This signifies a significant escalation in the conflict and highlights Israel's concern over potential retaliatory strikes from Iran or its proxies.",
    "translated": true
  },
  {
    "id": "800280ec25b604ef",
    "title_original": "מה זכויות העובדים במצב חירום? כל השאלות והתשובות",
    "content_original": "איך אני יודע אם אני עובד חיוני או לא? האם אני מחויב להגיע למקום העבודה? האם אני רשאי לעבוד מהבית? בעקבות מצב החירום שהוכרז בעורף משרד העבודה מפרסם שאלות ותשובות בנושא זכויות עובדים",
    "url": "https://www.maariv.co.il/news/israel/article-1290108",
    "published": "2026-02-28T10:48:15+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Rights of workers during emergency situations in Israel",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "133177a61bd09060",
    "title_original": "היעדים בגלי התקיפה הראשונים: ראשי המשטר האיראני",
    "content_original": "בכירים במערכת הביטחון אמרו ל\"ניו יורק טיימס\" כי המתקפה צפויה להימשך לפחות כמה ימים, וכי מטרה מרכזית במכת הפתיחה הייתה לפגוע בכמה שיותר בכירים. בין היעדים גם נשיא איראן מסעוד פזשכיאן. בישראל אופטימיות זהירה, אבל הסיכוי לא גבוה",
    "url": "https://www.ynet.co.il/news/article/r1sjqmlf11e",
    "published": "2026-02-28T10:22:35+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Initial Attack Targets: Iranian Regime Leadership",
    "relevant": true,
    "summary_en": "Israeli security officials indicated to the New York Times that a multi-day attack is expected, primarily targeting high-ranking Iranian leadership, including President Masoud Pezeshkian. Israel remains cautiously optimistic but acknowledges the likelihood of success is not high.",
    "translated": true
  },
  {
    "id": "60c18f854bcf19d2",
    "title_original": "ב-3 שכבות, עם סיוע אמריקני: אלו מערכות היירוט של ישראל",
    "content_original": "עם מערך הגנה רב-שכבתי, שכולל את ה\"חץ\" ו\"קלע דוד\", לצד \"ארמדה גדולה\" ומערכות יירוט אמריקניות, נערכת ישראל להגן על העורף - ומתכוננת גם לתרחיש שבו המשטר ירגיש שאלה שעותיו האחרונות. בעוד שטהרן נאחזת בתוכנית הטילים, גם הקואליציה הבינלאומית עשויה לסייע | מעטפת ההגנה המלאה של ישראל מול איום ההסלמה",
    "url": "https://www.ynet.co.il/news/article/3xq66684d",
    "published": "2026-02-28T10:21:30+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel's Multi-Layered Missile Defense Systems, with US Assistance, Prepare for Potential Escalation",
    "relevant": true,
    "summary_en": "Israel is bolstering its multi-layered missile defense, including the Arrow, David's Sling, and US systems, amid concerns of Iranian escalation. This preparation comes as Tehran continues to invest in its missile program, and the international coalition may also provide support. The strategic significance lies in Israel's readiness to defend against potential missile threats from Iran or its proxies.",
    "translated": true
  },
  {
    "id": "43c2baba2ad79565",
    "title_original": "הם חזרו: המורדים החות'ים באיום על ישראל וארה\"ב לאחר התקיפה באיראן",
    "content_original": "בארגון המורדים החות'ים הנתמך חלקית על ידי איראן, מאיימים לחדש באופן מיידי את תקיפות הטילים וכלי הטיס הבלתי מאוישים נגד ספינות מסחר בים האדום",
    "url": "https://www.maariv.co.il/news/military/article-1290098",
    "published": "2026-02-28T10:13:19+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Houthis Threaten to Renew Attacks on US and Israel After Iran Strike",
    "relevant": true,
    "summary_en": "The Houthi rebels, partially backed by Iran, have threatened to resume missile and drone attacks on commercial ships in the Red Sea. This follows recent strikes on Iran, indicating potential escalation in the maritime domain. The threat poses a direct risk to international shipping and US naval operations in the strategically vital Red Sea.",
    "translated": true
  },
  {
    "id": "4a77566f1ac4f49f",
    "title_original": "בצה\"ל חושפים את התרגיל: \"התקיפה באיראן הגיעה בהפתעה\"",
    "content_original": "גורם בכיר בצה\"ל הבהיר כי מטרת המבצע באיראן היא לפגוע במשטר ולהסיר את האיום הקיומי מעל ישראל, בתיאום מלא עם ארה\"ב. במקביל גויסו עשרות אלפי מילואימניקים וכוחות תוגברו בכלל הגזרות",
    "url": "https://www.maariv.co.il/news/military/article-1290091",
    "published": "2026-02-28T10:03:55+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "IDF Reveals Operation: 'Attack on Iran Came as a Surprise'",
    "relevant": true,
    "summary_en": "The IDF, in coordination with the US, conducted a surprise attack on Iran aimed at weakening the regime and eliminating the existential threat to Israel. Tens of thousands of reservists have been called up, and forces have been reinforced across all fronts.",
    "translated": true
  },
  {
    "id": "ea991446ad415e1a",
    "title_original": "בתי החולים עוברים לחירום: \"לשחרר חולים שלא זקוקים לאשפוז\" | כל קווי הסיוע",
    "content_original": "משרד הבריאות הנחה על כלל בתי החולים על \"עלייה לרמת הכוננות הגבוהה ביותר, מעבר לאזורים ממוגנים וירידה למתחמי תת-קרקע ממוגנים\", וקרא לציבור להימנע מלהגיע אליהם במקרים שאינם דחופים. במד\"א ערוכים \"בכוננות שיא\" ופתחו נקודות התרמת דם. קווי הסיוע הנפשי תוגברו",
    "url": "https://www.ynet.co.il/news/article/hjlyrfgtzx",
    "published": "2026-02-28T10:00:51+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "בתי החולים עוברים לחירום: \"לשחרר חולים שלא זקוקים לאשפוז\" | כל קווי הסיוע",
    "summary_en": "{\"h\":\"Hospitals Shift to Emergency Mode: \"Release Patients Not Requiring Hospitalization\" | All Support Lines Activated\",\"r\":true,\"s\":\"Israel's healthcare system has moved to its highest state of readiness, directing hospitals to discharge non-critical patients and move to protected underground facilities amid escalating regional tensions. Magen David Adom (MDA) has heightened its preparedness, op",
    "relevant": true,
    "translated": true
  },
  {
    "id": "cd16db50899f2302",
    "title_original": "טראמפ: \"הזדמנות של דורות לעם האיראני\"; נתניהו: \"סופו של משטר הרשע ליפול\"",
    "content_original": "נשיא ארה\"ב נשא הצהרה של כשמונה דקות והציג את מטרות המלחמה: השמדת הטילים, מיטוט הצי, מניעת גרעין - וחופש לעם האיראני. \"ניסינו שוב ושוב לעשות הסכם - והם ניסו לפתח נשק גרעיני\", אמר. לעם האיראני קרא: \"אל תצאו מהבתים. כשנסיים - קחו את השלטון\". נתניהו: \"נידרש לאורך רוח ולתעצומות נפש. נכה קשות במשטר הטרור וניצור תנאים שיאפשרו לעם האיראני לפרוק מעליו את העול\"",
    "url": "https://www.ynet.co.il/news/article/r1nscfxtwx",
    "published": "2026-02-28T09:36:16+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump and Netanyahu Address on War Aims and Regime Change in Iran",
    "relevant": true,
    "summary_en": "US President Trump and Israeli Prime Minister Netanyahu outlined their objectives in the ongoing conflict with Iran, including the destruction of missile capabilities, prevention of nuclear proliferation, and promoting regime change. Trump called on the Iranian people to stay indoors and take control after the conflict, while Netanyahu emphasized the need for perseverance and creating conditions for the Iranian people to overthrow the current regime. This signifies a potential escalation in the conflict with a focus on dismantling the current Iranian government.",
    "translated": true
  },
  {
    "id": "c16fe124b9196495",
    "title_original": "מדינות המפרץ תחת מתקפה איראנית: פיצוצים במזרח התיכון",
    "content_original": "מבצע \"שאגת הארי\" יצא לדרך - צה\"ל וצבא ארה\"ב פתחו במתקפה על איראן, בתגובה החל ירי טילים לכיוון ישראל, וכעת גם ירי לכיוון מטרות אמריקאיות גם במדינות המפרץ, שם נשמעו פיצוצים",
    "url": "https://www.maariv.co.il/news/military/article-1290076",
    "published": "2026-02-28T09:25:26+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Gulf States Under Iranian Attack: Explosions in the Middle East",
    "relevant": true,
    "summary_en": "Iran has launched missile attacks targeting US interests in Gulf states following the initiation of Operation 'Lion's Roar' by Israel and the US against Iran. The operation has prompted retaliatory missile fire towards Israel and US targets in the Gulf region, resulting in explosions.",
    "translated": true
  },
  {
    "id": "71bae25a767d67f6",
    "title_original": "איראן משגרת איום ישיר לעבר ישראל וארה\"ב: \"אין קווים אדומים\"",
    "content_original": "גורם איראני בכיר הצהיר כי \"אין קווים אדומים\" וכי כל הנכסים והאינטרסים האמריקאיים והישראליים במזרח התיכון הם מטרה לגיטימית. משמרות המהפכה הודיעו כי החל גל ראשון של מתקפות טילים וכטב\"מים כתגובה למתקפה",
    "url": "https://www.maariv.co.il/news/military/article-1290077",
    "published": "2026-02-28T09:17:53+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran Threatens Israel and US: 'No Red Lines'",
    "relevant": true,
    "summary_en": "A senior Iranian official declared that there are 'no red lines' and that all US and Israeli assets and interests in the Middle East are legitimate targets. The IRGC announced the start of a first wave of missile and drone attacks in response to a previous strike, indicating a significant escalation in the ongoing conflict.",
    "translated": true
  },
  {
    "id": "e21b5c705d8d3c00",
    "title_original": "זו מלחמת מצווה",
    "content_original": "מלחמה היא דבר רע - אבל יש מצבים, וזה המצב שאליו נקלענו, שבהם אי התקפה בשלב מוקדם היא נזק אדיר בשלב מאוחר. הדרך לעקירת הרוע תהיה משימה קשה - אבל זו חובה מוסרית ולאומית עליונה",
    "url": "https://www.ynet.co.il/news/article/hy11xvfeyzl",
    "published": "2026-02-28T09:14:48+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "This is a War of Duty",
    "relevant": true,
    "summary_en": "The statement, likely from an Israeli official, emphasizes the necessity of engaging in military action as a moral and national obligation to prevent greater harm in the future. It reflects the ongoing conflict with Iran-linked groups and the strategic importance of proactive defense measures.",
    "translated": true
  },
  {
    "id": "1bd50efc23c5b68b",
    "title_original": "ארה\"ב וישראל פתחו במתקפה על איראן; בין המטרות - בכירי המשטר",
    "content_original": "בתום תקופת המתנה מורטת עצבים, ובפעם השנייה תוך תשעה חודשים, נפתחה מלחמה נגד הרפובליקה האסלאמית. מטרות הותקפו בטהרן, ובהן בניין הנשיאות. דיווח: חמינאי הועבר למסתור מחוץ לבירה. בישראל נסגר המרחב האווירי ונאסר על קיום פעילויות חינוכיות, התקהלויות והגעה למקומות עבודה. שר הביטחון כ\"ץ: \"צפויה מתקפת טילים וכטב\"מים נגד ישראל בטווח הזמן המיידי\". גורם ביטחוני: \"השבועות האחרונים היו הטעיה. הולכים על הכל\". שם המבצע: \"שאגת הארי\"",
    "url": "https://www.ynet.co.il/news/article/sye2qggfzl",
    "published": "2026-02-28T09:08:03+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US and Israel Launch Attack on Iran Targeting Regime Leaders",
    "relevant": true,
    "summary_en": "The US and Israel have initiated a joint military operation named 'Lion's Roar' against Iran, striking targets in Tehran including the Presidential building and high-ranking regime officials. Iran's Supreme Leader Khamenei has reportedly been moved to a secure location outside the capital. Israel has closed its airspace and restricted public activities in anticipation of potential retaliatory missile and drone attacks.",
    "translated": true
  },
  {
    "id": "7a37f42599e43e20",
    "title_original": "דפוס הפעולה: ישראל מתחילה, ארה\"ב נכנסת בכל הכוח",
    "content_original": "שיטת התקיפה המשותפת מזכירה את \"עם כלביא\". האמריקנים מתמקדים באזור דרום-מערב איראן. התקיפה המקדימה בלבנון נועדה \"לעוור\" את העיניים של האיראנים ליד ישראל",
    "url": "https://www.ynet.co.il/news/article/skii1metwx",
    "published": "2026-02-28T09:03:49+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Initiates and US Enters with Full Force",
    "relevant": true,
    "summary_en": "Israel and the US have launched a joint military operation against Iran, with the US focusing on the southwest region of Iran. The preliminary attack in Lebanon aims to 'blind' Iranian forces near Israel's border, indicating a coordinated effort to neutralize threats and gain strategic advantage.",
    "translated": true
  },
  {
    "id": "a468507727023ab4",
    "title_original": "ההטעיות וההיערכות: שרים בכירים קיבלו טלפונים אדומים לשבת",
    "content_original": "השם הרשמי של המתקפה באיראן - \"שאגת הארי\", כחלק מההטעיה רה\"מ ושר הביטחון היו בבתיהם עם תחילתה. גורם ביטחוני: \"הבחירה בתקיפה בשבת בבוקר הייתה גם כדי לבלבל את האיראנים\". בכירים התכנסו בבונקר, הממשלה פתחה חמ\"לים תת-קרקעיים. לפיד: \"כולנו מאחורי צה\"ל\". ליברמן: \"עברנו את המן, נעבור את חמינאי\"",
    "url": "https://www.ynet.co.il/news/article/h150kmxfwx",
    "published": "2026-02-28T08:52:16+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israeli Leadership Initiated 'Lion's Roar' Attack on Iran with Deception Tactics",
    "relevant": true,
    "summary_en": "Israeli senior officials, including the Prime Minister and Defense Minister, used deception by being at home when the 'Lion's Roar' attack on Iran began. The operation, launched on a Saturday morning, aimed to confuse Iranian defenses. Israeli leadership convened in bunkers, demonstrating full support for the IDF and expressing confidence in overcoming challenges posed by Iran's leadership.",
    "translated": true
  },
  {
    "id": "01bf767b3b397844",
    "title_original": "המרחב האווירי של ישראל נסגר",
    "content_original": "אחרי שישראל פתחה במתקפה נגד איראן, שרת התחבורה הודיעה על סגירת המרחב האווירי עד להודעה חדשה. \"ביטחון ובטיחות הנוסעים הם בראש סדר העדיפות\", מסרה",
    "url": "https://www.ynet.co.il/news/article/r1beyv1tbe",
    "published": "2026-02-28T08:32:26+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Closes Airspace After Striking Iran",
    "relevant": true,
    "summary_en": "Israel has closed its airspace following its attack on Iran, with the Transportation Minister citing passenger safety as the top priority. This move indicates a potential escalation in the conflict and suggests concerns over possible Iranian retaliation against Israeli targets.",
    "translated": true
  },
  {
    "id": "3bd1a990de794c5e",
    "title_original": "התגובה בדרך? הבסיסים שאיראן סימנה - וטווח הטילים שיכולים לפגוע גם באירופה",
    "content_original": "התעמולה האיראנית נערכה לאפשרות של קריסת המו\"מ ותקיפה אמריקנית כבר במקביל לשיחות: ערוץ מזוהה משטר פרסם סרטון שמונה את הבסיסים האמריקניים במזרח התיכון ש\"תחת מעקב\" - ובהם כלל גם את שדה תימן. וגם: אלו הטילים הבליסטיים שמחזיקה הרפובליקה האיסלאמית, היכולות - והמענה שמכינים בישראל ובארה\"ב",
    "url": "https://www.ynet.co.il/news/article/yinyu2pgp",
    "published": "2026-02-28T08:30:59+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran Prepares for Potential US Attack as Nuclear Talks Falter",
    "relevant": true,
    "summary_en": "Iranian state media has released a video identifying US military bases in the Middle East, including Al Dhafra in the UAE, as potential targets amid escalating tensions and the potential collapse of nuclear talks. The report highlights Iran's ballistic missile capabilities and the responses being prepared by Israel and the US, indicating a significant military escalation risk.",
    "translated": true
  },
  {
    "id": "9fd3872aa08b23e9",
    "title_original": "כל המדינה במקלטים: אחרי מתקפת המנע - ישראל תחת מתקפה נרחבת מאיראן",
    "content_original": "אזעקות נשמעו בכל הארץ בעקבות זיהוי שיגור טילים לעבר שטח המדינה. \"הציבור מתבקש לגלות אחריות ולפעול על פי ההנחיות - הן מצילות חיים\", מסר פיקוד העורף",
    "url": "https://www.maariv.co.il/news/military/Blog-1290046",
    "published": "2026-02-28T08:20:08+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Under Wide-Ranging Attack from Iran After Missile Barrage",
    "relevant": true,
    "summary_en": "Iran launched a widespread missile attack on Israel, triggering nationwide air raid sirens and prompting the Home Front Command to urge citizens to follow safety protocols. This represents a significant escalation in the ongoing conflict between Iran and Israel, with potential regional implications.",
    "translated": true
  },
  {
    "id": "3a956bc35a06523b",
    "title_original": "אזעקות בישראל: התרעות נשמעו באזורים נרחבים בצפון בעקבות שיגור מאיראן",
    "content_original": "אזעקות נשמעו באזורים נרחבים בצפון ישראל בעקבות זיהוי שיגור טילים לעבר שטח המדינה. \"הציבור מתבקש לגלות אחריות ולפעול על פי ההנחיות - הן מצילות חיים\", מסר פיקוד העורף",
    "url": "https://www.maariv.co.il/news/military/article-1290043",
    "published": "2026-02-28T08:16:44+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Missile Alerts in Northern Israel Triggered by Suspected Iranian Launch",
    "relevant": true,
    "summary_en": "Missile alerts were activated across northern Israel following the detection of missile launches from Iran towards Israeli territory. The Home Front Command urged citizens to follow safety protocols, emphasizing that they save lives. This incident signifies a significant escalation in the ongoing conflict between Israel and Iran, highlighting the direct threat under which Israeli civilians are placed.",
    "translated": true
  },
  {
    "id": "756868a44dad5fa6",
    "title_original": "דונלד טראמפ בהצהרת מלחמה היסטורית נגד איראן: \"שעת החירות שלכם הגיעה\"",
    "content_original": "הנשיא האמריקאי הגיב לראשונה לתקיפות ברחבי איראן. \"המטרה שלנו היא להגן על העם האמריקני על ידי חיסול איומים מידיים מצד המשטר האיראני\", אמר בין היתר בנאום המלחמה החריף שלו",
    "url": "https://www.maariv.co.il/news/politics/article-1290041",
    "published": "2026-02-28T08:06:58+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump Delivers Historic War Speech Against Iran: 'Your Hour of Liberation Has Come'",
    "relevant": true,
    "summary_en": "In a significant escalation, US President Donald Trump delivered a forceful speech addressing recent attacks across Iran, emphasizing the goal of defending Americans by eliminating immediate threats from the Iranian regime. This marks the first direct response by the US to ongoing hostilities, signaling a potential shift in strategy or escalation in the conflict.",
    "translated": true
  },
  {
    "id": "99692370f48fd3f9",
    "title_original": "חשש להסלמה רב זירתית: אלפי חיילי מילואים גויסו",
    "content_original": "חיל האוויר הישראלי והאמריקאי פועלים באיראן, ובמקביל צה\"ל מגייס אלפי מילואימניקים בצווי 8 לחיזוק הגבול הצפוני. הדריכות הועלתה והכוחות מתוגברים ביישובי קו העימות מחשש להסלמה רב זירתית",
    "url": "https://www.maariv.co.il/news/military/article-1290035",
    "published": "2026-02-28T08:00:15+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Mobilizes Thousands of Reservists Amid Fears of Regional Escalation",
    "relevant": true,
    "summary_en": "Israel has called up thousands of reservists and increased readiness along its northern border due to concerns over potential regional escalation, with Israeli and US air forces operating in Iran. This move signals heightened tensions and the potential for broader conflict involving multiple fronts.",
    "translated": true
  },
  {
    "id": "c57d69035fc81a0a",
    "title_original": "תיעוד: הותקפו פירים תת-קרקעיים של חיזבאללה בדרום לבנון",
    "content_original": "בצה\"ל אמרו כי עמדות השיגור שהותקפו לצד הפירים התת-קרקעיים של ארגון הטרור שימשו אותו ל\"קידום מתווי טרור\". בצבא הזהירו כי \"חיזבאללה פועל לשקם את הארגון - ומפר את ההבנות\"",
    "url": "https://www.ynet.co.il/news/article/skl6l11gkzx",
    "published": "2026-02-28T07:49:54+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "IDF strikes Hezbollah underground tunnels in southern Lebanon",
    "relevant": true,
    "summary_en": "The IDF targeted Hezbollah underground tunnels and launch positions in southern Lebanon, citing their use for 'terror activities.' The military warned that Hezbollah is attempting to rebuild and violating previous understandings, indicating ongoing tensions and potential escalation in the region.",
    "translated": true
  },
  {
    "id": "78093e238982503e",
    "title_original": "גם באיראן מודים: חמינאי ובכירים נוספים היו יעד לחיסול; בישראל מרוצים | כל הדיווחים על התקיפה באיראן",
    "content_original": "לאחר יציאתה לפועל של מתקפה נרחבת באיראן, אינספור דיווחים מגיעים בנוגע למצב המשטר, לגבי המטרות שהותקפו וכמובן האיומים מאיראן החלו להגיע, כאשר בין הדיווחים דובר על תקיפה של המנהיג העליון והנשיא האיראני",
    "url": "https://www.maariv.co.il/news/military/article-1290019",
    "published": "2026-02-28T07:21:24+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian Leadership Targeted in Recent Attack; Israel Satisfied with Outcome",
    "relevant": true,
    "summary_en": "Unspecified attacks in Iran reportedly targeted Supreme Leader Khamenei and other senior officials, causing concern within the regime. The strikes, which have not been officially claimed, indicate a significant escalation in efforts to destabilize Iran's leadership. Israel's satisfaction with the operation suggests potential involvement or intelligence support.",
    "translated": true
  },
  {
    "id": "6e8cffa7cd064fb9",
    "title_original": "התגובה האיראנית החלה: הנחיות פיקוד העורף הוחמרו",
    "content_original": "הבוקר התעוררה מדינת ישראל לאזעקות שנשמעו בכל הארץ, במה שהתברר כהתראה על תקיפה באיראן, ולא ירי טילים לעבר ישראל. בעקבות התקיפה, שונו הנחיות פיקוד העורף והוחמרו| כל הפרטים",
    "url": "https://www.maariv.co.il/news/military/article-1290010",
    "published": "2026-02-28T06:59:15+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian retaliation begins: Israeli Home Front Command issues stricter guidelines",
    "relevant": true,
    "summary_en": "Iran has initiated a response following an attack, prompting Israel's Home Front Command to issue heightened security directives across the country. This indicates increased regional tensions and potential threats to Israeli security amid escalating US-Iran hostilities.",
    "translated": true
  },
  {
    "id": "ba534196cbf51eb6",
    "title_original": "הסוף למשטר האיראני? דיווח: עלי חמינאי הוברח מטהרן",
    "content_original": "במקביל לפתיחת התקיפות האמריקאיות והישראליות, ברויטרס מדווחים כי המנהיג העליון של איראן עלי חמינאי, הוברח מטהרן",
    "url": "https://www.maariv.co.il/news/world/article-1290008",
    "published": "2026-02-28T06:57:57+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian Supreme Leader Ali Khamenei reportedly evacuated from Tehran",
    "relevant": true,
    "summary_en": "Reports indicate that Iran's Supreme Leader Ali Khamenei has been evacuated from Tehran amid ongoing US and Israeli attacks. This development suggests potential instability within Iran's leadership and raises questions about the regime's ability to coordinate its military response. The evacuation could have significant implications for the command and control of Iranian forces during the conflict.",
    "translated": true
  },
  {
    "id": "ecbbf02be65280d5",
    "title_original": "שבת קרה, סיכוי לגשם מקומי קל | זו התחזית לפורים",
    "content_original": "הטמפרטורות יהיו נמוכות מהרגיל לעונה, ומצפון הארץ עד צפון הנגב ייתכן טפטוף עד גשם מקומי קל. בימים הבאים יחולו עליות בטמפרטורות, שישובו להיות רגילות לעונה ביום שלישי",
    "url": "https://www.ynet.co.il/news/article/sn0nqim9o",
    "published": "2026-02-28T06:52:22+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Local rain expected in Israel over the weekend",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "7d31e4e914df0728",
    "title_original": "משרד הבריאות בהודעה דחופה לציבור: \"להימנע מלהגיע לבתי החולים\"",
    "content_original": "פתיחת המערכה הבוקר מול איראן הכניסה את מערכת הבריאות לנוהל מלחמה. משרד הבריאות הורה לבתי החולים להתחיל להוריד מאושפזים למתחמים מוגנים. גם קופות החולים נערכות להיערכות חירום שתתחיל כבר היום",
    "url": "https://www.maariv.co.il/news/health/article-1290004",
    "published": "2026-02-28T06:51:01+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel's Health Ministry urges public to avoid hospitals",
    "relevant": true,
    "summary_en": "Israel's Health Ministry has instructed hospitals to begin transferring patients to protected areas and preparing for emergency readiness as a result of the escalating conflict with Iran. This indicates a significant concern over potential attacks on civilian infrastructure and the healthcare system.",
    "translated": true
  },
  {
    "id": "57d8639051cc0794",
    "title_original": "מתקפת המנע של ארה\"ב וישראל באיראן: \"אלפי הרוגים במשמרות המהפכה\"",
    "content_original": "ישראל וארה\"ב פתחו במתקפת מנע נגד איראן - הוכרז מצב חירום מיוחד ומיידי בכל שטחי המדינה. הותקפו מוקדים משמעותיים בטהרן, כולל מוקדי שלטון. טראמפ: \"יצאנו למלחמה. לא יהיה נשק גרעיני\"",
    "url": "https://www.maariv.co.il/news/military/article-1289990",
    "published": "2026-02-28T06:16:12+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US and Israel Launch Preventive Attack on Iran: 'Thousands of IRGC Casualties'",
    "relevant": true,
    "summary_en": "The US and Israel have initiated a preventive attack on Iran, with Tehran's key centers, including government facilities, targeted. A state of emergency has been declared across Iran. The attack aims to prevent Iran's nuclear capabilities, with President Trump stating the objective is to ensure Iran does not acquire nuclear weapons.",
    "translated": true
  },
  {
    "id": "57e4456a8f40a08a",
    "title_original": "מהפכת AI בצבא ארה\"ב: סם אלטמן סגר דיל עם הפנטגון",
    "content_original": "OpenAI חתמה על הסכם עם הפנטגון לאספקת בינה מלאכותית למערכות מסווגות. המהלך מגיע שעות לאחר שטראמפ הורה להפסיק שימוש בטכנולוגיה של המתחרה אנתרופיק",
    "url": "https://www.maariv.co.il/news/world/article-1289984",
    "published": "2026-02-28T06:15:19+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US Military's AI Revolution: Sam Altman Seals Deal with Pentagon",
    "relevant": true,
    "summary_en": "OpenAI has signed an agreement with the Pentagon to provide artificial intelligence for classified systems. This move comes shortly after Trump ordered the cessation of using competitor Anthropic's technology.",
    "translated": true
  },
  {
    "id": "e4bb0be86167e423",
    "title_original": "20 נהרגו בבוליביה בהתרסקות מטוס שנשא חבילות כסף: \"מאות עטו על השטרות\"",
    "content_original": "מטוס של חיל האוויר הוביל שטרות חדשים שרק הודפסו, אך התרסק סמוך לבירה לה פאס. 15 נהרגו ולפחות 30 נפצעו, אך למרות האסון הכבד מאות ניסו לאסוף את המזומנים שהתפזרו על הקרקע והורחקו ע\"י שוטרים וחיילים בגז מדמיע וזרנוקי מים: \"עיכבו את מאמצי החילוץ של הנפגעים\"",
    "url": "https://www.ynet.co.il/news/article/b1ihc3jtbg",
    "published": "2026-02-28T05:47:33+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "20 Killed in Bolivia Plane Crash Carrying Cash",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "d845abc6d7b3dba6",
    "title_original": "מה קורה למשפחת החייל החרדי כשהמצלמות כבות?",
    "content_original": "כשהורה חרדי צריך לבחור בין הגיבוי לבנו לבין היכולת להשיא את בנותיו בכבוד או לשמור על יחסים תקינים בתוך המשפחה המורחבת הוא נמצא בסיטואציה בלתי אפשרית. הנידוי החברתי הוא נשק קטלני לא פחות מאבן שנזרקת ברחוב והוא פועל בשיטה של התשה ושבירת רוח המכוונת לנקודות הרגישות ביותר של האדם",
    "url": "https://www.ynet.co.il/news/article/b12h5qjywx",
    "published": "2026-02-28T05:34:00+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "The Plight of Ultra-Orthodox Soldier's Families When the Cameras Are Off",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "60bfeddbdf006347",
    "title_original": "פרשת ג'פרי אפשטיין: ביל קלינטון בעדות דרמטית - טראמפ עשוי להיות הבא בתור",
    "content_original": "נשיא ארה\"ב לשעבר ביל קלינטון העיד במשך יותר משש שעות וטען כי לא ידע דבר על פשעיו של ג'פרי אפשטיין. חברי ועדה רמזו: העדות עשויה לסלול את הדרך לזימונו של טראמפ",
    "url": "https://www.maariv.co.il/news/world/article-1289974",
    "published": "2026-02-28T05:25:31+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Bill Clinton Testifies in Epstein Case - Trump May Be Next",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "80d747d8ba719744",
    "title_original": "24 השעות הקריטיות אחרי חבלת ראש: זה מה שאתם צריכים לבדוק בכל שעה | ד\"ר איתי גל",
    "content_original": "חבלת ראש היא הסיבה השכיחה ביותר לפניות למיון ילדים - אבל בשנים האחרונות גם מבוגרים רבים סובלים מהן, בייחוד בגלל רכיבה על אופניים וקורקינטים חשמליים. \"מעריב\" בריאות עם כל מה שצריך לעשות ולא לעשות",
    "url": "https://www.maariv.co.il/news/health/article-1289941",
    "published": "2026-02-28T04:00:40+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Critical 24 Hours After Head Injury: What to Check Hourly",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "654f0e180020653f",
    "title_original": "מאבטח של ראש הממשלה הוביל למותה של טל - \"אם הוא לא היה בשב\"כ זה היה נגמר אחרת\"",
    "content_original": "11 שנים אחרי שטל נחום ז\"ל נהרגה בתאונה במקסיקו - ורק לאחרונה הוגש כתב אישום נגד הנאשם, לשעבר מאבטח אישים בשב\"כ. ההורים תמר ורוני מתוסכלים מהסחבת: \"זה גורם להתייאש מהמדינה\"",
    "url": "https://www.maariv.co.il/news/law/article-1289957",
    "published": "2026-02-28T04:00:40+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Bodyguard of Israeli PM implicated in death of Tal Nahum in Mexico",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "618e4525e6e6237d",
    "title_original": "ההנחיה לשוטרים: \"אל תעצרו עריקים\"",
    "content_original": "בלעדי: בסוף השבוע נערך תחקיר פנימי במחוז מרכז של המשטרה. הנושא: למה שוטרים אכפו את החוק כשעיכבו עריק ומסרו אותו למשטרה הצבאית. מסמך פנימי שהגיע לידי ynet מעלה כי השוטרים הונחו לא לפעול למעצר עריקים, ובמקרה של \"עיכוב אקראי\" - לשחררם עם הנחיה לפנות למשטרה צבאית",
    "url": "https://www.ynet.co.il/news/article/s1nxxdkybg",
    "published": "2026-02-28T03:34:14+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Police instructed not to arrest military deserters",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "824c9d3bcd742a1e",
    "title_original": "המהלך החריג של רוביו לפני הביקור בארץ, וההנחיה לשגרירים: \"לא לפגוע במו\"מ עם איראן\"",
    "content_original": "מזכיר המדינה האמריקני ישבור מסורת ארוכת שנים ולא ייקח איתו לישראל עיתונאים - שמוחים וטוענים כי הדבר מצביע על היערכות גבוהה לתקיפה. אחרי הריאיון הסוער של מייק האקבי לטאקר קרלסון, ה\"גרדיאן\" הבריטי מדווח: \"טראמפ מתחיל להתעצבן על שגריר ארה\"ב בישראל בגלל ההתערבות שלו במו\"מ\"",
    "url": "https://www.ynet.co.il/news/article/sjqlfpjfze",
    "published": "2026-02-28T01:09:07+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US Secretary of State Blink from Tradition, Orders Diplomats Not to Disrupt Iran Talks",
    "relevant": true,
    "summary_en": "US Secretary of State Blink is breaking tradition by not bringing journalists to Israel, which some interpret as preparation for a potential attack. Amid tensions, there are reports of Trump growing frustrated with the US Ambassador to Israel over his interference in negotiations with Iran, highlighting the delicate balance in ongoing talks amid regional hostilities.",
    "translated": true
  },
  {
    "id": "8ed1d0172d943e2a",
    "title_original": "\"שלום בהישג יד\" או תקיפה באיראן? הסימנים הסותרים, עיבוי הכוחות - וההכרזה האמריקנית",
    "content_original": "נשיא ארה\"ב טראמפ הדגיש בשיחה עם כתבים כי טרם החליט אם לתקוף את משטר האייתוללות, אך הבהיר כי \"אינו מרוצה\" ואיים להשתמש בכוח: \"לפעמים צריך\". המתווך העומאני ממשיך לפזר אופטימיות, אך ארה\"ב קראה לאזרחיה לעזוב שוב את הרפובליקה האיסלאמית, ואיימה ב\"צעדים נוספים\". בעולם נערכים להסלמה",
    "url": "https://www.ynet.co.il/news/article/bkymadkt11l",
    "published": "2026-02-28T00:33:21+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US President Trump Signals Potential Attack on Iran Amid Conflicting Signs of Peace and Escalation",
    "relevant": true,
    "summary_en": "US President Trump has not yet decided on attacking Iran's regime but has expressed dissatisfaction and threatened the use of force, stating 'sometimes you need to.' The US has called on its citizens to leave Iran again and threatened 'additional steps,' while Oman continues to promote optimism. The world is preparing for potential escalation.",
    "translated": true
  },
  {
    "id": "dd87fe9eadf4cb89",
    "title_original": "ביל קלינטון העיד בקונגרס: \"אפשטיין? לא ראיתי כלום - לא עשיתי רע\"",
    "content_original": "לאחר שמזכירת המדינה לשעבר התייצבה בפני בית הנבחרים, הגיע גם תורו של בעלה - הנשיא לשעבר להעיד על קשריו עם הפדופיל. קלינטון הקריא הצהרה מוכנה מראש בה הדף את הטענות נגדו: \"אם הייתי יודע על אפשטיין - לא הייתי טס במטוס שלו\". בני הזוג קלינטון העידו רק לאחר איום להגיש נגדם כתבי אישום",
    "url": "https://www.ynet.co.il/news/article/bk5fefjkbe",
    "published": "2026-02-27T23:55:18+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Bill Clinton Testifies in Congress on Epstein Ties",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "e199bbfc75557a8c",
    "title_original": "תאונה קטלנית בשבוע האופנה במילאנו: חשמלית התנגשה בבניין, 2 נהרגו | תיעוד דרמטי",
    "content_original": "\"חשבתי שמדובר ברעידת אדמה\": החשמלית ירדה מהפסים בשכונת פורטה ונציה בבירת האופנה האיטלקית לאחר שכמעט התהפכה, ובעוד שהנסיבות טרם ברורות, ראש העיר רמז כי מדובר בטעות אנוש: \"הנהג כנראה לא החליף למסילה הנכונה\". לא נמצאה תקלה טכנית, באיטליה דווח: \"אמר שלא חש בטוב\"",
    "url": "https://www.ynet.co.il/news/article/bji8moykbl",
    "published": "2026-02-27T22:57:23+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Deadly Accident in Milan Fashion Week: Tram Crashes into Building, 2 Killed",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "fbb850aaba576419",
    "title_original": "סערה במצרים: רכב עם דגל ישראל דוהר בפראות - ודורס עוברי אורח | תיעוד חריג",
    "content_original": "ברשתות החברתיות בעולם הערבי הופץ סרטון בו נראה רכב ועליו דגל ישראל, כשהוא נוסע בפראות ודורס הולכי רגל במחוז גיזה. עדים לאירוע תקפו את הנהג כשהבחינו בדגל על הרכב, זו גרסת משרד הפנים המצרי למקרה",
    "url": "https://www.ynet.co.il/news/article/sknnlukfwg",
    "published": "2026-02-27T22:05:43+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israeli-flagged vehicle runs over pedestrians in Gaza, Egypt",
    "relevant": true,
    "summary_en": "A vehicle displaying an Israeli flag was seen recklessly driving and running over pedestrians in the Gaza region of Egypt. The incident sparked a violent reaction from witnesses who attacked the driver upon noticing the flag. This event could escalate tensions in the region amid the ongoing conflict.",
    "translated": true
  },
  {
    "id": "c92d0ca7a2ac913b",
    "title_original": "הרוג מהתהפכות רכב בדרום, אישה נהרגה בתאונה סמוך לטבריה",
    "content_original": "נקבע מותו של צעיר כבן 20, שרכבו התהפך והידרדר לשטח סמוך לקיבוץ דביר שבנגב. בתאונה שאירעה סמוך לבית החולים פוריה בטבריה נהרגה אישה בת 62, חמישה נוספים נפצעו באורח בינוני",
    "url": "https://www.ynet.co.il/news/article/sjm1157jf11e",
    "published": "2026-02-27T21:56:04+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Two fatal accidents reported in southern Israel and near Tiberias",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "c690f5a0ffbf8c98",
    "title_original": "\"אנחנו משחקים איתם כבר 47 שנה\": הנאום הלילי של טראמפ - והמסרים העמומים",
    "content_original": "נשיא ארה\"ב אמר שהוא לא מרוצה מהמו\"מ עם איראן - וכשנשאל על החלטה על איראן נתן תשובה עוקצנית: \"הייתם מקבלים את הסקופ הגדול בהיסטוריה, נכון?\"",
    "url": "https://www.maariv.co.il/news/world/article-1289961",
    "published": "2026-02-27T21:51:27+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump's Night Speech: Ambiguous Messages on Iran",
    "relevant": true,
    "summary_en": "Former US President Trump expressed dissatisfaction with negotiations with Iran, hinting at a potential escalation or significant action against Iran. His remarks, while not explicitly detailing any plans, suggest ongoing tensions and potential future confrontations with Iran, which could impact the current conflict dynamics in the region.",
    "translated": true
  },
  {
    "id": "c1b47611bb4582f8",
    "title_original": "מנעו החייאות, ניתקו מכשירי הנשמה: אכזריות הממשל האיראני בדיכוי המחאות",
    "content_original": "יותר מחודש אחרי ההפגנות הגדולות ברחבי הרפובליקה האיסלאמית, סיפרו רופאים איראנים ל-AP כיצד סוכני ביטחון בלבוש אזרחי פעלו למניעת טיפול בפצועים. \"חסמו את דרכנו עם רובים שלופים ולא אפשרו לנו להתקדם\"",
    "url": "https://www.ynet.co.il/news/article/rj4k6ykf11e",
    "published": "2026-02-27T20:50:50+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iranian regime prevents medical treatment for protesters",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "95fd7090fdc39d03",
    "title_original": "\"חשבנו שזו רעידת אדמה\": נסיעה ברכבת החשמלית הפכה ברגע לטרגדיה",
    "content_original": "חשמלית במילאנו סטתה מהמסילה והתרסקה לתוך מסעדה, שניים נהרגו ו-39 נפצעו. הנהג טען לאירוע רפואי, והמשטרה חוקרת חשד לרשלנות. קווי תחבורה הוסטו והעיר הוכתה בהלם",
    "url": "https://www.maariv.co.il/news/world/article-1289938",
    "published": "2026-02-27T20:39:29+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Train Crash in Milan Kills Two and Injures 39",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "1cd97db4bfe97d59",
    "title_original": "סם אלטמן מזהה הזדמנות: OpenAI בדרך לעסקת ענק עם הפנטגון",
    "content_original": "סם אלטמן מנסה לנצל את המשבר בין אנתרופיק לפנטגון ולקדם עסקה לשילוב מודלי OpenAI בצבא תחת מגבלות בטיחות. הוא מדגיש התנגדות למעקב המוני ונשק אוטונומי ומציע מתווה פיקוח הדוק",
    "url": "https://www.maariv.co.il/news/world/article-1289936",
    "published": "2026-02-27T20:24:48+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "OpenAI Seeks Major Deal with Pentagon Amid Crisis",
    "relevant": true,
    "summary_en": "Sam Altman is leveraging the current crisis between Anthropic and the Pentagon to push for a deal integrating OpenAI's models into the military under strict safety constraints. He emphasizes opposition to mass surveillance and autonomous weapons, proposing a framework for tight oversight. This development is significant as it indicates potential collaboration between AI companies and the US military amid ongoing conflicts.",
    "translated": true
  },
  {
    "id": "42b7dd9fe26e69e7",
    "title_original": "טראמפ: לא רוצה להשתמש בכוח צבאי נגד איראן, אבל לפעמים צריך",
    "content_original": "בצל המתיחות הגבוהה עם איראן, נשיא ארה\"ב הבהיר בשיחה עם כתבים כי למרות שהוא \"לא מרוצה\" מהאיראנים, בממשל טרם התקבלה החלטה סופית אם לתקוף. \"יש לנו את הצבא הטוב בעולם, ולפעמים חייבים להשתמש בו\", איים. שר החוץ העומאני נפגש עם סגנו של טראמפ והכריז: \"השלום בהישג ידנו\"",
    "url": "https://www.ynet.co.il/news/article/rkq7zdujt11g",
    "published": "2026-02-27T19:57:43+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Trump: Does Not Want to Use Military Force Against Iran, But Sometimes Necessary",
    "relevant": true,
    "summary_en": "Former US President Trump stated that while he is 'not happy' with Iran, no final decision has been made on attacking the country. He emphasized the strength of the US military and suggested the potential use of force if necessary. This comes amid heightened tensions with Iran, as Omani Foreign Minister meets with Trump's deputy and declares that 'peace is within our reach'.",
    "translated": true
  },
  {
    "id": "d9bb5c7b62b58c91",
    "title_original": "אבנר גת, שאחייניתו כרמל נרצחה בשבי חמאס, נפטר בפתאומיות בבארי",
    "content_original": "דודה של כרמל גת נפטר מדום לב בזמן שעסק בפינוי ביתו בקיבוץ שנפגע קשות ב-7/10. הוא חזר לבארי אחרי הטבח, עבד בבית הדפוס, והיה עורך סיורים במקום: \"מאגר בלתי נדלה של זיכרונות\"",
    "url": "https://www.ynet.co.il/news/article/hyxa0rkkzg",
    "published": "2026-02-27T19:08:54+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Relative of Hamas captive killed in October 7 attack dies suddenly in Be'eri",
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]",
    "translated": true
  },
  {
    "id": "1e9a3d1cbe846dd3",
    "title_original": "\"להימנע מהגעה לישראל\": המדינות שנערכות להסלמה באיראן - והמסר של טראמפ",
    "content_original": "ארה\"ב, סין, צרפת, בריטניה, גרמניה, איטליה, פולין, ואפילו קזחסטן: המתיחות במזרח התיכון גואה, ומדינות בעולם נוקטות אמצעי זהירות לקראת האפשרות שהמו\"מ ייכשל. רוביו יגיע לישראל כמתוכנן, למרות ששגריר ארה\"ב המליץ לעובדיו לעזוב. טראמפ: \"לא מרוצה מאיראן, אבל צפויות עוד שיחות. אני רוצה עסקה\"",
    "url": "https://www.ynet.co.il/news/article/hjaycbkyzg",
    "published": "2026-02-27T19:03:29+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Countries Prepare for Escalation in Iran - Trump Sends Message",
    "relevant": true,
    "summary_en": "Multiple countries, including the US, China, and European nations, are taking precautionary measures as tensions rise in the Middle East due to the ongoing conflict with Iran. Despite US embassy staff being advised to leave Israel, Rubio is set to visit as planned. Trump expressed dissatisfaction with Iran but mentioned the possibility of further talks, indicating a desire for a deal.",
    "translated": true
  }
]