[
  {
    "id": "20235c1d6cddc2ea",
    "title_original": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "content_original": "US and Israeli strikes on Iran triggered explosions near Khamenei’s office, bringing renewed attention to Iran’s leadership succession process.",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-succession-order-who-could-replace-irans-supremo-after-us-strikes-101772294565735.html",
    "published": "2026-02-28T21:45:13+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses potential successors to Ayatollah Ali Khamenei following recent US and Israeli strikes near his office, highlighting the significance of leadership continuity in Iran amidst ongoing conflict. This is relevant due to the direct impact of military strikes on Iran's leadership and the potential implications for the country's strategic decision-making during the war."
  },
  {
    "id": "cef057eda3088594",
    "title_original": "VIDEO: Exact moment Dubai's Fairmont Palm Jumeirah was hit amid US-Iran conflict",
    "content_original": "Authorities on Saturday responded to an incident in a building in the Palm Jumeirah area",
    "url": "https://www.hindustantimes.com/world-news/us-news/dubai-strike-live-update-exact-moment-fairmont-palm-jumeirah-was-hit-amid-us-iran-israel-missile-strike-video-101772293511394.html",
    "published": "2026-02-28T21:42:07+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai's Fairmont Palm Jumeirah hit amid US-Iran conflict",
    "translated": true,
    "relevant": true,
    "summary_en": "A missile or drone strike hit the Fairmont Palm Jumeirah hotel in Dubai's Palm Jumeirah area during the ongoing US-Iran conflict. The incident occurred on Saturday, prompting a response from local authorities. This attack signifies an escalation of hostilities, potentially involving Iranian proxies targeting US interests or allies in the Gulf region."
  },
  {
    "id": "557dcb6fc947f6d3",
    "title_original": "Burj Khalifa evacuated? Why Dubai authorities are asking people to vacate world's tallest building",
    "content_original": "Loud blasts were heard across Dubai on Saturday after Iran launched retaliatory attacks targeting US-linked military facilities in the region.",
    "url": "https://www.hindustantimes.com/world-news/burj-khalifa-evacuated-why-dubai-authorities-are-asking-people-to-vacate-worlds-tallest-building-101772294564291.html",
    "published": "2026-02-28T21:40:53+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai authorities evacuate Burj Khalifa amid Iran retaliatory attacks",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran's retaliatory attacks targeting US-linked military facilities in the region resulted in loud blasts heard across Dubai, prompting authorities to evacuate the Burj Khalifa. This incident highlights the regional impact of the ongoing US-Iran conflict and the potential risks to Gulf states like the UAE. The evacuation of the world's tallest building underscores the heightened security concerns and civilian disruptions caused by the escalating hostilities."
  },
  {
    "id": "86990a733bc50f50",
    "title_original": "Iran defence minister Amir Nasirzadeh killed in US-Israel strikes: Reports",
    "content_original": "Iran defence minister dead: Nasirzadeh was the deputy of chief of staff for the Iranian armed forces before taking charge as the minister of defence.",
    "url": "https://www.hindustantimes.com/world-news/iran-defence-minister-amir-nasirzadeh-killed-in-us-israel-strikes-reports-101772294141649.html",
    "published": "2026-02-28T21:29:52+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranian Defense Minister Amir Nasirzadeh reportedly killed in US-Israel strikes",
    "translated": true,
    "relevant": true,
    "summary_en": "US and Israeli forces reportedly conducted strikes that resulted in the death of Iranian Defense Minister Amir Nasirzadeh, a high-ranking military official who previously served as deputy chief of staff for the Iranian armed forces. This represents a significant escalation, targeting a key member of Iran's military leadership. The strategic impact could be profound, potentially destabilizing Iran's defense apparatus during active hostilities."
  },
  {
    "id": "faa2a78c8b40a019",
    "title_original": "Watch: U.S.-Israel strike Iran: What really happened| Explained",
    "content_original": "On February 28, 2026, the U.S. and Israel launched joint strikes on Iran in Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran.",
    "url": "https://www.thehindu.com/videos/watch-us-israel-strike-iran-what-really-happened-explained/article70688988.ece",
    "published": "2026-02-28T21:18:21+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S.-Israel strike Iran: What really happened| Explained",
    "relevant": true,
    "translated": true,
    "summary_en": "On February 28, 2026, the U.S. and Israel conducted joint strikes on Iran, codenamed Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran. This operation signifies a significant escalation in the ongoing conflict, showcasing coordinated military action between the U.S. and Israel against Iran's strategic assets. The strikes are likely intended to degrade Iran's military capabilities and deter further aggression in the region."
  },
  {
    "id": "fe512b1493748ee3",
    "title_original": "Watch: Iranians react with defiance after U.S.-Israel strikes",
    "content_original": "Iranians react with a mix of defiance, fear, and uncertainty following the latest strikes. While some vow that Iran will never bow down, others express concern about escalation, civilian safety, and what comes next for the region.",
    "url": "https://www.thehindu.com/videos/watch-iranians-react-with-defiance-after-us-israel-strikes/article70688982.ece",
    "published": "2026-02-28T21:17:26+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranians react with defiance after US-Israel strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian citizens are responding with defiance, fear, and uncertainty following recent US-Israel strikes on Iran. The reactions highlight a mix of resolve to resist and concerns about escalation and civilian safety, reflecting the broader regional impact and uncertainty about future developments in the conflict."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:11:25+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Supreme Leader Khamenei to give a speech amid ongoing conflict with Israel and US",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Khamenei is set to deliver a speech as tensions escalate with Israel and the US. The conflict involves Iranian strikes on US military bases in Kuwait, Qatar, the UAE, and Jordan, while Israeli PM Netanyahu emphasizes ending the threat from the Ayatollah regime. This signifies potential further escalation and strategic implications for regional stability and US forces in the Middle East."
  },
  {
    "id": "83e1931c39cb08cc",
    "title_original": "Iran to witness regime change? Foreign Minister Abbas Araghchi makes huge statement on Trump's plans",
    "content_original": "Iran's foreign minister Abbas Araghchi claims Trump's regime change goal is unattainable.",
    "url": "https://www.hindustantimes.com/world-news/us-news/iran-to-witness-regime-change-foreign-minister-abbas-araghchi-makes-huge-statement-on-trumps-plans-101772292738356.html",
    "published": "2026-02-28T21:08:26+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's foreign minister dismisses Trump's regime change goal",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Minister Abbas Araghchi stated that the US's alleged plans for regime change in Iran are unattainable. This statement comes amidst ongoing armed conflict between Iran and the US, highlighting the continued tensions and Iran's defiance against external threats. The statement is significant as it reflects Iran's stance on the conflict and its resistance to US pressure."
  },
  {
    "id": "0a86e97d326b8cc2",
    "title_original": "Fairmont Hotel in Palm Jumeirah hit? Videos show fire, smoke in Dubai amid Iran strikes",
    "content_original": "Videos allegedly showing fire and smoke near Fairmont The Palm hotel on Dubai’s Palm Jumeirah surfaced.",
    "url": "https://www.hindustantimes.com/world-news/fairmont-hotel-in-palm-jumeirah-hit-videos-show-fire-smoke-in-dubai-amid-iran-strikes-101772292705312.html",
    "published": "2026-02-28T21:08:07+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fairmont Hotel in Dubai's Palm Jumeirah hit amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Unconfirmed reports indicate that the Fairmont The Palm hotel in Dubai's Palm Jumeirah was hit, with videos showing fire and smoke in the area. This incident comes amid escalating tensions and strikes by Iran, potentially marking an expansion of the conflict into civilian areas in the UAE. The strategic significance lies in the potential disruption of tourism and business in Dubai and the broader implications for regional stability."
  },
  {
    "id": "7d4afc527d752e0b",
    "title_original": "Indian founder aboard Qatar Airways flight records pilot’s diversion announcement amid Iran retaliation",
    "content_original": "An Indian founder shared how a Qatar Airways flight to Barcelona was diverted back to Doha after Iraqi airspace closed amid escalating Middle East tensions.",
    "url": "https://www.hindustantimes.com/trending/indian-founder-aboard-qatar-airways-flight-records-pilot-s-diversion-announcement-amid-iran-retaliation-101772291884494.html",
    "published": "2026-02-28T21:07:09+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Qatar Airways flight diverted due to Iraq airspace closure amid Iran-US conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "A Qatar Airways flight from Doha to Barcelona was diverted back to Doha after Iraq closed its airspace due to escalating tensions in the Middle East. The incident highlights the broader impact of the Iran-US conflict on civilian aviation and regional stability. The diversion underscores the risks and disruptions faced by commercial airlines operating near conflict zones."
  },
  {
    "id": "59f2079cf194fa45",
    "title_original": "Iran vs Israel | Chronicles of a war foretold",
    "content_original": "America and Israel seek regime change and a permanent shift in the balance of power in West Asia. For the Islamic Republic, this is a war of survival",
    "url": "https://www.thehindu.com/news/international/iran-vs-israel-chronicles-of-a-war-foretold/article70688723.ece",
    "published": "2026-02-28T21:04:13+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran vs Israel: Chronicles of a War Foretold",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the ongoing conflict between Iran and Israel, with the US supporting regime change in Iran. This is framed as a war of survival for Iran against the US and Israel, highlighting the strategic significance of the conflict in West Asia."
  },
  {
    "id": "ea51a6922ea82500",
    "title_original": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "content_original": "Iran's Supreme Leader Ayatollah Ali Khamenei is alive, the country's finance minister confirmed",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-makes-big-move-amid-dead-rumors-iran-supreme-leader-first-response-to-us-israel-strikes-101772291485510.html",
    "published": "2026-02-28T20:54:58+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Ayatollah Ali Khamenei has made a significant move and issued his first response to recent US strikes, confirming his survival amid rumors of his death. This development is crucial as it demonstrates continued leadership and potential strategic direction for Iran during the ongoing conflict with the US. Khamenei's response could indicate Iran's next steps in the escalation or de-escalation of hostilities."
  },
  {
    "id": "46592b160d24909b",
    "title_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "content_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-white-men-allowed-row-over-toronto-university-only-hiring-professors-on-basis-of-gender-identity/articleshow/128889863.cms",
    "published": "2026-02-28T20:54:41+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Toronto University under fire for hiring policy based on gender identity",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9a5e03a5d7052f1f",
    "title_original": "Trump to deliver any remarks on strikes in Iran today? A look at his public agenda as US launches 'Op Epic Fury'",
    "content_original": "President Trump is not expected to make further public statements on the Iran strikes today, according to White House officials.",
    "url": "https://www.hindustantimes.com/world-news/us-news/donald-trump-to-deliver-any-remarks-on-strikes-in-iran-today-a-look-at-his-public-agenda-as-us-launches-op-epic-fury-101772290712176.html",
    "published": "2026-02-28T20:52:18+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump not expected to comment on Iran strikes today",
    "relevant": true,
    "translated": true,
    "summary_en": "President Trump is unlikely to make additional public statements on the ongoing US strikes in Iran, as per White House officials. This comes as the US launches 'Op Epic Fury' against Iranian targets. The silence may reflect a strategic decision to avoid escalating tensions through public remarks."
  },
  {
    "id": "38bc9df52cdadc59",
    "title_original": "Donald Trump claims stock market boom ‘saved’ NYPD officer’s marriage at Texas rally",
    "content_original": "President Trump claimed an NYPD officer's sex life improved due to his economic policies, as the officer's wife now admires his financial success. Trump stated the officer's 401(k) \"went through the roof,\" transforming his wife's perception from seeing him as a \"loser\" to a \"genius.\"",
    "url": "https://timesofindia.indiatimes.com/world/us/donald-trump-claims-stock-market-boom-saved-nypd-officers-marriage-at-texas-rally/articleshow/128889421.cms",
    "published": "2026-02-28T20:46:05+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump claims stock market boom ‘saved’ NYPD officer’s marriage at Texas rally",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7a559a718f42d6b6",
    "title_original": "Israel and U.S. launch strikes on Iran, targeting its leadership",
    "content_original": "The apparent strike happened near the offices of Supreme Leader Ayatollah Ali Khamenei",
    "url": "https://www.thehindu.com/news/international/israel-attack-on-iran-february-28-2026/article70687211.ece",
    "published": "2026-02-28T20:43:05+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel and U.S. launch strikes on Iran, targeting its leadership",
    "relevant": true,
    "translated": true,
    "summary_en": "Israel and the US conducted strikes targeting Iran's leadership, including near the offices of Supreme Leader Ayatollah Ali Khamenei. This represents a significant escalation in the conflict, directly targeting Iran's top leadership. The strikes signify a coordinated effort by Israel and the US to weaken Iran's command structure amidst ongoing hostilities."
  },
  {
    "id": "278e422592de8003",
    "title_original": "SEBI chief, Canada FM hold talks on boosting institutional investment, regulatory ties",
    "content_original": "“The two sides discussed how both sides can further facilitate institutional investments, strengthen regulatory collaboration, and other issues of mutual interests,” SEBI said in a post on X",
    "url": "https://www.thehindu.com/business/Industry/sebi-chief-canada-fm-hold-talks-on-boosting-institutional-investment-regulatory-ties/article70688651.ece",
    "published": "2026-02-28T20:42:09+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "SEBI chief and Canada FM discuss boosting institutional investment and regulatory ties",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "df07efb53bdfb11d",
    "title_original": "Pakistani national killed in Iranian missile strikes on UAE: diplomatic officials",
    "content_original": "Smoke in the sky after reported blasts were heard, following strikes by the United States and Israel against Iran, in Abu Dhabi, United Arab Emirates, February 28, 2026, in this still image obtained from a video. &mdash; Reuters Identity of deceased has not yet been disclosed.Pakistani...",
    "url": "https://www.geo.tv/latest/653426-pakistani-national-killed-in-iranian-missile-strikes-on-uae-diplomatic-officials",
    "published": "2026-02-28T20:40:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani national killed in Iranian missile strikes on UAE",
    "relevant": true,
    "translated": true,
    "summary_en": "An unidentified Pakistani national was killed in Iranian missile strikes on the UAE, highlighting the regional escalation as Iran targets US allies. The strikes occurred amid ongoing hostilities between Iran and the US, with the UAE being a critical US partner in the region. This incident underscores the risk of civilian casualties and the potential for further diplomatic tensions as the conflict expands beyond direct combatants."
  },
  {
    "id": "9453983613675374",
    "title_original": "Missiles, interceptions, air closure on day of fear for UAE residents as US-Israel strikes on Iran ignite wider conflict",
    "content_original": "As Tehran launched simultaneous missiles across the United Arab Emirates (UAE), Bahrain, and Qatar, civilians took shelter and mostly remained indoors.",
    "url": "https://www.hindustantimes.com/world-news/missiles-interceptions-air-closure-mark-day-of-fear-for-uae-residents-as-us-israel-strikes-ignite-middle-east-conflict-101772291050371.html",
    "published": "2026-02-28T20:37:19+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Missiles, interceptions, air closure on day of fear for UAE residents as US-Israel strikes on Iran ignite wider conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missiles targeting the UAE, Bahrain, and Qatar in retaliation for US-Israel strikes on Iran, causing air closures and civilian fear. The attacks demonstrate Iran's capability to strike US allies in the Gulf region, escalating the conflict. The military significance includes heightened tensions and potential further escalation in the Gulf as US allies respond to the Iranian attacks."
  },
  {
    "id": "1554d27a1606504e",
    "title_original": "Pakistan regrets outbreak of hostilities in Middle East",
    "content_original": "The Foreign Office (FO) on Saturday regretted the “breakdown of talks and outbreak of hostilities in the Middle East”. The statement came after United States and Israel launched strikes on Iran, plunging the region into a renewed military confrontation. Subsequently, several Gulf Arab states said they were targeted by Iranian missiles after Tehran pledged to retaliate against the strikes. In a statement, the FO said, “Pakistan regrets the breakdown of talks and outbreak of hostilities in the Middle East. Pakistan condemns the unwarranted attacks against the Islamic Republic of Iran. These attacks come at a time when diplomatic efforts were underway to reach a peaceful and negotiated solution.” The ministry maintained that such a course of action “will undermine the peace and stability of the entire region, with far reaching consequences”. Pakistan also “strongly condemned” the attacks by Iran against the brotherly countries of Saudi Arabia, Bahrain, Jordan, Kuwait, Qatar, and the Unite...",
    "url": "https://www.dawn.com/news/1976494/pakistan-regrets-outbreak-of-hostilities-in-middle-east",
    "published": "2026-02-28T20:35:25+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan expresses regret over Middle East hostilities",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Foreign Office has condemned the recent attacks on Iran by the United States and Israel, expressing regret over the breakdown of diplomatic efforts and the escalation of hostilities in the Middle East. This statement follows Iran's retaliatory missile strikes on several Gulf Arab states. The situation highlights the ongoing military confrontation and the failure of diplomatic initiatives to resolve the conflict peacefully."
  },
  {
    "id": "02a8bfbfd82e16ee",
    "title_original": "‘All I want is freedom for…’: Trump's big remark after US-Israel strike on Iran",
    "content_original": "Trump was speaking hours after Israel and US jointly launched strikes on Iran, which among other things targeted the area near Khamenei's residence.",
    "url": "https://www.hindustantimes.com/world-news/all-i-want-is-freedom-for-trump-remark-after-us-israel-strike-on-iran-101772290447461.html",
    "published": "2026-02-28T20:29:27+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump comments on US-Israel strike targeting area near Khamenei's residence",
    "relevant": true,
    "translated": true,
    "summary_en": "Trump made remarks shortly after a joint US-Israel strike targeted areas near Ayatollah Khamenei's residence in Iran. The strike is part of ongoing escalation between the US and its allies against Iran, demonstrating continued coordination between the US and Israel against Iranian targets. This action signifies a significant escalation in the conflict and targets the Iranian leadership directly."
  },
  {
    "id": "bd24ffbd3323ac1c",
    "title_original": "Bored of Peace? Half of Donald Trump's Board of Peace is at war",
    "content_original": "Donald Trump’s grandly titled Board of Peace was supposed to be a Trumpian alternative to the United Nations, promising order, stability, and the end of endless wars. Instead, it resembles a Yes Minister casting call where the least qualified are handed the grandest titles. Nearly half its members are now entangled in active military escalation, from US-Israel strikes on Iran to Pakistan’s growing confrontation with the Taliban. The result is an institution dedicated to peace whose members are too busy exchanging missiles to practise it. Like many international bodies before it, the Board of Peace demonstrates that peace, as ever, remains largely aspirational branding.",
    "url": "https://timesofindia.indiatimes.com/world/us/bored-of-board-of-peace-trump-iran-israel-usa-pakistan-war/articleshow/128888906.cms",
    "published": "2026-02-28T20:28:48+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's Board of Peace Members Involved in Military Conflicts",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "5b126bc3e24d918e",
    "title_original": "Did Iran strike US MST warship? All we know amid Trump's ‘Operation Epic Fury’",
    "content_original": "The IRGC announced that a U.S. MST combat support vessel was significantly damaged by its missiles in retaliation to Trump's Operation Epic Fury.",
    "url": "https://www.hindustantimes.com/world-news/us-news/did-iran-strike-us-mst-warship-all-we-know-amid-trumps-operation-epic-fury-101772289582411.html",
    "published": "2026-02-28T20:27:28+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Did Iran strike US MST warship?",
    "relevant": true,
    "translated": true,
    "summary_en": "The IRGC claims to have significantly damaged a US MST combat support vessel using missiles in retaliation to 'Operation Epic Fury' initiated by Trump. This incident, if confirmed, would mark a direct escalation in the conflict involving US naval assets."
  },
  {
    "id": "711a69b196e6069c",
    "title_original": "Ayatollah Ali Khamenei vs Trump vs Netanyahu's net worth: Who is the richest?",
    "content_original": "Ayatollah Ali Khamenei, Iran's Supreme Leader since 1989, is believed to manage a vast financial empire valued between $95 billion and $200 billion.",
    "url": "https://www.hindustantimes.com/world-news/us-news/ayatollah-khamenei-vs-trump-vs-netanyahus-net-worth-who-is-the-richest-101772281314649.html",
    "published": "2026-02-28T20:05:11+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ayatollah Ali Khamenei vs Trump vs Netanyahu's net worth: Who is the richest?",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "c9cfc163c807660d",
    "title_original": "PIA suspends flights to UAE, other Gulf countries amid Middle East crisis",
    "content_original": "View of a Pakistan International Airlines passenger plane. &mdash; APP/File In view of the &ldquo;evolving situation&rdquo; in the Middle East, the Pakistan International Airlines on Saturday suspended its flights to Gulf countries due to the &ldquo;evolving situation in the...",
    "url": "https://www.geo.tv/latest/653431-pia-suspends-flights-to-uae-other-gulf-countries-amid-middle-east-crisis",
    "published": "2026-02-28T20:04:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PIA suspends flights to UAE and other Gulf countries due to Middle East crisis",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan International Airlines (PIA) has suspended flights to the UAE and other Gulf countries amid the escalating conflict in the Middle East. This decision reflects growing concerns over regional instability and potential threats to civilian aviation. The move highlights the broader impact of the conflict on regional travel and transportation networks."
  },
  {
    "id": "63aea162ac5d83d9",
    "title_original": "'Obama will attack, will use Iran card': Trump’s old tweet resurfaces after US-Israeli strikes",
    "content_original": "Explosions rocked Tehran after US-Israeli strikes, reviving Donald Trump's 2013 tweet predicting Obama would attack Iran. Now, with \"Operation Epic Fury\" targeting Iran and Tehran retaliating, Trump's past accusations of using Iran for political gain echo.",
    "url": "https://timesofindia.indiatimes.com/world/us/obama-will-attack-will-use-iran-card-trumps-old-tweet-resurfaces-after-us-israeli-strikes/articleshow/128888141.cms",
    "published": "2026-02-28T20:03:26+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's old tweet about Obama attacking Iran resurfaces amid US-Israeli strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "A 2013 tweet by Donald Trump, predicting that Obama would attack Iran, has resurfaced following recent US-Israeli strikes on Tehran. The tweet's revival highlights ongoing debates about the politicization of Iran as an issue, as 'Operation Epic Fury' continues to target Iranian assets and Tehran retaliates. This adds a layer of political commentary to the ongoing military conflict."
  },
  {
    "id": "2b146e163c46f894",
    "title_original": "Fact check: Viral videos do not show Afghan rocket strikes on Pakistani military installations; visuals are old",
    "content_original": "Multiple videos have been circulating on social media platform X since February 27, claiming to show Afghan BM-21 rocket strikes, launched from the Alishero border district, targeting Pakistani military installations. However, the videos are unrelated to the current situation and are old. Pakistan launched Operation Ghazab lil-Haq against the Afghan Taliban, after the neighbouring country opened fire on multiple locations across the border in Khyber Pakhtunkhwa on late Thursday. Authorities in Kabul had called it a response to Pakistani strikes against terrorist hideouts on Afghan soil over the weekend. On Feb 27, a pro-Indian account on X shared a video of buildings set on fire. “Afghan BM-21 rocket strikes have begun from areas of Alishero district targeting Pakistani military installations across the so-called (imaginary) border… look what’s happened,” reads the caption. The post gained 100,800 views. Another pro-Indian account shared the same video with the caption: “Reports of BM ...",
    "url": "https://www.dawn.com/news/1976585/fact-check-viral-videos-do-not-show-afghan-rocket-strikes-on-pakistani-military-installations-visuals-are-old",
    "published": "2026-02-28T19:57:57+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Viral videos falsely claim Afghan rocket strikes on Pakistan military installations",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ee913bba29d56c12",
    "title_original": "Dubai news live updates: Burj Khalifa evacuated, Dubai airport ops shut as UAE on 'high alert'",
    "content_original": "Dubai news live updates: Dubai airport halted flights after blasts amid US-Israel strikes on Iran. One civilian died in Abu Dhabi earlier after being struck by falling debris.",
    "url": "https://www.hindustantimes.com/world-news/dubai-abu-dhabi-news-live-updates-iran-israel-war-missile-attack-abu-dhabi-explosions-uae-airport-closed-news-101772286839577.html",
    "published": "2026-02-28T19:53:08+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai airport operations shut and Burj Khalifa evacuated amid high alert as UAE faces fallout from US-Israel strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The UAE has placed Dubai on high alert, shutting down airport operations and evacuating the Burj Khalifa after explosions linked to ongoing US-Israel strikes on Iran. A civilian in Abu Dhabi was killed by falling debris, highlighting the regional impact and potential escalation of the conflict."
  },
  {
    "id": "295846aadc281999",
    "title_original": "What's happening in Bahrain, Dubai, and Abu Dhabi right now? Latest updates amid reports of evacuations in Middle East",
    "content_original": "Smoke was seen over parts of Bahrain’s capital, Manama, on Saturday. Flight operations at Dubai International Airport (DXB) have been suspended.",
    "url": "https://www.hindustantimes.com/world-news/us-news/whats-happening-in-bahrain-dubai-and-abu-dhabi-right-now-latest-updates-amid-reports-of-evacuations-in-middle-east-101772286180756.html",
    "published": "2026-02-28T19:45:37+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Smoke seen in Bahrain's capital, flight operations suspended at Dubai Airport",
    "relevant": true,
    "translated": true,
    "summary_en": "Smoke was observed over Manama, Bahrain, and Dubai International Airport halted flight operations, indicating potential military or security incidents in the Gulf region. This development is significant as it suggests possible escalations affecting key US ally states and critical infrastructure amid the ongoing Iran-US conflict."
  },
  {
    "id": "7ab6ab7be33c9aa7",
    "title_original": "‘Huge blow to Indian students’: DHS letter shows US reviewing OPT work rules, STEM likely most affected",
    "content_original": "‘Huge blow to Indian students’: DHS letter shows US reviewing OPT work rules, STEM likely most affected",
    "url": "https://timesofindia.indiatimes.com/world/us/huge-blow-to-indian-students-dhs-letter-shows-us-reviewing-opt-work-rules-stem-likely-most-affected/articleshow/128888069.cms",
    "published": "2026-02-28T19:43:27+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US reviewing OPT work rules for international students",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8ce455f191e6e415",
    "title_original": "India issues advisory to nationals in Israel and Iran; advises immediate registration with embassy in Tel Aviv",
    "content_original": "More than 40,000 Indian nationals currently live and work in Israel; Embassy in Abu Dhabi also urged all Indian nationals “to avoid unnecessary travel”",
    "url": "https://www.thehindu.com/news/national/exercise-utmost-caution-india-issues-advisory-as-israel-us-bombs-iran/article70687439.ece",
    "published": "2026-02-28T19:35:08+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "India issues travel advisory for nationals in Israel and Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "India has advised its citizens in Israel and Iran to register with the embassy in Tel Aviv due to the ongoing conflict. The advisory also urges avoiding unnecessary travel, reflecting concerns over regional instability. This highlights the potential risks for civilians and the broader geopolitical tensions in the Middle East."
  },
  {
    "id": "8ad74cde776d096a",
    "title_original": "Iran fires missiles at Gulf Arab states, one killed in Abu Dhabi",
    "content_original": "State media in the United Arab Emirates said one person had been killed in Abu Dhabi, but ‌gave no details",
    "url": "https://www.thehindu.com/news/international/iran-attack-gulf-states-bahrain-abu-dhabi-kuwait-jordan-qatar-february-28-2026/article70687818.ece",
    "published": "2026-02-28T19:33:14+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran fires missiles at Gulf Arab states, one killed in Abu Dhabi",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missile attacks targeting Gulf Arab states, resulting in one fatality in Abu Dhabi. This escalation demonstrates Iran's continued efforts to strike at US allies in the region. The incident underscores the heightened risk to civilian populations and infrastructure in the Gulf region amidst the ongoing conflict."
  },
  {
    "id": "a70894d4c697b59a",
    "title_original": "‘Science maniac’ wires 400 car batteries together in extreme backyard experiment to see what would happen",
    "content_original": "Drake Anthony, the YouTuber known as Styropyro, scales his high-voltage experiments to 400 car batteries, unleashing currents exceeding 150,000 amps in a backyard test of extreme physics. Framing himself as cautious yet curious, he vaporises metals and triggers a ferrofluid fireball, blurring spectacle and science while showcasing the staggering power latent in everyday automotive batteries at massive scale.",
    "url": "https://timesofindia.indiatimes.com/etimes/trending/science-maniac-wires-400-car-batteries-together-in-extreme-backyard-experiment-to-see-what-would-happen/articleshow/128885002.cms",
    "published": "2026-02-28T19:30:11+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "YouTuber conducts extreme experiment with 400 car batteries",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "a3918fd3ee7b4e5b",
    "title_original": "Ayatollah Ali Khamenei family: Know about Iranian Supreme leader's wife, children and grandkids",
    "content_original": "The US and Israel have launched strikes on Iran, targeting locations linked to Supreme Leader Ayatollah Khamenei, whose whereabouts are unclear.",
    "url": "https://www.hindustantimes.com/world-news/us-news/ayatollah-ali-khamenei-family-know-about-iranian-supreme-leaders-wife-children-and-grandkids-101772281298368.html",
    "published": "2026-02-28T19:26:17+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes targeting locations linked to Ayatollah Khamenei",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel have conducted strikes on locations associated with Iran's Supreme Leader Ayatollah Khamenei, whose current location is unknown. This signifies an escalation targeting Iran's highest leadership and could have significant implications for the conflict's trajectory."
  },
  {
    "id": "c2df2cdfe1a8162a",
    "title_original": "‘The hypocrisy is breathtaking': Trump's Obama-era Iran warnings return as he chooses war amid negotiations",
    "content_original": "Iran's foreign affairs minister Araghchi pulled out an old Trump ‘tweet’ that said Obama would start a war to divert from his domestic political performance",
    "url": "https://www.hindustantimes.com/world-news/the-hypocrisy-is-breathtaking-trumps-obama-era-iran-warnings-return-as-he-chooses-war-amid-negotiations-101772283322090.html",
    "published": "2026-02-28T19:14:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's past Iran war warnings resurface amid current conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Affairs Minister Araghchi highlighted Trump's past criticism of Obama, drawing a parallel to the current US-Iran conflict. This suggests Iran is attempting to portray the US as hypocritical in its approach to negotiations and military action. The statement reflects the ongoing propaganda war and psychological operations between Iran and the US."
  },
  {
    "id": "8f53b96a0738b12d",
    "title_original": "‘Explosions just 10 km away from home’: Indian man in Dubai shares chilling account amid Iran retaliation",
    "content_original": "Indian man in Dubai reported explosions after Iran’s retaliation following US Israel strikes on Iran.",
    "url": "https://www.hindustantimes.com/trending/explosions-just-10-km-away-from-home-indian-man-in-dubai-shares-chilling-account-amid-iran-retaliation-101772284199017.html",
    "published": "2026-02-28T19:00:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions near Dubai amid Iran retaliation",
    "relevant": true,
    "translated": true,
    "summary_en": "An Indian man in Dubai reported hearing explosions 10 km away following Iran's retaliatory strikes after US and Israeli attacks on Iran. This highlights the regional impact of the conflict and the potential risks for US allies and interests in the Gulf region."
  },
  {
    "id": "793b0cfe7d876e5f",
    "title_original": "ICE cancelled Indian-origin student’s visa over dismissed traffic ticket, court calls move unlawful",
    "content_original": "A US federal court has ruled that Immigration and Customs Enforcement (ICE) unlawfully terminated an Indian student's visa status over a dismissed traffic ticket. The judge criticized the agency's arbitrary decision, which lacked due process and forced the student to halt his studies. The ruling condemns ICE's reliance on minor or dismissed infractions to revoke student visas.",
    "url": "https://timesofindia.indiatimes.com/world/us/ice-cancelled-indian-origin-students-visa-over-dismissed-traffic-ticket-court-calls-move-unlawful/articleshow/128886993.cms",
    "published": "2026-02-28T18:58:30+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "ICE cancelled Indian-origin student's visa over dismissed traffic ticket, court calls move unlawful",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b7d8950eb1e8c84b",
    "title_original": "UK man charged with criminal damage after pro-Palestinian graffiti on Churchill statue",
    "content_original": "London police said on Saturday a man had been charged with criminal damage for graffitiing a statue of Britain’s World War II prime minister Winston Churchill with pro-Palestinian slogans. The monument in the central Parliament Square was smeared with red paint early on Friday and “Zionist war criminal” among the slogans written on it. The Metropolitan Police said Caspar San Giorgio, 38, of no fixed address, was charged early on Saturday, some 24 hours after his arrest. He had been detained within minutes of officers being alerted to the incident, according to the force. He was due to appear at a London magistrates’ court later on Saturday. The words “free Palestine” and “stop the genocide” were also sprayed on the statue, which workers cleaned off on Friday. The incident prompted Prime Minister Keir Starmer’s office to call the damage “completely abhorrent” and commend police for the swift arrest. “Churchill was a great Briton,” a spokesman said. The 3.6 metre Churchill statue has bee...",
    "url": "https://www.dawn.com/news/1976544/uk-man-charged-with-criminal-damage-after-pro-palestinian-graffiti-on-churchill-statue",
    "published": "2026-02-28T18:57:53+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UK man charged for pro-Palestinian graffiti on Churchill statue",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "34781e8fd8ed2dd5",
    "title_original": "Iran strikes U.S. bases: Complete list of bases under attack",
    "content_original": "Iran struck U.S. military bases across six Middle Eastern countries after U.S.-Israel joint operation. Here’s the full list of locations targeted",
    "url": "https://www.thehindu.com/news/international/iran-strikes-us-bases-complete-list-of-bases-under-attack/article70688056.ece",
    "published": "2026-02-28T18:52:19+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran strikes U.S. bases: Complete list of bases under attack",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched attacks on U.S. military bases in six Middle Eastern countries in retaliation for a U.S.-Israel joint operation. The strikes targeted multiple locations, indicating a significant escalation in hostilities. This development highlights the widening geographic scope of the conflict and the direct engagement between Iran and U.S. forces in the region."
  },
  {
    "id": "6df783e5b72f2cae",
    "title_original": "What is the IRGC and how did it start? Trump issues stark ultimatum to Iranian forces, ‘Surrender or face death’",
    "content_original": "Donald Trump labeled the attacks on Iran a noble mission, asserting they are crucial to counter Tehran's nuclear ambitions.",
    "url": "https://www.hindustantimes.com/world-news/us-news/what-is-the-irgc-and-how-did-it-start-trump-tells-elite-wing-of-irans-military-to-surrender-or-face-death-101772279847429.html",
    "published": "2026-02-28T18:52:05+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump issues ultimatum to IRGC forces in Iran: ‘Surrender or face death’",
    "relevant": true,
    "translated": true,
    "summary_en": "US President Donald Trump has issued a direct ultimatum to Iranian IRGC forces, demanding their surrender to avoid lethal consequences. This statement comes as part of the ongoing US military campaign against Iran, which Trump characterizes as a noble mission to counter Iran's nuclear ambitions. The ultimatum signifies an escalation in the conflict and underscores the US's strategic objective of dismantling Iran's nuclear program and weakening the IRGC."
  },
  {
    "id": "6b2b3817959ab470",
    "title_original": "US-Iran conflict: Chilling World War 3 predictions surface after Trump's latest military strikes",
    "content_original": "Amid rising tensions, social media users began sharing references to the predictions of mystics Baba Vanga and Nostradamus.",
    "url": "https://www.hindustantimes.com/world-news/us-news/us-iran-conflict-update-world-war-3-predictions-by-baba-vanga-nostradamus-surface-after-trumps-latest-military-strikes-101772282909214.html",
    "published": "2026-02-28T18:50:53+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Chilling World War 3 predictions surface after Trump's latest military strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses social media reactions to predictions by mystics Baba Vanga and Nostradamus about World War 3 following recent US military strikes. This is relevant as it reflects public discourse and perceptions of escalation in the ongoing US-Iran conflict."
  },
  {
    "id": "bac52970696ec9c5",
    "title_original": "Pakistani refugee who returned home six times secures chance to keep Canadian status",
    "content_original": "Pakistani refugee who returned home six times secures chance to keep Canadian status",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/marriage-birth-of-child-deaths-of-parents-pakistani-refugee-who-returned-home-six-times-secures-chance-to-keep-canadian-status/articleshow/128885288.cms",
    "published": "2026-02-28T18:49:21+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani refugee allowed to keep Canadian status despite multiple returns home",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d83054463aba541f",
    "title_original": "'Black smoke, multiple emergency alerts’: Indian mom’s firsthand account of Bahrain’s sudden emergency",
    "content_original": "After the joint Israel-US strikes, US bases across the UAE, Bahrain, and Qatar were hit by Iran.",
    "url": "https://www.hindustantimes.com/trending/black-smoke-multiple-emergency-alerts-indian-mom-s-firsthand-account-of-bahrain-s-sudden-emergency-101772283349743.html",
    "published": "2026-02-28T18:35:12+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran retaliates by hitting US bases in Bahrain after joint Israel-US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched retaliatory attacks targeting US bases in Bahrain following joint Israel-US strikes. This indicates an escalation in the conflict as Iran responds to US and Israeli actions, with potential implications for regional stability and the safety of US personnel in the Gulf region."
  },
  {
    "id": "e6eb3afd0d7140c7",
    "title_original": "Iran's Revolutionary Guard commander Mohammad Pakpour likely killed in Israel-US strikes",
    "content_original": "Pakpour was appointed after his predecessor Hossein Salami was one of several key military figures killed in an Israeli strike during the war in June 2025.",
    "url": "https://www.hindustantimes.com/world-news/iran-revolutionary-guard-commander-mohammad-pakpour-likely-killed-in-israel-us-strikes-101772280704836.html",
    "published": "2026-02-28T18:29:40+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Revolutionary Guard commander Mohammad Pakpour likely killed in Israel-US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Mohammad Pakpour, the commander of Iran's Revolutionary Guard, is reportedly killed in strikes by Israel and the US. This follows the death of his predecessor Hossein Salami in an Israeli strike in June 2025. The loss of another high-ranking IRGC commander signifies a significant blow to Iran's military leadership amidst ongoing hostilities."
  },
  {
    "id": "196b0397f696f299",
    "title_original": "‘Gotta get out of here’: American reacts to Iranian attack on naval base in Bahrain — watch",
    "content_original": "Iran launched missile strikes targeting the US Navy's Fifth Fleet base in Bahrain, causing panic among residents, including Americans. Bahrain confirmed the attack as a violation of its sovereignty. This incident followed a coordinated US-Israel military operation against Iran, which reported explosions and retaliatory drone and missile launches.",
    "url": "https://timesofindia.indiatimes.com/world/us/gotta-get-out-of-here-american-reacts-to-iranian-attack-on-naval-base-in-bahrain-watch/articleshow/128884770.cms",
    "published": "2026-02-28T18:28:03+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran attacks US Navy's Fifth Fleet base in Bahrain",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missile strikes targeting the US Navy's Fifth Fleet base in Bahrain, violating Bahraini sovereignty. The attack followed a coordinated US-Israel operation against Iran, which retaliated with drone and missile launches. This incident signifies escalating hostilities and direct targeting of US military assets in the region."
  },
  {
    "id": "34bf9e5c8d3b337b",
    "title_original": "World holds breath as U.S., Israel strike Iran",
    "content_original": "Calling on Iranians to stand up to their government, Mr. Trump added, “The hour of your freedom is at hand”;",
    "url": "https://www.thehindu.com/news/international/world-holds-breath-as-us-israel-strike-iran/article70687884.ece",
    "published": "2026-02-28T18:26:59+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S. and Israel launch strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The U.S. and Israel have conducted joint strikes on Iran, marking a significant escalation in the ongoing conflict. The strikes likely targeted Iranian military or nuclear facilities, demonstrating increased coordination between the U.S. and Israel against Iran. This development raises concerns about further escalation and potential Iranian retaliation against U.S. and Israeli interests in the region."
  },
  {
    "id": "e28ba5872197d5cc",
    "title_original": "Information ministry rubbishes claim about Pakistani jet being shot down in Afghanistan’s Nangarhar",
    "content_original": "The Ministry of Information and Broadcasting on Saturday rejected claims about a Pakistani jet being shot down in Afghanistan’s Nangarhar and the pilot being captured. The ministry’s fact check account on X attributed the claims to Afghan Taliban officials that were “amplified by Indian media”. “The Ministry of Defence of the so-called Islamic Emirate claimed that Afghan forces shot down a Pakistani fighter jet in Nangarhar and captured its pilot alive. The claim was widely amplified by Indian media and Afghan propaganda outlets,” it said. The ministry further said Pakistan’s armed forces had not reported any aircraft loss and stated that no “independent international media outlet or defence monitoring agency” had verified the claim. “The story relies solely on statements from Afghan officials and selective media amplification,” it said. It further stated that there was no visual proof of crash debris, the wreckage site or the captured pilot. “No geolocated imagery or satellite evidenc...",
    "url": "https://www.dawn.com/news/1976509/information-ministry-rubbishes-claim-about-pakistani-jet-being-shot-down-in-afghanistans-nangarhar",
    "published": "2026-02-28T18:24:13+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani jet shot down claim in Afghanistan's Nangarhar debunked",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "89337a103d6c2fdd",
    "title_original": "'Did World War 3 just start?': US-Iran escalation sparks fears on social media",
    "content_original": "The US and Israel's recent attack on Iran has led to widespread speculation on social media about the possibility of World War 3.",
    "url": "https://www.hindustantimes.com/world-news/us-news/did-world-war-3-just-start-us-iran-escalation-sparks-fears-on-social-media-101772282225662.html",
    "published": "2026-02-28T18:20:06+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US-Iran escalation sparks World War 3 fears on social media",
    "relevant": true,
    "translated": true,
    "summary_en": "The recent US and Israeli attack on Iran has fueled widespread speculation on social media about the potential onset of World War 3. This highlights growing global concerns over the escalating conflict between the US and Iran. The incident underscores the heightened tensions and potential for broader regional or global escalation."
  },
  {
    "id": "cccbf6f4bfa3c37d",
    "title_original": "‘Bombing a sovereign country is not preemptive’: Politicians, analysts react as US and Israel strike Iran",
    "content_original": "The United States and Israel launched a wave of strikes against targets in Iran on Saturday, triggering explosions in the capital Tehran and an escalation across the region. “We are going to destroy their missiles and raze their missile industry to the ground. It will be totally — again — obliterated. We’re going to annihilate their navy,” said US President Donald Trump in an address from his Florida home posted to his Truth Social platform. On the other hand, Israeli Prime Minister Benjamin Netanyahu said the operation aimed to “remove the existential threat posed by the terrorist regime in Iran”, and urged Iranians to overthrow the Islamic Republic’s clerical leadership. In response to the Israel-US aggression, the Islamic Revolutionary Guard Corps of Iran later in the day confirmed the launch of the “first wave” of missile and drone attacks against Israel in response to the strikes on its territory. Political figures and analysts in Pakistan have condemned the recent developments, p...",
    "url": "https://www.dawn.com/news/1976454/bombing-a-sovereign-country-is-not-preemptive-politicians-analysts-react-as-us-and-israel-strike-iran",
    "published": "2026-02-28T18:15:37+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes on Iran, triggering regional escalation",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel conducted coordinated strikes on Iranian targets, causing explosions in Tehran and escalating regional tensions. The attacks targeted Iran's missile capabilities and naval assets, with US President Trump vowing to destroy Iran's missile industry and navy, while Israeli PM Netanyahu aimed to eliminate the 'existential threat' from Iran. The escalation marks a significant intensification of the conflict, with potential for broader regional implications."
  },
  {
    "id": "0179d7f3cebbb9eb",
    "title_original": "'Catastrophe', 'dangerous adventure': How world leaders reacted to Israel-US joint strikes on Iran",
    "content_original": "European Union warned that the escalating situation in the region was \"perilous\" and called for civilians to be protected after US,Israel strikes on Iran",
    "url": "https://www.hindustantimes.com/world-news/perilious-dangerous-adventure-how-world-leaders-reacted-to-israel-us-joint-strikes-on-iran-101772276179542.html",
    "published": "2026-02-28T18:10:50+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "World leaders react to Israel-US joint strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "World leaders, including the European Union, have expressed concern over the escalating situation following joint strikes by the US and Israel on Iran. The EU warned of the 'perilous' nature of the conflict and emphasized the need to protect civilians. This indicates growing international concern over the potential for regional escalation and civilian casualties."
  },
  {
    "id": "4e506d598f63ada6",
    "title_original": "Iranian missile hit US Navy base in Bahrain amid Middle East tensions",
    "content_original": "Bahraini authorities confirmed that the area of Juffair, where the US naval headquarters is located, was hit.",
    "url": "https://www.hindustantimes.com/world-news/iranian-missile-hit-us-navy-base-in-bahrain-amid-middle-east-tensions-101772281638722.html",
    "published": "2026-02-28T18:10:04+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranian missile hits US Navy base in Bahrain",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched a missile strike targeting the US Navy base in Juffair, Bahrain. The attack hit the area housing the US naval headquarters. This escalation signifies direct Iranian aggression against US military assets in the Gulf amid heightened regional tensions."
  },
  {
    "id": "67a8d360591722ff",
    "title_original": "'Why did Trump….: Congress raises Act of War question after Iran strikes; POTUS in trouble",
    "content_original": "Iran-US strikes update: President Donald Trump is facing backlash domestically after he announced a military action aagainst Iran",
    "url": "https://www.hindustantimes.com/world-news/us-news/why-did-trump-attack-iran-congress-raises-act-of-war-question-after-israel-uae-dubai-bahrain-strikes-101772280310571.html",
    "published": "2026-02-28T18:09:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Congress questions Trump's military action against Iran as Act of War",
    "relevant": true,
    "translated": true,
    "summary_en": "Congress is scrutinizing President Trump's military action against Iran, framing it as an Act of War and criticizing the POTUS for potential repercussions. This domestic backlash highlights the political fallout within the US regarding the ongoing conflict with Iran."
  },
  {
    "id": "2fb99b3c127b3d22",
    "title_original": "Dubai airport suspends operations, fresh blasts heard amid Iran strikes",
    "content_original": "Passengers are urged not to travel to the airport and to contact their respective airlines directly for the latest information on flight schedules.",
    "url": "https://www.hindustantimes.com/world-news/dubai-airport-suspends-operations-as-irans-middle-east-strikes-hit-uae-101772282304604.html",
    "published": "2026-02-28T18:08:55+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai airport suspends operations amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Dubai airport has halted operations following fresh blasts heard during ongoing Iran strikes, impacting regional air travel and potentially indicating a broader escalation in hostilities affecting critical infrastructure in the UAE."
  },
  {
    "id": "7defed233768eef0",
    "title_original": "57 students killed, 60 injured in Iran in US-Israeli strikes in school",
    "content_original": "In a separate attack at a school in east of Tehran, at least two students were killed, reported Iran’s Mehr news agency.",
    "url": "https://www.hindustantimes.com/world-news/at-least-42-students-killed-in-us-israeli-strikes-on-schools-iran-authorities-101772281200990.html",
    "published": "2026-02-28T17:58:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "57 students killed, 60 injured in Iran in US-Israeli strikes on school",
    "relevant": true,
    "translated": true,
    "summary_en": "US and Israeli forces reportedly conducted strikes on a school in Iran, resulting in the deaths of 57 students and injuring 60 others. The attack occurred in an unspecified location, with a separate incident in east Tehran killing at least two more students. This represents a significant escalation in targeting civilian infrastructure and could provoke further Iranian retaliation."
  },
  {
    "id": "055e9d551260cebe",
    "title_original": "Where has Iran targeted? All on retaliatory strikes amid vow to ‘deliver a historic lesson’ to Israel and US",
    "content_original": "Iran targeted US military bases in Gulf nations and launched missiles at Israel after US-Israel strikes on Iranian sites.",
    "url": "https://www.hindustantimes.com/world-news/us-news/where-has-iran-targeted-all-on-retaliatory-strikes-amid-vow-to-deliver-a-historic-lesson-to-israel-and-us-101772277252237.html",
    "published": "2026-02-28T17:50:06+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran retaliates by targeting US bases and launching missiles at Israel",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran has launched retaliatory strikes targeting US military bases in Gulf nations and fired missiles at Israel. This follows US-Israel strikes on Iranian sites. The escalation signifies heightened tensions and direct confrontation between Iran and the US-Israel alliance, with significant military implications in the region."
  },
  {
    "id": "4b44e9f846b418a9",
    "title_original": "‘Targeting South Asians’: Jagdeep Singh wanted after gun attacks in Canada",
    "content_original": "‘Targeting South Asians’: Jagdeep Singh wanted after gun attacks in Canada",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/24-year-old-jagdeep-singh-wanted-after-gun-attacks-in-canada-targeting-south-asian-community/articleshow/128884810.cms",
    "published": "2026-02-28T17:36:42+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Canadian police seek Jagdeep Singh after gun attacks targeting South Asians",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "e3b28508d17d8c69",
    "title_original": "US-Iran tensions: Who are the men steering the storm in Middle East",
    "content_original": "The United States and Israel launched strikes against Iran, killing at least 40 people amid nuclear program negotiations and protests. President Trump warned Iranian forces to surrender or face death, while Supreme Leader Khamenei vowed resistance. The conflict escalates with key players like Benjamin Netanyahu and Reza Pahlavi involved.",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/us-iran-tensions-who-are-the-men-steering-the-storm-in-middle-east/articleshow/128884745.cms",
    "published": "2026-02-28T17:32:18+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes on Iran amid nuclear talks and protests",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel conducted strikes on Iran, resulting in at least 40 casualties. This escalation occurred during ongoing nuclear negotiations and domestic protests in Iran. The conflict is intensifying with involvement from key figures like President Trump, Supreme Leader Khamenei, Benjamin Netanyahu, and Reza Pahlavi, signaling heightened tensions and potential for further escalation."
  },
  {
    "id": "057c26969e7148ad",
    "title_original": "Israel releases footage of attack on ‘hundreds of targets’ in Iran | Video",
    "content_original": "The X post by the Israel Defense Forces or IDF was grainy and black-and-white, and showed blasts in hilly terrain.",
    "url": "https://www.hindustantimes.com/world-news/israel-releases-footage-of-attack-on-hundreds-of-targets-in-iran-video-101772279940601.html",
    "published": "2026-02-28T17:31:43+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel releases footage of attack on ‘hundreds of targets’ in Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The IDF released footage showing attacks on numerous targets within Iran, indicating a significant escalation in Israeli operations against Iranian assets. The grainy, black-and-white video depicted explosions in hilly terrain, suggesting strikes on IRGC or military infrastructure. This development highlights the ongoing conflict between Israel and Iran, with potential implications for regional stability and the broader US-Iran conflict."
  },
  {
    "id": "810d4a2b7606c00c",
    "title_original": "‘Where is Ali Khamenei?’: Scary photos from Iran supremo's residence emerge amid US, Israeli strikes",
    "content_original": "A new satellite photo shows the secure compound of Iran supreme leader Ayatollah Ali Khamenei being damaged surfaced",
    "url": "https://www.hindustantimes.com/world-news/where-is-ayatollah-ali-khamenei-scary-photos-from-iran-supremos-home-emerge-amid-us-israeli-strikes-101772277694219.html",
    "published": "2026-02-28T17:23:24+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Satellite Photos Show Damage to Khamenei's Residence Amid US and Israeli Strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "New satellite images reveal damage to the secure compound of Iran's Supreme Leader Ayatollah Ali Khamenei, likely resulting from recent US and Israeli strikes. This development suggests a potential escalation in targeting high-level Iranian leadership and infrastructure. The strategic significance lies in the possible psychological impact on Iran's leadership and the ongoing conflict dynamics."
  },
  {
    "id": "ae0671106445ebf7",
    "title_original": "OPEC+ may consider larger oil output boost, sources say after Israel-U.S. strikes on Iran",
    "content_original": "Delegates earlier ⁠said they would likely agree to a modest increase of 1,37,000 barrels per day in oil output for April, as the group ​readies for summer ‌demand, led by the U.S. driving season",
    "url": "https://www.thehindu.com/news/international/opec-may-consider-larger-oil-output-boost-sources-say-after-israel-us-strikes-on-iran/article70687842.ece",
    "published": "2026-02-28T17:21:51+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "OPEC+ may consider larger oil output boost after Israel-U.S. strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "OPEC+ is considering increasing oil output following recent strikes by Israel and the US on Iran, potentially impacting global oil supply dynamics amidst ongoing conflict in the region. The decision comes as the group prepares for higher summer demand, particularly from the US driving season. This move could be influenced by concerns over potential disruptions to oil infrastructure and supply routes due to the conflict."
  },
  {
    "id": "c89105404138395e",
    "title_original": "In phone call with MBS, PM Shehbaz slams ‘serious regional escalation'",
    "content_original": "Prime Minister Shehbaz Sharif meets Saudi Crown Prince and Prime Minister Mohammed bin Salman at Al Yamamah Palace on October 27, 2025. &mdash; X/@Saudi_GazetteDar, Araghchi review evolving situation in wider region.Israel, US launch strikes to destroy Iran's missile arsenal.Iran...",
    "url": "https://www.geo.tv/latest/653409-pakistan-condemns-unwarranted-attacks-against-iran-calls-for-halt-to-escalation",
    "published": "2026-02-28T17:20:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PM Shehbaz criticizes 'serious regional escalation' in call with MBS",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Prime Minister Shehbaz Sharif condemned the escalating conflict in a phone call with Saudi Crown Prince Mohammed bin Salman. This likely refers to recent US and Israeli strikes on Iranian missile sites and ongoing retaliatory attacks by Iranian proxies. The call underscores the regional impact and concern among non-combatant states like Pakistan over the conflict's escalation."
  },
  {
    "id": "903c3c16f2f49dec",
    "title_original": "Qatar Airways temporarily suspends Doha flights amid regional airspace closure",
    "content_original": "Qatar Airways temporarily suspends Doha flights amid regional airspace closure",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/qatar-airways-temporarily-suspends-doha-flights-amid-regional-airspace-closure/articleshow/128884362.cms",
    "published": "2026-02-28T17:15:38+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Qatar Airways temporarily suspends Doha flights amid regional airspace closure",
    "relevant": true,
    "translated": true,
    "summary_en": "Qatar Airways has suspended flights to and from Doha due to the closure of regional airspace, likely caused by the ongoing conflict. This suspension could impact the movement of goods and personnel in the region, including military logistics. The closure highlights the broader regional instability and potential escalation risks."
  },
  {
    "id": "a0c4cc38e8cff708",
    "title_original": "A look at flights suspended, airports and airspaces closed amid strikes on Iran; Here's what travellers must know",
    "content_original": "The US and Israel's military action against Iran has escalated tensions in the Middle East, causing widespread flight suspensions and airspace closures.",
    "url": "https://www.hindustantimes.com/world-news/us-news/us-and-israel-attack-iran-list-of-flights-suspended-airports-and-airspaces-closed-heres-what-travellers-must-know-101772276872004.html",
    "published": "2026-02-28T17:10:43+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Flights suspended and airspace closed amid strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel's military actions against Iran have led to widespread flight suspensions and airspace closures in the Middle East. This escalation has disrupted civilian air travel, affecting travelers in the region. The closures highlight the increased tensions and potential risks to civilian infrastructure due to the ongoing conflict."
  },
  {
    "id": "8c264e66ab66d94d",
    "title_original": "Full list of major US military bases in the Middle East amid Iran-Israel escalation",
    "content_original": "Explosions were also reported in Kuwait, Qatar, Abu Dhabi and Dubai as tensions escalated across the Gulf.",
    "url": "https://www.hindustantimes.com/world-news/full-list-of-major-us-military-bases-in-the-middle-east-amid-iran-israel-escalation-101772277228790.html",
    "published": "2026-02-28T17:10:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Full list of major US military bases in the Middle East amid Iran-Israel escalation",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the locations of major US military bases in the Middle East during the ongoing escalation between Iran and Israel. Explosions in Kuwait, Qatar, Abu Dhabi, and Dubai indicate heightened tensions and potential threats to US assets in the Gulf region. This is significant as it highlights the vulnerability of US military infrastructure amid regional instability."
  },
  {
    "id": "d8bc1a7893d6be0f",
    "title_original": "PIA suspends operations to Gulf countries following strikes on Iran by Israel, US",
    "content_original": "The Pakistan International Airlines (PIA) on Saturday suspended its flights to Gulf countries due to the “evolving situation in the Middle East”. According to a statement by the PIA spokesperson, flights have been suspended to the United Arab Emirates (UAE), Bahrain, Doha, and Kuwait. “These flights will not operate until tomorrow evening or until the restoration of airspace, whichever comes later,” the spokesperson said. “PIA flights to Saudi Arabia will continue; however, their routes have been changed,” he added. “Flights have been shifted to Boeing 777 aircraft and will reach their destinations via longer routes,” the spokesperson added. The national carrier requested the travelers to contact the PIA call centre at 111-786-786 for information related to their flights or changes in the booking of flights.",
    "url": "https://www.dawn.com/news/1976493/pia-suspends-operations-to-gulf-countries-following-strikes-on-iran-by-israel-us",
    "published": "2026-02-28T17:06:06+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PIA suspends Gulf flights due to US-Israel strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan International Airlines (PIA) has suspended flights to the UAE, Bahrain, Doha, and Kuwait due to the escalating conflict between the US, Israel, and Iran. The suspension reflects growing concerns over airspace safety and potential disruptions in the Middle East. Saudi Arabia flights continue but with altered routes, highlighting the impact on regional aviation and travel."
  },
  {
    "id": "9f30e5e1ca29901c",
    "title_original": "US-Israel strike Iran: How the world reacted",
    "content_original": "Global leaders voiced varied reactions to coordinated US-Israel strikes on Iran, with the EU urging maximum restraint and respect for international law. Spain called for de-escalation, while Malaysia condemned the actions, fearing regional catastrophe. Australia backed US efforts against Iran's nuclear program, but Norway questioned the strike's legality. Russia criticized US involvement.",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/us-israel-strike-iran-how-the-world-reacted/articleshow/128883626.cms",
    "published": "2026-02-28T17:01:32+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US-Israel strike Iran: How the world reacted",
    "relevant": true,
    "translated": true,
    "summary_en": "Global leaders responded to coordinated US-Israel strikes on Iran with mixed reactions. The EU called for restraint and adherence to international law, while Spain urged de-escalation. The strikes, targeting Iran's nuclear program and military assets, signify escalating tensions and international division over the conflict."
  },
  {
    "id": "fa943b57b4754532",
    "title_original": "Abu Dhabi residents receive mobile alert amid Iran strikes: 'Potential missile threat'",
    "content_original": "Abu Dhabi news: A civilian was killed in Iranian strikes that hit Abu Dhabi on Saturday, the UAE's ministry of defence said in a statement.",
    "url": "https://www.hindustantimes.com/world-news/abu-dhabi-residents-receive-mobile-alert-amid-iran-strikes-potential-missile-threat-101772277388085.html",
    "published": "2026-02-28T16:56:10+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Abu Dhabi residents receive mobile alert amid Iran strikes: 'Potential missile threat'",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched strikes targeting Abu Dhabi, resulting in the death of at least one civilian, according to the UAE's ministry of defence. The incident prompted authorities to issue mobile alerts warning residents of a potential missile threat. This escalation highlights the direct threat under which Gulf states are operating due to the ongoing Iran-US conflict."
  },
  {
    "id": "a9766c84067de355",
    "title_original": "‘Heard explosions around 1 pm’: Indian woman in Abu Dhabi recounts tense moments at home amid Iran counterattack",
    "content_original": "An Indian woman in Abu Dhabi said explosions were heard after Iran launched a counterattack.",
    "url": "https://www.hindustantimes.com/trending/heard-explosions-around-1-pm-indian-woman-in-abu-dhabi-recounts-tense-moments-at-home-amid-iran-counterattack-101772276367192.html",
    "published": "2026-02-28T16:54:52+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian woman in Abu Dhabi recounts hearing explosions during Iran counterattack",
    "relevant": true,
    "translated": true,
    "summary_en": "An Indian woman in Abu Dhabi reported hearing explosions around 1 pm local time, coinciding with Iran's counterattack. This indicates potential missile or drone activity by Iran targeting US interests in the Gulf region. The incident highlights the direct impact of the Iran-US conflict on civilian populations in neighboring countries."
  },
  {
    "id": "fac1e9c49ea77dd8",
    "title_original": "Israel attacks Iran: Thick smoke blankets Tehran sky after strike on intelligence ministry complex. Watch",
    "content_original": "In the US and Israeli strikes several cities in Iran were attacked, mainly in the center and northwest of the country.",
    "url": "https://www.hindustantimes.com/trending/us/israel-attacks-iran-thick-smoke-blankets-tehran-sky-after-strike-on-intelligence-ministry-complex-watch-101772276981179.html",
    "published": "2026-02-28T16:50:50+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel attacks Iran: Intelligence ministry complex in Tehran struck",
    "relevant": true,
    "translated": true,
    "summary_en": "Israel conducted strikes on Iran, hitting multiple cities including Tehran's intelligence ministry complex. The attacks targeted central and northwestern regions of Iran. This escalation signifies direct Israeli involvement in the conflict and potential disruption of Iranian intelligence operations."
  },
  {
    "id": "60992b914b839d7f",
    "title_original": "Middle East airspace empties, FlightRadar24 down amid US-Iran conflict",
    "content_original": "Flight tracking website Flightradar24 was down as travellers flocked to the website amid changing itineraries and flight routes.",
    "url": "https://www.hindustantimes.com/world-news/middle-east-airspace-empties-flightradar24-down-amid-middle-east-conflict-101772276836110.html",
    "published": "2026-02-28T16:48:31+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Middle East airspace empties, FlightRadar24 down amid US-Iran conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "The Middle East airspace has seen significant disruption as travelers and airlines adjust flight routes due to the ongoing US-Iran conflict. FlightRadar24 experienced downtime due to high traffic as people sought real-time updates on airspace changes. This highlights the broader impact of the conflict on civilian aviation and regional air travel safety."
  },
  {
    "id": "baff319210c5eb1a",
    "title_original": "Pakistan-Afghanistan 'open war' LIVE: Pakistan fighter jet shot down, pilot captured, says Afghan police; Islamabad denies",
    "content_original": "Earlier, Afghan police and military claimed that a Pakistani jet has crashed in Jalalabad city, and the pilot was captured alive",
    "url": "https://www.thehindu.com/news/international/pakistan-afghanistan-war-2026-airstrikes-attack-february-28-the-hindu-live-updates/article70686940.ece",
    "published": "2026-02-28T16:34:12+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan fighter jet shot down in Afghanistan, pilot captured",
    "relevant": true,
    "translated": true,
    "summary_en": "A Pakistani fighter jet was reportedly shot down in Jalalabad, Afghanistan, with the pilot captured by Afghan forces. Pakistan denies the incident. This escalation could further strain Pakistan-Afghanistan relations and may have regional security implications amid ongoing conflicts in the area."
  },
  {
    "id": "d4dd422b0e3712f1",
    "title_original": "US-Iran update: Defense Chief Amir Hatami not killed in latest US strike, ‘actively commanding forces’",
    "content_original": "Iranian officials have rubbished media reports about the death of Army Chief Amir Hatami amid the latest US and Israeli strikes on Iran",
    "url": "https://www.hindustantimes.com/world-news/us-israel-iran-update-defense-chief-amir-hatami-not-killed-in-latest-us-strike-actively-commanding-forces-101772275645206.html",
    "published": "2026-02-28T16:31:10+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranian Defense Chief Amir Hatami not killed in US strike",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian Army Chief Amir Hatami is alive and reportedly actively commanding forces, despite rumors of his death in recent US and Israeli strikes on Iran. This clarification comes from Iranian officials who have dismissed media reports suggesting his death. The survival of a top military leader is significant for Iran's command and control amid ongoing hostilities."
  },
  {
    "id": "ec52aaf1656d3d26",
    "title_original": "Bahrain, Dubai, Riyadh: Full list of Middle East cities where explosions were heard amid US-Iran conflict",
    "content_original": "Several explosions were reported in Riyadh, Abu Dhabi, Dubai, Doha and Manama, while one civilian was reported died in Abu Dhabi, capital of the UAE.",
    "url": "https://www.hindustantimes.com/world-news/bahrain-abu-dhabi-riyadh-dubai-full-list-of-middle-east-sites-under-attack-amid-us-iran-conflict-101772276092785.html",
    "published": "2026-02-28T16:30:31+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions Heard in Multiple Middle East Cities Amid US-Iran Conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Explosions were reported in Riyadh, Abu Dhabi, Dubai, Doha, and Manama, with one civilian fatality in Abu Dhabi. This indicates a potential escalation of the conflict with attacks on civilian infrastructure and cities in US-allied Gulf states. The incidents highlight the regional reach of the conflict and the vulnerability of Gulf Cooperation Council countries."
  },
  {
    "id": "7f4eda70b80f8153",
    "title_original": "Has US officially declared war on Iran? Trump talks about 'eliminating imminent threats'",
    "content_original": "The Pentagon has named the strikes \"Operation Epic Fury.\"",
    "url": "https://www.hindustantimes.com/world-news/us-news/has-us-officially-declared-war-on-iran-trump-talks-about-eliminating-imminent-threats-101772273971952.html",
    "published": "2026-02-28T16:24:08+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US officials discuss military actions against Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The Pentagon has named the strikes 'Operation Epic Fury,' indicating ongoing military operations against Iran. Former President Trump has mentioned 'eliminating imminent threats,' suggesting potential escalation in US actions. This highlights the ongoing conflict and potential for further military engagement."
  },
  {
    "id": "badb4878d50399bf",
    "title_original": "US Navy's Fifth Fleet HQ attacked in Bahrain? Video goes viral as Iran vows retaliation",
    "content_original": "Bahrain reported a missile strike on the US Navy's Fifth Fleet headquarters but provided no details on damage or casualties.",
    "url": "https://www.hindustantimes.com/world-news/us-news/us-navys-fifth-fleet-hq-attacked-in-bahrain-video-goes-viral-as-iran-vows-retaliation-101772274801519.html",
    "published": "2026-02-28T16:16:56+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US Navy's Fifth Fleet HQ Attacked in Bahrain",
    "relevant": true,
    "translated": true,
    "summary_en": "Missiles struck the US Navy's Fifth Fleet headquarters in Bahrain, though details on damage and casualties remain unclear. This attack represents a significant escalation, targeting a critical US military installation in the region. The incident follows Iran's vow of retaliation, indicating potential direct engagement by Iran or its proxies against US assets."
  },
  {
    "id": "8d3ff5df90212b45",
    "title_original": "‘Hope to travel to India as soon as airspace opens’: Middle East NRIs as US-Iran conflict spreads across region",
    "content_original": "“Sirens have been ringing out. We know people who are saying there is a lot of movement at the Al Salem base,” says Indian in Kuwait.",
    "url": "https://www.hindustantimes.com/india-news/hope-to-travel-to-india-as-soon-as-airspace-opens-middle-east-nris-as-us-iran-conflict-spreads-across-region-101772274325789.html",
    "published": "2026-02-28T16:16:54+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "NRIs in Middle East await travel to India as US-Iran conflict escalates",
    "relevant": true,
    "translated": true,
    "summary_en": "The ongoing US-Iran conflict is causing concern among NRIs in the Middle East, particularly in Kuwait, where increased military activity at Al Salem base has been reported. The situation is prompting many to consider traveling to India once airspace becomes available, highlighting the broader regional impact and civilian concerns amid the escalating hostilities."
  },
  {
    "id": "c9b42ae3ced6492a",
    "title_original": "NASA announces overhaul of Artemis lunar programme amid technical delays",
    "content_original": "The changes mean that Artemis 3, which was meant to send astronauts to the Moon's surface, will now have the different test goal of \"rendezvous in low-earth orbit\"",
    "url": "https://www.thehindu.com/sci-tech/science/nasa-announces-overhaul-of-artemis-lunar-programme-amid-technical-delays/article70687699.ece",
    "published": "2026-02-28T16:07:50+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "NASA announces overhaul of Artemis lunar programme amid technical delays",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9d9c21598f52e497",
    "title_original": "Indian nationals in UAE, Iran, Israel warned as missiles fly across Middle East | Full list of Indian advisories",
    "content_original": "The Ministry of External Affairs has urged Indian nationals in the region to exercise caution and follow instructions issued by local authorities.",
    "url": "https://www.hindustantimes.com/world-news/indian-nationals-in-uae-iran-israel-riyadh-warned-amid-middle-east-conflict-full-list-of-indian-advisories-101772273861198.html",
    "published": "2026-02-28T16:06:24+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian nationals in UAE, Iran, Israel warned as missiles fly across Middle East",
    "relevant": true,
    "translated": true,
    "summary_en": "The Indian Ministry of External Affairs has issued a warning for Indian nationals in the UAE, Iran, and Israel due to ongoing missile attacks in the Middle East. The advisory urges caution and adherence to local authority instructions amidst escalating regional hostilities. This highlights the broader impact of the Iran-US conflict on civilian safety and international vigilance in the region."
  },
  {
    "id": "18fd8f58dac647eb",
    "title_original": "Saudi Arabia, Kuwait urgently recall baby formula products: What every consumer must know",
    "content_original": "Saudi Arabia, Kuwait urgently recall baby formula products: What every consumer must know",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/saudi-arabia-kuwait-urgently-recall-baby-formula-products-what-every-consumer-must-know/articleshow/128881812.cms",
    "published": "2026-02-28T16:05:48+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Saudi Arabia, Kuwait recall baby formula products",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "dcd1eeb36ef91911",
    "title_original": "At least two killed in attack on Iraq military base as Iran-Israel conflict escalates",
    "content_original": "A source from Kataeb Hezbollah told AFP that \"there are two martyrs from Kataeb and another five wounded in the aggression on the Jurf al-Nasr base.\"",
    "url": "https://www.hindustantimes.com/world-news/at-least-two-killed-in-attack-on-iraq-military-base-as-iran-israel-conflict-escalates-101772274199841.html",
    "published": "2026-02-28T16:00:05+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Two killed in attack on Iraq military base amid Iran-Israel conflict escalation",
    "relevant": true,
    "translated": true,
    "summary_en": "Unidentified attackers targeted the Jurf al-Nasr military base in Iraq, resulting in two fatalities and five injuries among Kataeb Hezbollah forces. This incident highlights the escalating tensions and proxy conflict between Iran and Israel, with Iraq being a key battleground. The attack signifies an expansion of hostilities beyond direct Iran-US confrontations."
  },
  {
    "id": "40a4a7e107e13922",
    "title_original": "Why did US strike Iran today? All we know as explosions rock Tehran amid nuclear tension",
    "content_original": "Explosions rocked Tehran as the US launched major combat operations against Iran's regime, aimed at eliminating imminent threats.",
    "url": "https://www.hindustantimes.com/world-news/us-news/why-did-us-strike-iran-today-all-we-know-as-explosions-rock-tehran-amid-nuclear-tension-101772271394236.html",
    "published": "2026-02-28T15:59:04+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US strikes Iran amid escalating nuclear tensions",
    "relevant": true,
    "translated": true,
    "summary_en": "The US launched major combat operations targeting Iran's regime in Tehran, aiming to eliminate imminent threats. This comes amid heightened nuclear tensions between the two nations. The strikes signify a significant escalation in the ongoing conflict."
  },
  {
    "id": "309e7e95db038f81",
    "title_original": "Winston Churchill statue vandalised in London: Man arrested for writing ‘Free Palestine’",
    "content_original": "Winston Churchill statue vandalised in London: Man arrested for writing ‘Free Palestine’",
    "url": "https://timesofindia.indiatimes.com/world/uk/winston-churchill-statue-vandalised-in-london-man-arrested-for-writing-free-palestine/articleshow/128881678.cms",
    "published": "2026-02-28T15:58:17+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Winston Churchill statue vandalised in London",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f4ebe93817520a7b",
    "title_original": "Trump says U.S. carrying out ‘major combat operations’ in Iran",
    "content_original": "Trump went on to appeal to the Iranian people to ‘take over your government — it will be yours to take’",
    "url": "https://www.thehindu.com/news/international/donald-trump-iran-conflict-nuclear-weapon-february-28-2026/article70687380.ece",
    "published": "2026-02-28T15:39:11+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump says U.S. carrying out ‘major combat operations’ in Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "Former US President Donald Trump claimed that the US is conducting 'major combat operations' in Iran, which suggests potential escalation in the ongoing conflict. This statement could indicate increased US military activity targeting Iran or its assets. The appeal to the Iranian people to 'take over your government' adds a political dimension, potentially aiming to destabilize Iranian leadership amidst the conflict."
  },
  {
    "id": "e5c6dd3ab7ff2adb",
    "title_original": "Explosions heard in Saudi capital Riyadh, UAE's Dubai and Abu Dhabi as Iran launches missiles",
    "content_original": "Explosions were heard across Dubai, Abu Dhabi and the Saudi capital of Riyadh following US, Israel's strike on Iran.",
    "url": "https://www.hindustantimes.com/world-news/explosions-heard-in-saudi-capital-riyadh-uaes-dubai-and-abu-dhabi-as-iran-launches-missiles-101772272341344.html",
    "published": "2026-02-28T15:29:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions heard in Saudi and UAE cities as Iran launches missiles",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missiles targeting Saudi Arabia's Riyadh and UAE's Dubai and Abu Dhabi in retaliation for US and Israeli strikes on Iran. The attacks demonstrate Iran's capability to strike key cities in the Gulf region, escalating tensions and threatening regional stability. The incidents highlight the risk of a broader conflict spreading beyond Iran's borders."
  },
  {
    "id": "4eea401c64b17879",
    "title_original": "Full list of US advisories issued after Iran strikes: Where Americans are being told to shelter-in-place",
    "content_original": "US embassies and consulates in Qatar, the United Arab Emirates and Israel said staff had been instructed to shelter in place.",
    "url": "https://www.hindustantimes.com/world-news/us-news/full-list-of-us-advisories-issued-after-iran-strikes-where-americans-are-being-told-to-shelter-in-place-qatar-uae-101772270746617.html",
    "published": "2026-02-28T15:23:31+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US advisories issued after Iran strikes: Americans told to shelter-in-place",
    "relevant": true,
    "translated": true,
    "summary_en": "The US has issued shelter-in-place advisories for its embassies and consulates in Qatar, the UAE, and Israel following Iranian strikes. This indicates heightened concerns over potential retaliatory attacks by Iran in the region and aims to ensure the safety of American personnel. The move underscores the ongoing tensions and potential for escalation in the conflict."
  },
  {
    "id": "700e1e45ba710a3c",
    "title_original": "World holds breath as US, Israel strike Iran",
    "content_original": "Countries in the Middle East and around the world were watching with bated breath after the United States and Israel carried out long-feared strikes on Iran on Saturday. Trump: ‘annihilate’ US President Donald Trump vowed that the strikes would cripple Iran’s military and urged Iranians to rise up against the Islamic republic. “We are going to destroy their missiles and raze their missile industry to the ground. It will be totally — again — obliterated. We’re going to annihilate their navy,” Trump said in the address from his Florida home posted to his Truth Social platform. Calling on Iranians to stand up to their government, Trump added: “The hour of your freedom is at hand.” But he also warned that “the lives of courageous American heroes may be lost and we may have casualties”. Netanyahu ‘cast off the yoke’ Israeli Prime Minister Benjamin Netanyahu said the operation aimed to “remove the existential threat posed by the terrorist regime in Iran”, and urged Iranians to overthrow the ...",
    "url": "https://www.dawn.com/news/1976435/world-holds-breath-as-us-israel-strike-iran",
    "published": "2026-02-28T15:23:13+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The United States and Israel conducted coordinated strikes on Iran, targeting its military infrastructure and missile capabilities. President Trump announced the attacks, aiming to cripple Iran's military and naval forces, while also calling for Iranians to rise against their government. The strikes mark a significant escalation in the ongoing conflict, with potential regional and global implications."
  },
  {
    "id": "e07c5ba8106a4621",
    "title_original": "Air India, IndiGo suspend all flights to Middle East after US-Iran conflict snowballs",
    "content_original": "The advisories come after the US-Iran conflict snowballed as several key places, including Dubai, Abu Dhabi, Amman and Riyadh were bombed.",
    "url": "https://www.hindustantimes.com/world-news/air-india-suspends-all-flights-to-middle-east-after-israel-iran-conflict-snowballs-101772272247126.html",
    "published": "2026-02-28T15:22:56+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Air India and IndiGo suspend flights to Middle East amid escalating US-Iran conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Air India and IndiGo have halted flights to the Middle East following the escalation of the US-Iran conflict, with several key cities like Dubai, Abu Dhabi, Amman, and Riyadh being targeted. The suspension of flights highlights the growing risk to civilian aviation and regional instability as the conflict intensifies. This development underscores the broader impact of the conflict on international travel and commerce in the region."
  },
  {
    "id": "6931d9cd09fc3b35",
    "title_original": "Yemen's Iranian-backed Houthi rebels to resume attacks on shipping in Red Sea corridor: Officials",
    "content_original": "One of the officials said the rebels' first attack could come as soon as “tonight”",
    "url": "https://www.thehindu.com/news/international/yemens-iranian-backed-houthi-rebels-to-resume-attacks-on-shipping-in-red-sea-corridor-officials/article70687579.ece",
    "published": "2026-02-28T15:22:12+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Houthi rebels to resume attacks on Red Sea shipping",
    "relevant": true,
    "translated": true,
    "summary_en": "Yemen's Houthi rebels, backed by Iran, plan to resume attacks on shipping in the Red Sea corridor, with the first attack potentially occurring as soon as tonight. This development indicates an escalation in the conflict and poses a direct threat to international maritime trade in the strategically vital waterway. The move is likely to provoke a response from the US and its allies, who have previously targeted Houthi naval capabilities in the region."
  },
  {
    "id": "9f89ddc441c74b03",
    "title_original": "Full list of airlines that have cancelled, rerouted flights to Middle East amid Iran-Israel conflict",
    "content_original": "As the geopolitical landscape in the Middle East escalates, airlines worldwide are responding with flight cancellations and route changes amid uncertainty.",
    "url": "https://www.hindustantimes.com/world-news/full-list-of-airlines-that-have-cancelled-rerouted-flights-to-middle-east-amid-iran-israel-conflict-101772271300637.html",
    "published": "2026-02-28T15:21:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Airlines cancel or reroute flights to Middle East due to Iran-Israel conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Airlines worldwide are canceling or rerouting flights to the Middle East due to escalating tensions and uncertainty from the Iran-Israel conflict. This response reflects concerns over potential threats to civilian aviation amid military activities and hostilities in the region. The move highlights the broader impact of the conflict on regional and global travel and transportation."
  },
  {
    "id": "c40d648af94969a4",
    "title_original": "'Will make you regret': Iran in first reaction to US-Israel strikes",
    "content_original": "Iran’s Foreign Ministry said Tehran will make its aggressors regret their actions following strikes by the United States and Israel.",
    "url": "https://www.hindustantimes.com/world-news/will-make-you-regret-iran-in-first-reaction-to-us-israel-strikes-101772271968651.html",
    "published": "2026-02-28T15:17:39+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran threatens retaliation for US-Israel strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Ministry has vowed to retaliate against the United States and Israel for their recent strikes, signaling potential escalation in the ongoing conflict. This statement underscores the heightened tensions and direct threats between Iran and its adversaries. The strategic significance lies in the potential for further military engagements as Iran considers its response."
  },
  {
    "id": "a3477eb26312dcd8",
    "title_original": "PTA urges citizens to avoid sharing ‘unverified, inflammatory’ information amid heightened geopolitical tensions",
    "content_original": "The Pakistan Telecommunication Authority (PTA) on Saturday issued an advisory cautioning citizens against sharing “unverified, inflammatory or misleading information” in light of the recent geopolitical situation. “In view of the prevailing sensitive national situation, PTA urges all citizens to be responsible while using social media and digital platforms,” the body said, advising citizens not to “share, disseminate, forward or upload information/content which is authentic and based upon official sources and to refrain from spreading rumours and fake news”. PTA cautioned against sharing fake news or information “liable to legal action in accordance with applicable laws”. “PTA calls upon all citizens to act with caution, maturity, and a strong sense of national responsibility to help, maintain stability and public confidence,” the statement added. The statement comes against the backdrop of escalating geopolitical tension in the Middle East, as Israel and the United States launched an ...",
    "url": "https://www.dawn.com/news/1976446/pta-urges-citizens-to-avoid-sharing-unverified-inflammatory-information-amid-heightened-geopolitical-tensions",
    "published": "2026-02-28T15:15:11+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PTA warns against sharing unverified information amid geopolitical tensions",
    "relevant": true,
    "translated": true,
    "summary_en": "The Pakistan Telecommunication Authority (PTA) has advised citizens to avoid sharing unverified and inflammatory content due to heightened geopolitical tensions. This warning comes as the region faces increased risks related to the ongoing Iran-US conflict and its potential impact on neighboring countries. The PTA's advisory underscores the potential for misinformation to exacerbate regional instability and security concerns."
  },
  {
    "id": "bd0a85d723a94f4e",
    "title_original": "Missiles hit US navy facility in Bahrain as Iran-US-Israel conflict spills across region - video",
    "content_original": "Missiles hit US navy facility in Bahrain as Iran-US-Israel conflict spills across region - video",
    "url": "https://timesofindia.indiatimes.com/defence/international/missiles-hit-us-navy-facility-in-bahrain-as-iran-us-israel-conflict-spills-across-region-video/articleshow/128881102.cms",
    "published": "2026-02-28T15:14:33+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Missiles hit US navy facility in Bahrain as Iran-US-Israel conflict spills across region",
    "relevant": true,
    "translated": true,
    "summary_en": "Missiles struck a US Navy facility in Bahrain, highlighting the escalating regional conflict involving Iran, the US, and Israel. The attack on a critical US military installation in the Gulf signifies a direct escalation by Iran or its proxies. This incident underscores the vulnerability of US bases in the region and the widening geographic scope of the conflict."
  },
  {
    "id": "4ab75e8aa74e530a",
    "title_original": "Netanyahu says U.S. and Israel launched strikes on Iran to “remove existential threat”",
    "content_original": "The Israeli Prime Minister advised his citizens to comply with the directives of the Home Front Command",
    "url": "https://www.thehindu.com/news/international/netanyahu-says-us-and-israel-launched-strikes-on-iran-to-remove-existential-threat/article70687578.ece",
    "published": "2026-02-28T15:09:03+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Netanyahu says U.S. and Israel launched strikes on Iran to “remove existential threat”",
    "relevant": true,
    "translated": true,
    "summary_en": "Israeli Prime Minister Netanyahu announced that the U.S. and Israel conducted joint strikes on Iran to eliminate what they perceive as an existential threat. This indicates a significant escalation in the ongoing conflict, showcasing direct military collaboration between the U.S. and Israel against Iran. The statement also suggests a strategic shift or intensification in their approach to countering Iranian threats."
  },
  {
    "id": "eeb03b1e1c1c4892",
    "title_original": "Iran defence minister and Revolutionary Guards commander killed, three sources say",
    "content_original": "Iran's Defence Minister Amir Nasirzadeh and Revolutionary Guards commander Mohammed Pakpour are believed to have been killed in Israeli attacks, two sources familiar with Israel's military operations and one regional source said. Iranian Defense Minister Amir Nasirzadeh and IRGC commander Mohammad Pakpour have been killed in Israeli attacks, Reuters reports, citing three sources familiar with the matter. pic.twitter.com/62ym4K6FZz &mdash; Al Arabiya English (@AlArabiya_Eng) February 28, 2026 Iran's foreign minister Abbas Araghchi said that &quot;we may have lost a few commanders, but that's not such a big problem,&quot; according to an NBC News reporter on X. He accused Israeli Prime Minister Benjamin Netanyahu and former US president Donald Trump of waging an unjustified confrontation against Tehran, warning that Iran&rsquo;s armed forces were ready to respond. In a statement posted on social media platform X, Araghchi said: &ldquo;Netanyahu and Trump's war on Iran is wholly unprovoke...",
    "url": "https://tribune.com.pk/story/2595068/iran-defence-minister-and-revolutionary-guards-commander-killed-three-sources-say",
    "published": "2026-02-28T15:08:03+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranian Defense Minister and IRGC Commander Killed in Israeli Attacks",
    "relevant": true,
    "translated": true,
    "summary_en": "Israel reportedly conducted attacks that killed Iran's Defense Minister Amir Nasirzadeh and IRGC commander Mohammad Pakpour. This development signifies a significant escalation in the conflict, targeting high-ranking Iranian military leadership. Iran's foreign minister downplayed the impact, suggesting potential instability within Iran's command structure."
  },
  {
    "id": "f61cf6f6ca584b2a",
    "title_original": "Can Iran strike the US in retaliation? A look at Tehran's allies as Trump launches ‘Operation Epic Fury’",
    "content_original": "The US has initiated major combat operations in Iran, as President Trump seeks to eliminate nuclear threats.&nbsp;",
    "url": "https://www.hindustantimes.com/world-news/us-news/can-iran-strike-the-us-in-retaliation-a-look-at-tehrans-allies-as-trump-launches-operation-epic-fury-101772270922576.html",
    "published": "2026-02-28T15:03:26+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Can Iran strike the US in retaliation? A look at Tehran's allies as Trump launches ‘Operation Epic Fury’",
    "relevant": true,
    "translated": true,
    "summary_en": "The US has initiated major combat operations in Iran under 'Operation Epic Fury' led by President Trump, aiming to eliminate nuclear threats. This signifies a significant escalation in the conflict with potential retaliatory actions from Iran and its allies. The military and strategic significance involves direct US engagement targeting Iran's nuclear capabilities and the broader implications for regional stability."
  },
  {
    "id": "2a0752f83319dc45",
    "title_original": "Iran claims it destroyed US missile tracking radar in Qatar",
    "content_original": "The Islamic Revolutionary Guard Corps (IRGC) claimed on Saturday that the United States FPS-132 radar stationed at a military base in Qatar was &ldquo;completely destroyed&rdquo; in Iranian retaliatory strikes following the joint US-Israeli air raids on the Islamic Republic. &nbsp; #BREAKING IRGC Public Relations: The American radar FP132, with a range of 5,000 kilometers, stationed in Qatar with unique equipment designed for tracking ballistic missiles, was completely destroyed. pic.twitter.com/YfIjz2ypQG &mdash; Tehran Times (@TehranTimes79) February 28, 2026 According to the IRGC, the radar, used to detect ballistic missiles, has an operational range of approximately 5,000 kilometres. Al Mayadeen, an&nbsp;independent Arab&nbsp;media channel, reported that the AN/FPS-132 early warning radar is a key component of US missile defence infrastructure. Among the targets of the Iranian retaliatory strikes was the FPS132 American radar stationed in a US base in Qatar, now completely destroye...",
    "url": "https://tribune.com.pk/story/2595066/iran-claims-it-destroyed-us-missile-tracking-radar-in-qatar",
    "published": "2026-02-28T15:01:36+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran claims destruction of US missile tracking radar in Qatar",
    "relevant": true,
    "translated": true,
    "summary_en": "The IRGC claims to have destroyed the US FPS-132 radar in Qatar, which has a 5,000 km range for tracking ballistic missiles, in retaliation for joint US-Israeli air raids on Iran. This signifies an escalation in the conflict and direct targeting of US military assets in the region."
  },
  {
    "id": "78e371fbdbc6a7f4",
    "title_original": "Israel-US attack on Iran ignites wider Middle East conflict: US bases in UAE, Qatar Bahrain, Saudi become targets",
    "content_original": "Airspace has been closed across a number of countries as the war is feared to spread wider in the West Asia/Middle East region.",
    "url": "https://www.hindustantimes.com/world-news/israelus-attack-on-iran-spreads-to-wider-middle-east-us-bases-in-uae-bahrain-kuwait-qatar-become-targets-101772270192009.html",
    "published": "2026-02-28T15:00:33+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel-US attack on Iran ignites wider Middle East conflict: US bases in UAE, Qatar, Bahrain, Saudi become targets",
    "relevant": true,
    "translated": true,
    "summary_en": "Israel and the US launched attacks on Iran, prompting retaliatory strikes against US bases in the UAE, Qatar, Bahrain, and Saudi Arabia. The conflict is escalating as airspace closures indicate a potential spread of hostilities across the Middle East. This development signifies a significant regional escalation with direct threats to US military assets and regional stability."
  },
  {
    "id": "1c7e25bdf6fcf928",
    "title_original": "‘Shelter in place until further notice’: US embassy in Jerusalem issues security alert as Iran attacked",
    "content_original": "The embassy noted that the Government of Israel has \"closed the airspace to all civilian flights\".",
    "url": "https://www.hindustantimes.com/world-news/shelter-in-place-until-further-notice-us-embassy-in-jerusalem-issues-security-alert-as-iran-attacked-101772268677532.html",
    "published": "2026-02-28T14:59:28+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US embassy in Jerusalem issues security alert amid Iran attacks",
    "relevant": true,
    "translated": true,
    "summary_en": "The US embassy in Jerusalem has issued a 'shelter in place' security alert and the Israeli government has closed airspace to civilian flights in response to Iranian attacks. This indicates a significant escalation in the conflict and raises concerns about potential threats to US personnel and assets in the region. The move highlights the heightened state of alert and defensive posture in Israel due to the ongoing hostilities with Iran."
  },
  {
    "id": "cd1d7482f889e081",
    "title_original": "Strikes, sirens, smokes: US-Israel Iran strike spark worst Middle East conflict",
    "content_original": "Donald Trump acknowledged the possibility of American losses during the operations. “The lives of courageous American heroes may be lost”.",
    "url": "https://www.hindustantimes.com/world-news/missiles-sirens-shut-airspaces-how-past-hour-unfloded-in-middle-east-amid-us-israels-epic-fury-iran-101772268764624.html",
    "published": "2026-02-28T14:58:33+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US-Israel Iran strike sparks worst Middle East conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel conducted a joint strike on Iran, escalating tensions and igniting the most severe conflict in the Middle East. The operation acknowledged potential American casualties, highlighting the risks involved. This escalation signifies a dangerous new phase in the ongoing US-Iran confrontation."
  },
  {
    "id": "24645931162abd3d",
    "title_original": "UAE public school enrolment closing soon: Here’s what parents need to know",
    "content_original": "UAE public school enrolment closing soon: Here’s what parents need to know",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/uae-public-school-enrolment-closing-soon-heres-what-parents-need-to-know/articleshow/128880523.cms",
    "published": "2026-02-28T14:52:35+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UAE public school enrolment closing soon: Here’s what parents need to know",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7a232cade6ba293a",
    "title_original": "OGRA orders refineries to ensure adequate oil reserves due to Middle East situation",
    "content_original": "The Oil and Gas Regulatory Authority (OGRA) on Saturday ordered all stakeholders to make certain and ensure&nbsp;an adequate stock of petroleum&nbsp;products amid the raging conflict in the Middle East unleashed by attacks of Israel and the United States on Iran that prompted retaliatory strikes. Earlier in the day,&nbsp;the US and Israel jointly launched strikes on Iran that&nbsp;pushed the Middle East into renewed military confrontation and further dimmed hopes for a diplomatic solution to the West&rsquo;s long-standing effort to denuclearise Iran, despite Tehran&rsquo;s repeated assertions that it will not pursue nuclear weapons. In response, Iran targeted Israel and US bases in the Middle East. Explosions were reported in Kuwait, the United Arab Emirates, Bahrain and Qatar. The OGRA director general&nbsp;released a notification today to all&nbsp;refineries nationwide and relevant divisions to &quot; ensure availability of adequate stocks of crude and petroleum products (MS, HSD &am...",
    "url": "https://tribune.com.pk/story/2595062/ogra-orders-refineries-to-ensure-adequate-oil-reserves-due-to-middle-east-situation",
    "published": "2026-02-28T14:08:38+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "OGRA orders refineries to ensure adequate oil reserves due to Middle East conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "The Oil and Gas Regulatory Authority (OGRA) has directed refineries to maintain sufficient petroleum reserves amid escalating hostilities in the Middle East, following US and Israeli strikes on Iran and subsequent retaliatory attacks. This move underscores concerns over potential disruptions to oil supplies and regional stability due to the ongoing conflict."
  },
  {
    "id": "bfa67ebd1ca8aa35",
    "title_original": "Trump raises the possibility of a ‘friendly takeover of Cuba’ coming out of talks with Havana",
    "content_original": "Cuba has been on U.S. President Donald Trump's mind since at least early January, after U.S. forces ousted one of Havana's closest allies, Venezuelan's socialist President Nicolás Maduro",
    "url": "https://www.thehindu.com/news/international/trump-raises-the-possibility-of-a-friendly-takeover-of-cuba-coming-out-of-talks-with-havana/article70687286.ece",
    "published": "2026-02-28T14:01:06+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump raises possibility of 'friendly takeover of Cuba' after talks with Havana",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d76cab9f60226987",
    "title_original": "US, Israel attack Iran: AI Tel Aviv flight returning to India",
    "content_original": "US, Israel attack Iran: AI Tel Aviv flight returning to India",
    "url": "https://timesofindia.indiatimes.com/india/us-israel-attack-iran-ai-tel-aviv-flight-returning-to-india-fuelling-stop-in-europe-likely-for-north-america-flights/articleshow/128879138.cms",
    "published": "2026-02-28T13:48:41+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel attack Iran: Air India flight from Tel Aviv returns to India",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel have launched a joint attack on Iran, prompting an Air India flight en route from Tel Aviv to India to return to its origin. This development indicates a significant escalation in the ongoing conflict, with potential implications for regional air travel and safety. The strategic significance involves the coordination between the US and Israel against Iran, reflecting deepening military cooperation amidst the conflict."
  },
  {
    "id": "e591c9106f976d07",
    "title_original": "Misinformation and memes run amok amidst Pak-Afghan conflict",
    "content_original": "The moment reports of a military confrontation break, newsrooms gear up for sleepless nights, social media erupts with all sorts of “information” and memes (the latter is Pakistan-specific), and fact-checkers know they will have their hands full in the coming days. The latest clashes between Pakistan and Afghanistan, which began late Thursday night and continued into early Saturday morning, was no different. Within the first 12 hours, the fact-checking team at iVerify Pakistan had spotted more than a dozen claims circulating on social media, ranging from the names of Taliban commanders allegedly killed and footage of Pakistani jets crashing to visuals of chaos following an attack on the Kakul military academy and soldiers from both sides purportedly being captured. Local journalists and social media commentators all fed into this cycle of mis- and disinformation, along with propaganda accounts from India and Afghanistan. When war turns into content In the midst of the late-night action...",
    "url": "https://www.dawn.com/news/1976305/misinformation-and-memes-run-amok-amidst-pak-afghan-conflict",
    "published": "2026-02-28T13:42:42+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Misinformation and memes spread during Pakistan-Afghanistan conflict",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "a0a1dbe0f4174edc",
    "title_original": "Pakistani fighter jet crashes in Jalalabad, pilot captured, say Afghanistan military, police",
    "content_original": "Wahidullah Mohammadi, spokesman for the military in eastern Afghanistan, confirmed the Pakistani jet was downed by Afghan forces \"and the pilot was captured alive”",
    "url": "https://www.thehindu.com/news/international/pakistan-fighter-jet-crashes-in-afghanistans-jalalabad-pilot-captured-alive/article70687231.ece",
    "published": "2026-02-28T13:12:29+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani fighter jet crashes in Jalalabad, pilot captured by Afghan forces",
    "relevant": true,
    "translated": true,
    "summary_en": "A Pakistani fighter jet crashed in Jalalabad, Afghanistan, and the pilot was captured alive by Afghan forces. This incident could escalate tensions between Pakistan and Afghanistan, particularly if the jet was engaged in operations related to the ongoing Iran-US conflict or regional proxy activities. The circumstances of the crash and the pilot's status remain unclear, but it signifies potential instability in the region."
  },
  {
    "id": "49e1978684d4d93d",
    "title_original": "Iran’s top leadership ‘in perfect health’, local media claims",
    "content_original": "Iran&rsquo;s senior officials are &ldquo;in perfect health&rdquo;, including President Masoud Pezeshkian, parliament speaker Mohammad Bagher Ghalibaf and security chief Ali Larijani,&nbsp;the&nbsp;Fars news agency reported on Saturday. &ldquo;While Israeli sources have claimed to have targeted and succeeded in attacking the president and senior Iranian leaders, official sources within the country report that senior regime officials, including the heads of the armed forces, are in perfect health,&rdquo; the report said. Read More: Trump says US carrying out 'major combat operations' in Iran The first wave of US and Israeli strikes in what the Pentagon named &lsquo;Operation Epic Fury&rsquo; mainly targeted Iranian officials, Reuters reported, quoting a &ldquo;source familiar with the matter&quot;. An Israeli official said Iranian Supreme Leader Ayatollah Ali Khamenei and President Pezeshkian were both targeted, but the result of the strikes was not clear. A source with knowledge of the ...",
    "url": "https://tribune.com.pk/story/2595061/irans-top-leadership-in-perfect-health-local-media-claims",
    "published": "2026-02-28T13:02:00+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's top leadership reportedly unharmed despite Israeli claims",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian state media claims that President Masoud Pezeshkian, parliament speaker Mohammad Bagher Ghalibaf, and security chief Ali Larijani are in perfect health, refuting Israeli claims of successful attacks on senior Iranian leaders. This comes amid ongoing 'Operation Epic Fury' by the US and Israel, indicating potential disinformation or miscommunication in the fog of war."
  },
  {
    "id": "63ded4b631ad5964",
    "title_original": "PTA warns against irresponsible social media use amid 'sensitive national situation'",
    "content_original": "The Pakistan Telecommunication Authority (PTA) urged citizens on Saturday to exercise responsibility while using social media and digital platforms in view of the prevailing sensitive national situation. The PTA&rsquo;s instruction came amid &ldquo;false&rdquo; reports circulated by Afghan Taliban officials and amplified by Indian media, claiming that Afghan forces had shot down a Pakistani fighter jet in Nangarhar and captured its pilot. Pakistani security forces have launched&nbsp;&ldquo;Operation Ghazab Lil Haq,&rdquo;&nbsp;carrying out coordinated air and ground strikes against Afghan Taliban positions in Kabul, Kandahar, Paktia and Nangarhar, as well as several other locations, following what officials described as unprovoked cross-border aggression. In a statement posted on X, the authority advised the public not to share, disseminate, forward or upload any unverified, inflammatory or misleading information that could directly or indirectly harm national interests, public order o...",
    "url": "https://tribune.com.pk/story/2595060/pta-warns-against-irresponsible-social-media-use-amid-sensitive-national-situation",
    "published": "2026-02-28T13:00:07+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PTA warns against irresponsible social media use amid 'sensitive national situation'",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "81f9809cfbcf450e",
    "title_original": "Ramadan brings a season of grief after an Israeli strike wiped out most of a Gaza family",
    "content_original": "In the Gaza Strip, Ramadan has become a season when wartime losses hit especially deep for the many families grieving loved ones killed by Israeli forces, which have been fighting Hamas for more than two years",
    "url": "https://www.thehindu.com/news/international/ramadan-brings-a-season-of-grief-after-an-israeli-strike-wiped-out-most-of-a-gaza-family/article70687190.ece",
    "published": "2026-02-28T12:57:49+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ramadan brings a season of grief after Israeli strike kills Gaza family",
    "relevant": true,
    "translated": true,
    "summary_en": "An Israeli strike in Gaza killed most of a family during Ramadan, exacerbating wartime grief for many families in the region. This incident is part of ongoing hostilities between Israel and Hamas that have persisted for over two years. The event underscores the human cost of the conflict and its impact on civilians during religious and sensitive periods."
  },
  {
    "id": "a866d0d1768845c5",
    "title_original": "'Urge all sides to exercise restraint': India on Middle East situation as US, Israel attack Iran",
    "content_original": "'Urge all sides to exercise restraint': India on Middle East situation as US, Israel attack Iran",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-iran-war-news-live-udates-conflict-attack-state-of-emergency-explosions-tehran-us-ali-khamenei/liveblog/128877850.cms",
    "published": "2026-02-28T12:55:53+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "India calls for restraint amid US and Israeli attacks on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "India has urged all parties to exercise restraint as the US and Israel continue their attacks on Iran. This statement comes amidst escalating hostilities in the Middle East, with significant military actions being taken by the US and Israel against Iranian targets. The strategic significance lies in India's cautious diplomatic stance, highlighting the potential for broader regional implications and the need for de-escalation."
  },
  {
    "id": "87622571d34bbfba",
    "title_original": "Farhan ton keeps semi-final hopes alive as Pakistan sets target of 213 against Sri Lanka",
    "content_original": "Openers Sahibzada Farhan and Fakhar Zaman put on a scintillating opening partnership to propel Pakistan to a target of 213 in their Super Eights Group 2 clash against hosts Sri Lanka at Pallekele. In a thrilling contest, Sahibzada Farhan once again proved his class, scoring a brilliant 100 off 60 balls, guiding Pakistan to a competitive total of 212/8 in 20 overs against Sri Lanka. Farhan&rsquo;s innings, studded with 9 fours and 5 sixes at a strike rate of 166.66. Fakhar Zaman provided solid support at the top, smashing 84 off 42 balls with 9 fours and 4 sixes, maintaining an astonishing strike rate of 200.00. However, the middle order struggled to build partnerships, with Khawaja Nafay contributing only 2 runs, and both Mohammad Nawaz and Salman Agha dismissed without scoring. Shadab Khan added a quickfire 7 off 5 balls, and Usman Khan remained unbeaten on 8, keeping the innings moving toward a challenging total. Late contributions from Shaheen Shah Afridi (4) and Naseem Shah (1) hel...",
    "url": "https://tribune.com.pk/story/2595059/sri-lanka-opts-to-bowl-first-as-pakistans-semi-final-hopes-hinge-on-nrr-in-super-eights-clash",
    "published": "2026-02-28T12:48:30+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan sets target of 213 against Sri Lanka in cricket match",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b40a8278e0302dfb",
    "title_original": "Israel Army strikes Hezbollah infrastructure in south Lebanon",
    "content_original": "Israel and Iran-backed Hezbollah agreed a ceasefire in November 2024 after a year of war, but Israel has continued regular strikes, saying it is enforcing ceasefire provisions against the group rearming",
    "url": "https://www.thehindu.com/news/international/israel-army-strikes-hezbollah-infrastructure-in-south-lebanon/article70687168.ece",
    "published": "2026-02-28T12:47:04+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel Army strikes Hezbollah infrastructure in south Lebanon",
    "relevant": true,
    "translated": true,
    "summary_en": "The Israeli military conducted strikes targeting Hezbollah infrastructure in southern Lebanon. This action follows a ceasefire agreement in November 2024, with Israel claiming it is enforcing the ceasefire by preventing Hezbollah from rearming. The strikes highlight ongoing tensions and potential for renewed conflict along Israel's northern border."
  },
  {
    "id": "0d68e130b92ad5d3",
    "title_original": "Mexico President Sheinbaum says FIFA will visit to assess World Cup security and mobility",
    "content_original": "The country's ability to co-host the World Cup has been under scrutiny this week following the violence that erupted this week",
    "url": "https://www.thehindu.com/news/international/mexico-president-sheinbaum-says-fifa-will-visit-to-assess-world-cup-security-and-mobility/article70687179.ece",
    "published": "2026-02-28T12:43:17+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Mexico President Sheinbaum says FIFA will visit to assess World Cup security and mobility",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f72324500210375a",
    "title_original": "Saudi Arabia slams Iran attacks in Gulf countries, says ready to defend brother states",
    "content_original": "Saudi Arabia strongly condemned Iranian missile attacks on United States military bases in the Gulf on Saturday and said it was ready to defend its fellow brotherly states as open conflict broke out in the Middle East. Earlier in the day, the US and Israel jointly launched strikes on Iran that pushed the Middle East into renewed military confrontation and further dimmed hopes for a diplomatic solution to the West&rsquo;s long-standing effort to denuclearise Iran, despite Tehran&rsquo;s repeated assertions that it will not pursue nuclear weapons. In response, Iran targeted Israel and US bases in the Middle East. Explosions were reported in Kuwait, the United Arab Emirates, Bahrain and Qatar. In a statement, Saudi Arabia said it strongly condemned and denounced what it said was &quot;blatant Iranian aggression and a flagrant violation of the sovereignty&quot; of the United Arab Emirates, Bahrain, Qatar, Kuwait and Jordan. &quot;The kingdom affirms its full solidarity with and unwavering ...",
    "url": "https://tribune.com.pk/story/2595057/saudi-arabia-slams-iran-attacks-on-us-bases-in-gulf-countries-says-ready-to-defend-brother-states",
    "published": "2026-02-28T12:33:33+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Saudi Arabia condemns Iran attacks on US bases in Gulf, pledges defense of allies",
    "relevant": true,
    "translated": true,
    "summary_en": "Saudi Arabia condemned Iran's missile attacks on US military bases in the Gulf and expressed readiness to defend fellow Gulf states. The attacks followed US and Israeli strikes on Iran, escalating regional tensions and further complicating diplomatic efforts to address Iran's nuclear program. Explosions were reported in Kuwait, UAE, Bahrain, and Qatar."
  },
  {
    "id": "ab6d4304a3f05961",
    "title_original": "OpenAI strikes Pentagon deal with 'safeguards' as Trump dumps Anthropic",
    "content_original": "The ban, in the form of a “supply chain risk” designation, came after the company objected to its artificial intelligence technology being used for domestic mass surveillance and fully autonomous weapons",
    "url": "https://www.thehindu.com/news/international/anthropic-vows-lawsuit-over-pentagon-ban-slams-intimidation/article70686918.ece",
    "published": "2026-02-28T12:25:50+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "OpenAI signs Pentagon deal with safeguards amid Trump criticism of Anthropic",
    "relevant": true,
    "translated": true,
    "summary_en": "OpenAI has secured a contract with the Pentagon that includes safeguards against misuse of AI, particularly for domestic surveillance and autonomous weapons. This development comes as former President Trump criticizes Anthropic, a competitor of OpenAI, likely over similar concerns about AI ethics and military applications. The deal highlights ongoing debates about AI regulation and its use in defense, with potential implications for tech companies' involvement in military projects."
  },
  {
    "id": "37fcbab4bbddadf3",
    "title_original": "At least 43 students killed in Israeli strike on girls' school in southern Iran",
    "content_original": "At least 43 students were killed and 63 others were wounded on Saturday in an Israeli strike targeting a girls&rsquo; school in Minab in Iran's Hormozgan Province, the Islamic Republic News Agency (IRNA) reported. Minab&rsquo;s provincial governor, Mohammad Radmehr, confirmed to IRNA that the Shajareye Tayabeh school had been directly attacked and that many students had been martyred. He said rescue and aid operations were underway at the school, adding that the security situation in the city was under control. Screams of grief filled the air in Minab, Iran, after an US-Israeli attack on an elementary school martyred multiple students. Follow https://t.co/boCY50qfi9 pic.twitter.com/EHlAGawkQn &mdash; Press TV 🔻 (@PressTV) February 28, 2026 The Iranian foreign minister vowed that the &quot;crimes against the Iranian people will not go unanswered&quot;. The destroyed building is a primary school for girls in the south of Iran. It was bombed in broad daylight, when packed with young pupil...",
    "url": "https://tribune.com.pk/story/2595054/at-least-40-students-killed-in-israeli-strike-on-girls-school-in-southern-iran",
    "published": "2026-02-28T12:21:14+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israeli strike kills at least 43 students at girls' school in southern Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "Israeli forces conducted a strike targeting a girls' school in Minab, Hormozgan Province, Iran, resulting in at least 43 fatalities and 63 injuries among students. The attack on the Shajareye Tayabeh school has heightened tensions, with rescue operations ongoing and local authorities confirming the situation is under control. This incident signifies a significant escalation in the conflict, highlighting the direct impact on civilian infrastructure and civilian casualties."
  },
  {
    "id": "1c7ca4af3000ad83",
    "title_original": "Sri Lanka detains former intelligence chief over Easter bombings",
    "content_original": "President Anura Kumara Dissanayake signed an order under the tough Prevention of Terrorism Act (PTA) to hold retired Army Major General Suresh Sallay for 90 days for questioning by detectives",
    "url": "https://www.thehindu.com/news/international/sri-lanka-detains-former-intelligence-chief-over-easter-bombings/article70687084.ece",
    "published": "2026-02-28T12:07:08+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Sri Lanka detains former intelligence chief over Easter bombings",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "a5d8e7a52461689d",
    "title_original": "PIA suspends its flight operations to several Gulf destinations amid escalating Middle East conflict",
    "content_original": "Pakistan International Airlines (PIA) has suspended its flight operations to several Gulf destinations in view of the evolving situation in the Middle East, a spokesperson for the airline announced on Saturday. The decision came after the United States and Israel jointly launched strikes on Iran, pushing the Middle East into renewed military confrontation and further dimming hopes for a diplomatic solution to the West&rsquo;s long-standing effort to denuclearise Iran, despite Tehran&rsquo;s repeated assertions that it will not pursue nuclear weapons. In response, Iran targeted Israel and US bases in the Middle East. Explosions were reported in Kuwait, the United Arab Emirates, Bahrain and Qatar. According to the spokesperson, PIA&rsquo;s flights to the United Arab Emirates, Bahrain, Doha and Kuwait have been temporarily suspended. The flights will remain inoperative at least until Sunday evening or until the restoration of normal airspace operations. ⚠️⛔️⚠️ In view of the developing si...",
    "url": "https://tribune.com.pk/story/2595051/pia-suspends-its-flight-operations-to-several-gulf-destinations-after-middle-east-tensions-break-out",
    "published": "2026-02-28T12:02:08+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PIA suspends Gulf flights amid escalating Middle East conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan International Airlines (PIA) has suspended flights to several Gulf destinations due to the escalating conflict in the Middle East, following US and Israeli strikes on Iran and subsequent Iranian retaliatory attacks on US bases and other regional targets. The suspension reflects the heightened risk and uncertainty in the region, impacting civilian travel and regional connectivity."
  },
  {
    "id": "8b4d48146d411fc2",
    "title_original": "Iftar, Sehri timings for Ramazan 10/11",
    "content_original": "Times for today’s Iftar (Ramazan 10) and tomorrow’s Sehri (Ramazan 11) for the federal and provincial capitals are listed below: Islamabad Fiqh-i-Hanafia Iftar (today) — 6:04pm Sehri (tomorrow) — 5:13am Fiqh-i-Jafria Iftar (today) — 6:14pm Sehri (tomorrow) — 5:03am Karachi Fiqh-i-Hanafia Iftar (today) — 6:34pm Sehri (tomorrow) — 5:36am Fiqh-i-Jafria Iftar (today) — 6:46pm Sehri (tomorrow) — 5:32am Lahore Fiqh-i-Hanafia Iftar (today) — 6:00pm Sehri (tomorrow) — 5:10am Fiqh-i-Jafria Iftar (today) — 6:10pm Sehri (tomorrow) — 5:00am Peshawar Fiqh-i-Hanafia Iftar (today) — 6:10pm Sehri (tomorrow) — 5:19am Fiqh-i-Jafria Iftar (today) — 6:20pm Sehri (tomorrow) — 5:09am Quetta Fiqh-i-Hanafia Iftar (today) — 6:32pm Sehri (tomorrow) — 5:40am Fiqh-i-Jafria Iftar (today) — 6:49pm Sehri (tomorrow) — 5:39am",
    "url": "https://www.dawn.com/news/1976376/iftar-sehri-timings-for-ramazan-1011",
    "published": "2026-02-28T11:30:25+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ramazan Iftar and Sehri timings announced for major cities",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7dd9f9138f7af25f",
    "title_original": "Watch: Iran must say they will not develop a nuclear weapon: Donald Trump",
    "content_original": "Watch: Iran must say they will not develop a nuclear weapon: Donald Trump",
    "url": "https://www.thehindu.com/shorts/watch-iran-must-say-they-will-not-develop-a-nuclear-weapon-donald-trump/article70687158.ece",
    "published": "2026-02-28T11:27:10+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump demands Iran declare no nuclear weapon development",
    "relevant": true,
    "translated": true,
    "summary_en": "Former US President Donald Trump called for Iran to publicly commit to not developing nuclear weapons. This statement comes amid ongoing conflict and concerns over Iran's nuclear program. The demand reflects heightened tensions and US strategic priorities regarding Iran's nuclear ambitions."
  },
  {
    "id": "6394dfe04b7e5117",
    "title_original": "Pakistan faces monumental task against Sri Lanka in crucial Super Eight",
    "content_original": "Pakistan cricket remains in limbo as the Twenty20 showpiece cruises towards the summit after the Super Eights phase concludes this weekend. While the Group 1 match between toppers South Africa and Zimbabwe in Delhi will be inconsequential, India’s game against West Indies of the same group in Kolkata will be a virtual quarter-final. Prior to the Sunday double-header, calculators will be on the moment today’s last Group 2 contest between Pakistan and Sri Lanka explodes into action in Pallekele under lights. As usual, Pakistan cricket fans, including the disgruntled ones, remain in their typical fanciful mode — waiting for something extraordinary to happen in a global competition. The beleaguered Green-shirts under Salman Ali Agha face a monumental task: beating the Islanders in their backyard and winning it big, to qualify for the semi-finals. Having already exited the event, the co-hosts have nothing to lose, and so expect some instinctive fireworks from them. The real puzzle is faced ...",
    "url": "https://www.dawn.com/news/1976374/pakistan-faces-monumental-task-against-sri-lanka-in-crucial-super-eight",
    "published": "2026-02-28T11:22:07+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan faces monumental task against Sri Lanka in crucial Super Eight",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ac3e67345d1b998e",
    "title_original": "Cuba unveils new details in fatal U.S. boat shooting and says a second boat on mission failed",
    "content_original": "“Authorities were able to establish that the 10 Cuban suspects left the U.S. in two boats, but one failed, so they transferred all the supplies to the remaining one and left the other adrift,” says Officials",
    "url": "https://www.thehindu.com/news/international/cuba-unveils-new-details-in-fatal-us-boat-shooting-and-says-a-second-boat-on-mission-failed/article70687083.ece",
    "published": "2026-02-28T11:09:05+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Cuba reveals details of fatal US boat shooting, reports second boat's mission failure",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "46c03cb711e9e7b4",
    "title_original": "U.S. says it supports Pakistan's 'right to defend itself' against Afghan Taliban",
    "content_original": "U.S. President Donald Trump, when asked whether he would intervene to stop the fighting between Pakistan and Afghanistan, said he gets along with Pakistan “very well” and that the country is doing “terrifically well”.",
    "url": "https://www.thehindu.com/news/international/us-says-it-supports-pakistans-right-to-defend-itself-against-afghan-taliban/article70686024.ece",
    "published": "2026-02-28T11:05:45+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S. supports Pakistan's right to defend against Afghan Taliban",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "c9beb4fd37f07440",
    "title_original": "Jammu and Kashmir win maiden Ranji Trophy",
    "content_original": "Jammu and Kashmir claimed their maiden Ranji Trophy on Saturday after a draw with eight-times champions Karnataka in the final of India's premier domestic first-class competition, securing the win on the basis of their first-innings lead. It was the first title in 67 years for Jammu and Kashmir, the Indian state that shares a border with neighbouring Pakistan. The two countries, who both control parts of the region, have fought two wars over it. &quot;I cannot explain and I don't have any words. It is the biggest thing in my life,&quot; Jammu and Kashmir captain Paras Dogra said. &quot;I have been lucky to be with JKCA (Jammu and Kashmir Cricket Association). The guys have been phenomenal and excellent. &quot;From the beginning, they were 100% sure we would win this Ranji Trophy.&quot; Opening batter Shubham Pundir, who was named man of the match, scored 121 and Dogra (70) guided Jammu and Kashmir to a mammoth first-innings total of 584. Right-arm pacer Aaquib Nabi Dar, who was named p...",
    "url": "https://tribune.com.pk/story/2595044/jammu-and-kashmir-win-maiden-ranji-trophy",
    "published": "2026-02-28T11:04:33+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Jammu and Kashmir win maiden Ranji Trophy",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0590c90b8a9d6257",
    "title_original": "Bolivia’s military plane carrying banknotes crashes in capital city, at least 20 killed",
    "content_original": "Fire Chief Pavel Tovar did not clarify if the dead were in the plane or in the cars on the highway near the airport in La Paz",
    "url": "https://www.thehindu.com/news/international/cargo-plane-carrying-money-crashes-near-bolivias-capital-killing-at-least-15/article70686905.ece",
    "published": "2026-02-28T11:00:35+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Bolivia military plane crash kills at least 20 in La Paz",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "955be52e5eccad47",
    "title_original": "Trump directs US agencies to toss Anthropic’s AI as Pentagon calls startup a supply risk",
    "content_original": "US President Donald Trump said on Friday he is directing the government to stop work with Anthropic, and the Pentagon said it would declare the start-up a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown about technology guardrails. Trump added there would be a six-month phase-out for the Defence Department and other agencies that use the company’s products. If Anthropic does not help with the transition, Trump said, he would use “the Full Power of the Presidency to make them comply, with major civil and criminal consequences to follow”. The actions mark an extraordinary rebuke by the United States against one of the premier companies that has kept it in the lead on national security-critical AI, threatening to give Anthropic a pariah status that Washington until now had reserved for enemy suppliers. Google and Amazon are among Anthropic’s financial backers. The moves further set a precedent that US law alone would constrain how AI is deployed...",
    "url": "https://www.dawn.com/news/1976371/trump-directs-us-agencies-to-toss-anthropics-ai-as-pentagon-calls-startup-a-supply-risk",
    "published": "2026-02-28T10:58:59+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump directs US agencies to cut ties with Anthropic AI firm over Pentagon concerns",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "76e3629047f01a20",
    "title_original": "PCB secures biggest media rights deal for HBL PSL",
    "content_original": "The most expensive deal in HBL PSL history has been finalized. The four-year media rights have been sold to Walee Technologies for Rs 26 billion. The board will receive approximately Rs 6.5 billion annually. Walee is also the owner of the Pindi franchise. Matches are likely to be broadcast on the state-run television network. Three companies participated in the bidding process&mdash;two for broadcast rights and one solely for digital rights. Walee&rsquo;s combined bid amounted to Rs 26 billion, while the reserve price was set at Rs 23.5 billion (Rs 16.5 billion for TV and the remaining for live streaming). A private sports channel offered Rs 9 billion for TV rights only, while another company bid Rs 3.5 billion for digital rights. The PCB had recently issued an advertisement for the four-year PSL media rights, attracting several interested parties. Two major sports channels also intended to compete, but one allegedly had outstanding dues of Rs 470 million, while the other owed more tha...",
    "url": "https://tribune.com.pk/story/2595043/pcb-secures-biggest-media-rights-deal-for-hbl-psl",
    "published": "2026-02-28T10:57:36+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PCB secures biggest media rights deal for HBL PSL",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d24c5ab544e1d33a",
    "title_original": "Trump administration seeks delay in tariff refunds battle",
    "content_original": "The high court ruling last week marked a stunning rebuke of the President's signature economic policy, and opened the doors to what experts say will be a complicated, legally fraught refund process as importers sue for their money back",
    "url": "https://www.thehindu.com/news/international/trump-administration-seeks-delay-in-tariff-refunds-battle/article70687021.ece",
    "published": "2026-02-28T10:56:49+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump administration seeks delay in tariff refunds battle",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "4df551e309a7e11f",
    "title_original": "Paramount acquires Warner Bros. in $110 billion mega-merger",
    "content_original": "Paramount will pay $31.00 per share in cash for all outstanding Warner Bros. Discovery shares, implying an equity value of $81 billion — and $110 billion when including the debt Paramount will take on.",
    "url": "https://www.thehindu.com/news/international/warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall/article70685822.ece",
    "published": "2026-02-28T10:51:22+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Paramount acquires Warner Bros. in $110 billion mega-merger",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9d008c9171dca24a",
    "title_original": "ECC extends loan limit to Rs10m for Mera Ghar Mera Aashiana applicants",
    "content_original": "Federal Minister for Finance and Revenue Senator Muhammad Aurangzeb chairing a meeting of the Economic Coordination Committee of the Cabinet at the Finance Division in Islamabad on February 27, 2026. &mdash; X@FinancegovpkRs810m disbursed on 344 applications to date.Mark-up rate...",
    "url": "https://www.geo.tv/latest/653340-ecc-extends-loan-limit-to-rs10m-for-mera-ghar-mera-aashiana-applicants",
    "published": "2026-02-28T10:50:23+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "ECC extends loan limit to Rs10m for Mera Ghar Mera Aashiana applicants",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "212163935a7558f7",
    "title_original": "In-form Jacks savours 'Brook era'",
    "content_original": "Will Jacks hailed Harry Brook&rsquo;s impact as England&rsquo;s white‑ball captain after their four‑wicket win over New Zealand on Friday secured top spot in the Super Eight stage of the Twenty20 World Cup. Jacks delivered an all‑round performance, taking two wickets in four economical overs before adding a brisk 44‑run partnership with Rehan Ahmed in England&rsquo;s chase of 160, which they completed with three balls remaining. Asked whether England&rsquo;s recent form signalled a return to the &ldquo;Bazball&rdquo; style of play popularised by coach Brendon McCullum, Jacks instead pointed to Brook, who struck a 50‑ball century against Pakistan in their previous match to seal a semi‑final berth and again settled down the innings on Friday after England slipped to 2&ndash;2 early in the chase. &ldquo;I think this group is the era of Harry Brook. He is our white-ball captain,&rdquo; Jacks told reporters in Colombo. &ldquo;And I think that is something that we've been really focusing on....",
    "url": "https://tribune.com.pk/story/2595042/in-form-jacks-savours-brook-era",
    "published": "2026-02-28T10:50:17+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "England's Jacks praises Brook's impact in T20 World Cup victory",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "35411e4c292afd6d",
    "title_original": "Kerr says only '85 percent' fit for Women's Asian Cup",
    "content_original": "Australia captain Sam Kerr admitted Saturday she was still only &quot;85 percent&quot; fit leading into the Women's Asian Cup, but the Chelsea striker warned she was starting to hit her peak again. Kerr returned to club football for Chelsea in September in her first match since picking up a serious knee injury in December 2023. Being ready for the Asian Cup on home soil has been at the forefront of her mind and the 32-year-old will lead out Australia against the Philippines in Perth on Sunday in the opening game of the 12-team tournament. &quot;When you're out for so long, you have all this self-doubt creep in,&quot; said Kerr, who signed off with a goal against Manchester United in her final match before the Asian Cup. &quot;But I've had so many amazing people around me and I feel right at home with the Matildas, so it's a good place for me to settle back in and be myself,&quot; she added. &quot;I don't want to say I'm at 100 (percent) yet -- I haven't had one of those games yet where...",
    "url": "https://tribune.com.pk/story/2595041/kerr-says-only-85-percent-fit-for-womens-asian-cup",
    "published": "2026-02-28T10:43:07+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Sam Kerr says she is only '85 percent' fit for Women's Asian Cup",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7465f2171a9712e5",
    "title_original": "‘Very good' ties with Pakistan: Trump says US won't intervene in Islamabad-Kabul conflict",
    "content_original": "US President Donald Trump pumps his fist after disembarking Air Force One at Palm Beach International Airport in West Palm Beach, Florida, US, February 27, 2026. &mdash; ReutersFighting continues as Pakistan, Afghanistan enter in \"open war\".Trump stresses he has &ldquo;very good...",
    "url": "https://www.geo.tv/latest/653331-very-good-ties-with-pakistan-trump-says-us-wont-intervene-in-islamabad-kabul-conflict",
    "published": "2026-02-28T10:04:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump says US won't intervene in Pakistan-Afghanistan conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "US President Donald Trump announced that the US will not intervene in the escalating conflict between Pakistan and Afghanistan. This decision comes amid ongoing 'open war' between the two nations. The strategic significance lies in the potential regional instability and the implications for US interests in South Asia."
  },
  {
    "id": "93b9b82171ac7f37",
    "title_original": "Pakistan rejects ‘false’ claims of jet shot down in Nangarhar",
    "content_original": "The&nbsp;Ministry of Information and Broadcasting on Saturday dismissed as &ldquo;false&rdquo; reports circulated by Afghan Taliban officials and amplified by Indian media claiming that Afghan forces had shot down a Pakistani fighter jet in Nangarhar and captured its pilot. Videos were seen circulating on social media platforms, including X. 🚨🔴BIG BREAKING:- A Pakistani Pilot of F16 Fighter Jet...has been captured alive in Nangarhar province. pic.twitter.com/KxM7V2KCaY &mdash; THE UNKNOWN MAN (@Theunk5555) February 28, 2026 JUST IN 🇵🇰 🚨 Afghan forces have shot down another Pakistani regime fighter jet in Nangarhar Province today, marking the second aircraft brought down. pic.twitter.com/RlKLLucZBj &mdash; S Haidar Hashmi (@sHaidarHashmi) February 28, 2026 &nbsp; Pakistani security forces have launched &ldquo;Operation Ghazab Lil Haq,&rdquo; carrying out coordinated air and ground strikes against Afghan Taliban positions in Kabul, Kandahar, Paktia and Nangarhar, as well as several other...",
    "url": "https://tribune.com.pk/story/2595035/fact-check-pakistan-rejects-false-claims-of-jet-shot-down-in-nangarhar",
    "published": "2026-02-28T09:47:09+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan rejects claims of jet shot down in Nangarhar",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Ministry of Information and Broadcasting has denied reports by Afghan Taliban officials and amplified by Indian media that Afghan forces shot down a Pakistani F-16 fighter jet in Nangarhar and captured its pilot. This incident, if true, could escalate tensions between Pakistan and Afghanistan, with potential regional implications given the ongoing conflicts and geopolitical dynamics in the area."
  },
  {
    "id": "305c335564551c00",
    "title_original": "Labour red-faced, Reform cries foul as Greens claim key UK by-poll",
    "content_original": "A SCREENSHOT from the Greens’ Urdu language campaign video. LONDON: The Green Party of England and Wales secured a landmark victory in the Gorton and Denton by-election, overturning Labour’s 13,000-vote majority in a result that comes as a significant setback to Keir Starmer. Hannah Spencer, a local plumber and Green councillor, was elected as the party’s first MP in northern England after winning 14,980 votes in a tightly contested race. Reform UK came second with 10,578 votes, while Labour slumped to third place, finishing 5,616 votes behind the Greens, a dramatic 25.3 per cent drop in its vote share compared with 2024. Starmer, facing mounting questions over Labour’s campaign strategy, vowed to “keep on fighting” after what party insiders described as a humiliating defeat in a constituency long considered a Labour stronghold. Multilingual campaign Central to Spencer’s campaign was an unprecedented multilingual outreach effort aimed at engaging Gorton and Denton’s diverse electorate....",
    "url": "https://www.dawn.com/news/1976299/labour-red-faced-reform-cries-foul-as-greens-claim-key-uk-by-poll",
    "published": "2026-02-28T09:43:14+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Greens win UK by-election in Gorton and Denton, defeating Labour",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "97f32280aff5202c",
    "title_original": "UN terms violence against women ‘a global emergency’",
    "content_original": "GENEVA: The UN rights chief has decried mounting threats to women’s rights worldwide, highlighting rampant femicide and horrific abuse exposed in cases like that of US sex offender Jefferey Epstein. Addressing the United Nations Human Rights Council in Geneva, Volker Turk slammed “social systems that silence women and girls” and allow powerful men to abuse them with impunity. “Violence against women, including femicide, is a global emergency,” the High Commissioner for Human Rights told the UN’s top rights body. He highlighted the extreme situation in Afghanistan, warning that the “system of segregation imposed on women is reminiscent of apartheid, based on gender rather than race”. He also pointed to two cases that have recently caused shock waves around the world: those of convicted Epstein and of French rape survivor Gisele Pelicot. Both cases “show the extent of the exploitation and abuse of women and girls”, Turk said, asking: “does anyone think there are not many more men like Do...",
    "url": "https://www.dawn.com/news/1976343/un-terms-violence-against-women-a-global-emergency",
    "published": "2026-02-28T09:40:24+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UN terms violence against women ‘a global emergency’",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "48903513105b3999",
    "title_original": "UN chief Guterres deeply concerned by escalation of violence between Afghanistan and Pakistan",
    "content_original": "UN humanitarian officials are voicing concern over the impact of attacks in Afghanistan, including a reported incident at a transit and reception centre at the Torkham border crossing in the eastern part of Afghanistan",
    "url": "https://www.thehindu.com/news/international/un-chief-guterres-deeply-concerned-by-escalation-of-violence-between-afghanistan-and-pakistan/article70686967.ece",
    "published": "2026-02-28T09:11:55+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UN chief concerned by escalation of violence between Afghanistan and Pakistan",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "bdfba1fe7d8cf459",
    "title_original": "North Korea unveils image of Kim Jong Un’s daughter Kim Ju Ae firing rifle",
    "content_original": "The Kim family has ruled North Korea with an iron grip for decades, and a cult of personality surrounding their “Paektu bloodline” dominates daily life in the isolated country",
    "url": "https://www.thehindu.com/news/international/north-korea-unveils-image-of-kim-jong-uns-daughter-kim-ju-ae-firing-rifle/article70686932.ece",
    "published": "2026-02-28T08:52:55+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "North Korea releases image of Kim Jong Un’s daughter firing rifle",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d7ac5fe14453e0ae",
    "title_original": "Imaan, Hadi’s pleas against sentence adjourned",
    "content_original": "human rights lawyer Imaan Mazari (right) with her husband Hadi Ali Chattha during a court hearing.—AFP/file ISLAMABAD: The Islamabad High Court on Friday adjourned the hearing of applications seeking suspension of sentence filed by lawyer and rights activists Imaan Mazari and Hadi Ali Chat­tha in the controversial tweets case, as the defence pressed for an early date before Eid. Justice Muhammad Asif took up the matter amid a request from the state to transfer the appeal to another bench. During the proceedings, the assistant attorney general submitted that a case of similar nature had earlier been heard by Justice Azam Khan and reques­ted that the present appeal also be placed before his court. He argued that it would be appropriate for the same bench to hear related matters. Rights activists granted bail by anti-terrorism court in two other cases However, the counsel for the appellants, Advocate Riasat Ali Azad, opposed the request, maintaining that no such case was pending before an...",
    "url": "https://www.dawn.com/news/1976328/imaan-hadis-pleas-against-sentence-adjourned",
    "published": "2026-02-28T08:40:16+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Imaan, Hadi’s pleas against sentence adjourned",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d6d6090a9080a61b",
    "title_original": "China urges citizens to evacuate from Iran 'as soon as possible'",
    "content_original": "China's embassy in Israel, meanwhile, warned its citizens to remain highly vigilant, strengthen emergency preparedness, and avoid going out unless necessary",
    "url": "https://www.thehindu.com/news/international/china-urges-citizens-to-evacuate-from-iran-as-soon-as-possible/article70686882.ece",
    "published": "2026-02-28T08:24:18+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "China urges citizens to evacuate from Iran 'as soon as possible'",
    "relevant": true,
    "translated": true,
    "summary_en": "China has advised its citizens to evacuate Iran immediately, indicating concerns over escalating conflict and potential risks to Chinese nationals. The warning reflects the deteriorating security situation in Iran amid ongoing hostilities with the US. This development highlights the broader regional instability and potential for further escalation affecting non-combatant countries."
  },
  {
    "id": "08414d33c093ea11",
    "title_original": "Gold hits $5,278 an ounce after sharp increase",
    "content_original": "Gold and silver prices surged in global and local markets on Saturday. In the international bullion market, the price of gold per ounce jumped by $100 to reach $5,278. In the domestic market, the price of gold per tola increased by Rs10,000 to Rs540,562, while the price per 10 grams rose by Rs8,574 to Rs472,018. Silver prices also recorded an increase, with the rate per tola climbing by Rs388 to Rs9,862. The price of silver per 10 grams rose by Rs333 to Rs8,455. Read: SPI up 4.2% on flour, power rates On the other hand, Pakistan's short-term inflation, measured by the Sensitive Price Indicator (SPI), increased 4.23% year-on-year in the week ended February 26, 2026, reflecting continued pressure from food staples and energy costs despite recent weekly relief in perishable items. Official data released by the Pakistan Bureau of Statistics (PBS) showed that the annual SPI inflation was driven by sharp increases in wheat flour (29.51%), gas charges for Q1 (29.85%), electricity charges (17....",
    "url": "https://tribune.com.pk/story/2595030/gold-hits-5278-an-ounce-after-sharp-increase",
    "published": "2026-02-28T08:24:00+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Gold hits $5,278 an ounce after sharp increase",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f1922d08117934db",
    "title_original": "Trump tells U.S. government to ‘immediately’ stop using Anthropic AI tech",
    "content_original": "Anthropic insists its technology should not be used for the mass surveillance of U.S. citizens or deployed in fully autonomous weapons systems",
    "url": "https://www.thehindu.com/news/international/trump-tells-us-government-to-immediately-stop-using-anthropic-ai-tech/article70686878.ece",
    "published": "2026-02-28T08:23:48+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump calls for immediate halt to US government use of Anthropic AI tech",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "2a839d6b9b6f963b",
    "title_original": "Israeli strikes kill seven more Palestinians across Gaza",
    "content_original": "• Israel’s Supreme Court freezes ban on foreign aid organisations in enclave • US public sympathy shifts to Palestinians over Israel, new Gallup poll reveals CAIRO: Relentless Israeli attacks killed at least seven Palestinians in Gaza on Friday, medics said, adding to a death toll of at least 600 people killed by Israeli fire since a US-brokered ceasefire agreement came into effect last October. Gaza’s health officials reported that in southern Gaza, five people were killed and several others were injured, some critically, in Israeli drone strikes. The strikes targeted two police checkpoints in Khan Yunis and in the Abu Hujair area northwest of the Bureij refugee camp later in the day, medics said. Separately, an Israeli airstrike against a group of Palestinians in Gaza City’s Tuffah neighbourhood in northern Gaza killed two people and wounded several others. Ban on NGOs frozen Meanwhile, Israel’s Supreme Court decided in a ruling published on Friday to freeze a government ban on 37 fo...",
    "url": "https://www.dawn.com/news/1976304/israeli-strikes-kill-seven-more-palestinians-across-gaza",
    "published": "2026-02-28T07:58:15+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israeli strikes kill seven more Palestinians across Gaza",
    "relevant": true,
    "translated": true,
    "summary_en": "Israeli forces conducted drone strikes in Gaza, killing at least seven Palestinians and injuring several others, including critical casualties. The attacks targeted police checkpoints in Khan Yunis and the Abu Hujair area, escalating ongoing hostilities. This continues a trend of violence since the US-brokered ceasefire last October, with over 600 Palestinians reportedly killed by Israeli fire."
  },
  {
    "id": "14fe8411e6c41867",
    "title_original": "Donation boxes ‘escape’ action against illicit charities in Punjab",
    "content_original": "UNMARKED boxes can be used to violate rules on safe charity.—Dawn • Experts warn unregulated funds being channelled through anonymous collection boxes undermine NAP objectives • Official says ‘owners’ will be identified once seminaries registered with home department LAHORE: Despite the Punjab home department’s crackdown on illicit charities and the listing of 89 banned organisations, so-called “nameless donation boxes” continue to proliferate on street corners and electric poles, with their anonymous collectors leaving donors wondering who is really behind the appeals. These “nameless donation boxes”, physically secured with heavy chains and locks, can be spotted at road intersections, markets, shopping malls and banks across Punjab. Experts say billions of rupees in unregulated funds are being siphoned off under the guise of piety. They warn that this system has bypassed the core objectives of the National Action Plan, which was intended to dismantle the financial networks that fuel ...",
    "url": "https://www.dawn.com/news/1976345/donation-boxes-escape-action-against-illicit-charities-in-punjab",
    "published": "2026-02-28T07:54:31+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Donation boxes 'escape' action against illicit charities in Punjab",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "5fc0761a6bc31228",
    "title_original": "FBR forms committee to address taxpayers’ concerns",
    "content_original": "ISLAMABAD: Federal Board of Revenue (FBR) Chairman Rashid Mah­mood Langrial has constituted a committee to add­ress taxpayers’ issues following a meeting at the FBR Headquarters with representatives of the Pakis­tan, Lahore, Karachi, and Rawalpindi-Islam­abad tax bar associations. An official statement said members of the Tax Bar Associations apprised the chairman of the challenges being faced by taxpayers, particularly in relation to the super tax and SRO 350(I)/2024. Mr Langrial assured participants that the FBR remains fully committed to facilitating taxpayers and addressing all genuine concerns on a priority basis. To ensure timely resolution, he announced the formation of a committee to examine the issues raised by the tax bar associations and propose practical solutions for their early redress. Operations, policy and legal members of FBR’s Inland Revenue wing also attended the meeting and took part in detailed deliberations. Appreciating the consultative role of the tax bar assoc...",
    "url": "https://www.dawn.com/news/1976347/fbr-forms-committee-to-address-taxpayers-concerns",
    "published": "2026-02-28T07:51:10+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "FBR forms committee to address taxpayers’ concerns",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f68d4560af2264d5",
    "title_original": "Written reasons must for offloading passengers, rules LHC",
    "content_original": "• LHC says absence of record undermines transparency • Law officer hints at review mechanism for offloading LAHORE: The Lahore High Court (LHC) has ruled that immigration authorities must record and communicate written reasons in every case where a passenger is offloaded from an international flight, holding that such action, though preventive, must comply with constitutional safeguards of due process. Justice Raheel Kamran announced the judgment while deciding two identical petitions filed by Muhammad Soban and Ali Raza against the federal government. The petitioners were off­loaded on Dec 24, 2025, from the Allama Iqbal Inter­national Airport, Lahore, while attempting to travel to Kuala Lumpur, Malaysia, on valid visit visas. They contended that they possessed valid passports, return tickets, confirmed hotel bookings, and that no criminal case, blacklist order or placement on the Exit Control List (ECL) existed against them. Through their counsel, they argued that the offloading was ...",
    "url": "https://www.dawn.com/news/1976348/written-reasons-must-for-offloading-passengers-rules-lhc",
    "published": "2026-02-28T07:47:03+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "LHC Requires Written Reasons for Passenger Offloading",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "c120bcb56a5cc6c5",
    "title_original": "Taliban now ‘amenable to talks’ as world urges de-escalation",
    "content_original": "• Qatar, Saudi Arabia lead diplomatic scramble; Iran offers to facilitate talks • Trump ‘refuses’ to intervene because of ‘fondness’ for Pakistan • UN, China, Russia, UK call for immediate ceasefire ISLAMABAD: Afghanistan’s Taliban rulers said on Friday they were willing to negotiate after Pakistan unleashed air strikes on major Afghan cities, killing dozens in the most serious clashes between the allies-turned-foes, which Defence Minister Khawaja Asif described as an “open war”. The Afghan Taliban, who claimed to have launched “retaliatory attacks” over strikes against terrorists’ hideouts last weekend, said on Friday that they were “ready for dialogue”. “Afghanistan… has always preferred to reso­lve issues based on mutual understanding and respect,” the Afghan foreign ministry quoted Foreign Minister Amir Khan Muttaqi as telling Qatar’s junior Foreign Minister Mohammed bin Abdulaziz Al-Khalifi by telephone. Taliban spokesperson Zabihullah Mujahid echoed that sentiment, saying “now al...",
    "url": "https://www.dawn.com/news/1976349/taliban-now-amenable-to-talks-as-world-urges-de-escalation",
    "published": "2026-02-28T07:39:12+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Taliban now ‘amenable to talks’ as world urges de-escalation",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ae8c931a28f247be",
    "title_original": "In Friday sermon, Mirwaiz expresses concern over ‘worrying’ situation in Palestine, Iran, Afghanistan",
    "content_original": "He expressed concern over what he described as “breakdown of international law and the moral conscience of the international community” in Palestine.",
    "url": "https://www.thehindu.com/news/national/in-friday-sermon-mirwaiz-expresses-concern-over-worrying-situation-in-palestine-iran-afghanistan/article70685440.ece",
    "published": "2026-02-28T07:28:38+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Mirwaiz expresses concern over situation in Palestine, Iran, Afghanistan",
    "relevant": true,
    "translated": true,
    "summary_en": "Mirwaiz, in a Friday sermon, voiced concerns about the deteriorating situation in Palestine, Iran, and Afghanistan, highlighting the breakdown of international law and moral conscience. This is relevant as it reflects broader regional instability and potential implications for the ongoing conflicts involving Iran and its neighbors."
  },
  {
    "id": "652b68f563088903",
    "title_original": "Trump directs US agencies to toss Anthropic's AI as Pentagon calls startup a supply risk",
    "content_original": "US President Donald Trump said on Friday he is directing the government to stop work with Anthropic, and the Pentagon said it would declare the start-up a supply-chain risk, dealing a major blow to the artificial intelligence lab after a showdown over technology guardrails. Trump added there would be a six-month phase-out for the Department of Defence and other agencies that use the company&rsquo;s products. If Anthropic does not help with the transition, Trump said, he would use &ldquo;the full power of the presidency to make them comply, with major civil and criminal consequences to follow&rdquo;. The actions mark an extraordinary rebuke by the United States against one of the premier companies that has kept it in the lead on national security-critical AI, threatening to give Anthropic pariah status that Washington until now had reserved for hostile suppliers. Alphabet&rsquo;s Google and Amazon are among Anthropic&rsquo;s financial backers. The moves further set a precedent that US l...",
    "url": "https://tribune.com.pk/story/2595026/trump-directs-us-agencies-to-toss-anthropics-ai-as-pentagon-calls-startup-a-supply-risk",
    "published": "2026-02-28T07:23:34+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump orders US agencies to cut ties with Anthropic AI firm over Pentagon concerns",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "bfc3f981bbf0c05b",
    "title_original": "Bill Clinton denies wrongdoing at grilling on Epstein ties",
    "content_original": "Former U.S. President has acknowledged extensive interactions with Epstein but said he never visited the financier’s infamous private Caribbean island.",
    "url": "https://www.thehindu.com/news/international/i-saw-nothing-and-i-did-nothing-wrong-bill-clinton-testifies-to-us-congress-committee-about-epstein/article70685635.ece",
    "published": "2026-02-28T07:08:44+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Bill Clinton denies wrongdoing regarding Epstein ties",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "3589c2c5eb48df77",
    "title_original": "Trump says he’s ‘not happy’ with Iran nuclear talks but awaits further rounds",
    "content_original": "Tensions between the United States and Iran remain high after their latest nuclear talks in Geneva on Thursday failed to reach and breakthrough, and as American forces gather in the region.",
    "url": "https://www.thehindu.com/news/international/trump-says-hes-not-happy-with-iran-nuclear-talks-but-awaits-further-rounds/article70685815.ece",
    "published": "2026-02-28T07:04:14+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump says he’s ‘not happy’ with Iran nuclear talks but awaits further rounds",
    "relevant": true,
    "translated": true,
    "summary_en": "Former US President Trump expressed dissatisfaction with the recent nuclear talks with Iran in Geneva, which failed to achieve a breakthrough. The ongoing tensions and buildup of American forces in the region indicate potential escalation risks, directly linked to the ongoing US-Iran conflict."
  },
  {
    "id": "20ded58fc37ac875",
    "title_original": "Iran targets US bases in Bahrain, Qatar, Kuwait and UAE after American, Israeli strikes",
    "content_original": "Iran&rsquo;s Revolutionary Guards said on Saturday that a first wave of retaliatory missile and drone attacks had been launched against Israel, warning that all US bases and interests in the region were within Iran&rsquo;s reach, an Iranian official told Reuters. Explosions were reported in Kuwait, the United Arab Emirates, Bahrain and Qatar. Bahrain said the service centre of the US Fifth Fleet had been subjected to a missile attack. Video footage from witnesses in Bahrain showed a thick grey plume of smoke rising from near the small island state&rsquo;s coastline as sirens wailed. More footage of Iran's reported attack on US Navy's Naval Support Activity (NSA) in Bahrain pic.twitter.com/EKWXLWgeBI &mdash; Press TV 🔻 (@PressTV) February 28, 2026 At least half a dozen witnesses, including Reuters correspondents, heard loud booms in various parts of the UAE capital Abu Dhabi, a major oil producer and close US ally. Explosions in Abu Dhabi 📍 pic.twitter.com/Q84vd8sqnv &mdash; Ihtisham Ul...",
    "url": "https://tribune.com.pk/story/2595024/israel-launches-preventative-attack-against-iran-defence-minister-says",
    "published": "2026-02-28T06:32:20+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran targets US bases in Bahrain, Qatar, Kuwait, and UAE after American and Israeli strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Revolutionary Guards launched a retaliatory wave of missile and drone attacks targeting US bases in Bahrain, Qatar, Kuwait, and the UAE following American and Israeli strikes on Iran. Explosions were reported in multiple Gulf states, with Bahrain confirming a missile attack on the US Fifth Fleet's service center. This escalation signifies a significant expansion of the conflict's geographic scope and direct targeting of US military assets in the region."
  },
  {
    "id": "d7347cbe77fdcbe8",
    "title_original": "What ‘Ghazab Lil Haq’ means and why Pakistan chose the name for its Afghanistan operation",
    "content_original": "Pakistani security forces have launched &ldquo;Operation Ghazab Lil Haq,&rdquo; carrying out coordinated air and ground strikes against Afghan Taliban positions in Kabul, Kandahar, Paktia and Nangarhar, as well as several other locations, following what officials described as unprovoked cross-border aggression. The development comes as the military said Pakistan has &ldquo;effectively repulsed&rdquo; Afghan Taliban insurgents at 53 locations along the border, inflicting heavy losses while exercising restraint to avoid civilian harm. Meaning behind the name During the Pak-Afghan conflict, Pakistan named the latest military action Operation Ghazab Lil Haq. The phrase is understood to mean &ldquo;Wrath for the Truth&rdquo; or &ldquo;Fury for the sake of justice,&rdquo; reflecting what officials describe as a forceful response to aggression. Over the past two decades, most operations conducted by the Pakistan Army have been named after Arabic or religious terminology, partly to provide the...",
    "url": "https://tribune.com.pk/story/2595023/what-ghazab-lil-haq-means-and-why-pakistan-chose-the-name-for-its-afghanistan-operation",
    "published": "2026-02-28T06:19:54+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan launches 'Operation Ghazab Lil Haq' against Afghan Taliban",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistani security forces have initiated coordinated air and ground strikes targeting Afghan Taliban positions in multiple provinces, including Kabul and Kandahar, following alleged cross-border aggression. The operation has reportedly repulsed Taliban insurgents at 53 border locations, inflicting significant casualties while attempting to minimize civilian harm. This development signifies escalating tensions and conflict between Pakistan and the Afghan Taliban."
  },
  {
    "id": "c13fddde1ba16544",
    "title_original": "Pakistan says 331 Taliban terrorists killed in cross-border operation in Afghanistan",
    "content_original": "Pakistan said on Saturday that its forces had killed 331 Taliban terrorists in a major military operation launched after what it described as unprovoked cross-border attacks from Afghanistan, as regional and global powers urged restraint amid rising tensions. The government said &ldquo;Operation Ghazab-lil-Haq&rdquo; was launched late on Thursday following renewed clashes along the Pakistan-Afghanistan border. In a statement posted on X, Information Minister Attaullah Tarar said that as of 9am on Saturday, at least 331 Afghan Taliban, Tehreek-e-Taliban Pakistan (TTP) fighters and other terrorists had been killed, with more than 500 wounded. Operation Ghazb lil Haq Update 0900 hours 28 Feb ✅*Summary of Afg Taliban losses* ▪️331 Killed, ▪️500 + Injured, ▪️104 Check posts destroyed, ▪️22 Post Captured, ▪️163 Tanks and Armed vehs Destroyed ▪️37 Locs across Afg eff tgt by air &mdash; Attaullah Tarar (@TararAttaullah) February 28, 2026 He said Pakistani forces destroyed 104 Taliban posts, se...",
    "url": "https://tribune.com.pk/story/2595020/pakistan-says-331-taliban-terrorists-killed-in-cross-border-operation-with-afghanistan",
    "published": "2026-02-28T05:01:55+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan kills 331 Taliban terrorists in cross-border operation in Afghanistan",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's military conducted 'Operation Ghazab-lil-Haq' in response to cross-border attacks from Afghanistan, resulting in the deaths of 331 Taliban and TTP fighters. The operation highlights ongoing tensions and instability along the Afghanistan-Pakistan border, with potential regional security implications."
  },
  {
    "id": "9bff698ddeaf870e",
    "title_original": "Asif accuses Haqqani Network of betrayal, demands clarity on Pakistan support",
    "content_original": "Defence Minister Khawaja Muhammad Asif has publicly accused figures linked to the Haqqani Network of betraying decades of Pakistani support and allowing terrorists to operate from Afghan territory against Pakistan. In a post on X, Asif recalled Pakistan&rsquo;s backing of Afghan fighters during the Soviet-Afghan war after the 1979 invasion by the Soviet Union. He said Pakistan had stood &ldquo;wholeheartedly&rdquo; with Afghan resistance leaders and hosted millions of refugees, many of whom still live and work in Pakistan. &ldquo;You were our guests; we extended hospitality to your families,&rdquo; he wrote. &ldquo;Millions of those guests are still on Pakistani soil, earning their livelihood.&rdquo; حقانی صاحب آپکی ماضی کی جنگوں میں سوویت یونین کے خلاف پاکستان دل وجان کے ساتھ آپکے ساتھ کھڑا تھا ۔ آپ ھمارے مہمان رہے آپکے خاندانوں کی دھائیاں مہمانداری کی۔ تب کے لاکھوں مہمانوں میں لاکھوں ابھی بھی پاک سر زمین پہ پناہ گزین ھیں۔ ھماری پاک مٹی سے رزق کماتے ھیں۔ آپ بھی بمعہ&hellip; https://t....",
    "url": "https://tribune.com.pk/story/2595019/asif-accuses-haqqani-network-of-betrayal-demands-clarity-on-pakistan-support",
    "published": "2026-02-28T04:59:23+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Asif accuses Haqqani Network of betrayal, demands clarity on Pakistan support",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b88c87a11a82b1ab",
    "title_original": "Iran designated as a state sponsor of wrongful detention, says Rubio",
    "content_original": "“The ‌Iranian ⁠regime must ⁠stop taking hostages and release all Americans unjustly ​detained in ‌Iran, steps that could end this designation and associated ‌actions,” Mr. Rubio said ​in a statement.",
    "url": "https://www.thehindu.com/news/international/iran-designated-as-a-state-sponsor-of-wrongful-detention-says-rubio/article70686012.ece",
    "published": "2026-02-28T03:12:15+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran designated as a state sponsor of wrongful detention by US Senator Rubio",
    "relevant": true,
    "translated": true,
    "summary_en": "US Senator Rubio announced that Iran has been designated as a state sponsor of wrongful detention, urging Iran to release all Americans unjustly held. This designation and associated actions could be lifted if Iran complies. The move is significant as it escalates diplomatic pressure on Iran amidst ongoing hostilities."
  },
  {
    "id": "5bbd2fba8422b8e7",
    "title_original": "Asif says Kabul repaid Pakistan's long hospitality by hosting those who kill its citizens",
    "content_original": "Defence Minister Khawaja Asif addresses a press conference in this undated photo.&mdash; PID/File Asif urges Afghanistan not to allow militants to operate against Pakistan.Says Pakistan hosted Haqqani and millions of Afghan refugees for decades.Recalls Pakistan&rsquo;s...",
    "url": "https://www.geo.tv/latest/653319-asif-says-afghanistan-repaid-pakistans-hospitality-by-hosting-those-who-kill-its-citizens",
    "published": "2026-02-28T02:56:10+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan's Defence Minister criticizes Afghanistan for hosting militants targeting Pakistan",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Defence Minister Khawaja Asif accused Afghanistan of repaying Pakistan's hospitality by harboring militants who attack Pakistani citizens. He highlighted Pakistan's past support for Afghan refugees and groups like the Haqqani network. The statement underscores regional tensions and Pakistan's concerns over cross-border militancy."
  },
  {
    "id": "a684b476f7cf5e89",
    "title_original": "Dar warns against de facto annexation in West Bank",
    "content_original": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Friday urged the international community and Muslim countries to take collective and decisive action to halt Israeli settlement expansion and annexation attempts in the occupied Palestinian territories. Addressing the extraordinary open-ended ministerial session of the Organisation of Islamic Cooperation (OIC) Executive Committee in Jeddah, Dar warned that Israel&rsquo;s continued violations were threatening prospects for a lasting peace in the Middle East. He said the Palestinian cause remained a central concern of the Muslim Ummah and stressed that Israeli actions in the occupied West Bank posed serious challenges to international law, the UN Charter and the multilateral global system. Dar appreciated the efforts of The Gambia, Turkiye, Saudi Arabia and the State of Palestine for convening the session to address illegal Israeli measures aimed at accelerating settlement expansion and imposing sovereignty over occupied Palestinian...",
    "url": "https://tribune.com.pk/story/2595014/dar-warns-against-de-facto-annexation-in-west-bank",
    "published": "2026-02-28T02:31:17+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dar warns against de facto annexation in West Bank",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "086f9c67edd2d365",
    "title_original": "Relentless reckoning for Taliban",
    "content_original": "In a dramatic escalation along the volatile western frontier, Pakistan on Friday said it had carried out &quot;precise and heavy&quot; retaliatory operations inside Afghanistan, using massive airpower to bomb military bases, ammunition depots and other installations after what it described as repeated cross-border terrorist attacks and the latest &quot;provocative military actions&quot; by the Taliban regime. Islamabad said it inflicted massive losses on Afghan regime troops and allied terrorist networks in retaliatory strikes that mark one of the gravest confrontations between the two neighbors since 2021. The military said the flare-up followed coordinated cross-border attacks and raids carried out by Afghan Taliban forces in collusion with the banned Tehreek-e-Taliban Pakistan (TTP), triggering a forceful and &quot;measured&quot; response from the armed forces. Addressing a news conference, Director General Inter-Services Public Relations (ISPR) Lt Gen Ahmed Sharif Chaudhry revealed...",
    "url": "https://tribune.com.pk/story/2595007/relentless-reckoning-for-taliban",
    "published": "2026-02-28T01:35:25+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan launches heavy retaliatory strikes against Taliban in Afghanistan",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan conducted 'precise and heavy' retaliatory operations inside Afghanistan using massive airpower, targeting military bases, ammunition depots, and installations in response to repeated cross-border terrorist attacks and 'provocative military actions' by the Taliban. The strikes inflicted significant losses on Afghan regime troops and allied terrorist networks, marking one of the gravest confrontations between the two neighbors since 2021."
  },
  {
    "id": "03fc283fa83740c9",
    "title_original": "Asif declares 'open war' with Taliban regime",
    "content_original": "Defence Minister Khawaja Muhammad Asif on Friday declared an &quot;all-out confrontation&quot; with the Taliban regime, posting on X: &quot;Now it is open war between us and you.&quot; The comments came as the armed forces silenced enemy guns along the border. The operation was Pakistan's most widespread bombardment of the Afghan capital and its first air strikes on the southern power base of the Taliban authorities since they returned to power in 2021. The defence minister struck the hardest tone, warning Afghanistan's Taliban leadership that Pakistan's patience had run out and that there would now be open war between the two neighbours. &quot;We know the standing of our neighbour [Afghanistan]. We are your neighbours and we know your capability,&quot; he said, adding that &quot;our patience has limits - now there will be an open war,&quot; he wrote in a post on social media. The defence minister stressed that the Pakistan Army was not a force that had come &quot;from across the seas&...",
    "url": "https://tribune.com.pk/story/2595008/asif-declares-open-war-with-taliban-regime",
    "published": "2026-02-28T01:35:25+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan's Defence Minister declares 'open war' with Taliban regime",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Defence Minister Khawaja Muhammad Asif announced an 'all-out confrontation' with the Taliban regime, marking the first air strikes on the Taliban's southern power base since 2021. This escalation follows widespread border operations and signifies a significant deterioration in Pakistan-Taliban relations, with potential regional security implications."
  },
  {
    "id": "7cc505f1052058d5",
    "title_original": "Hours-long blasts rock Kabul after depot strike",
    "content_original": "Pakistani air strikes struck Taliban's military installations in major urban centres of Afghanistan as part of &quot;Operation Ghazab Lil Haq&quot; launched in response to &quot;unprovoked and miscalculated&quot; attacks on Pakistani border posts on Thursday. Taliban regime officials confirmed air raids deep inside Afghanistan &mdash; as far as capital Kabul, but they would downplay their losses. Kabul residents, however, reported that they heard secondary explosions for hour that rattled homes across the Afghan capital. Video verified by Reuters showed thick plumes of black smoke rising above Darulaman, a residential neighbourhood in western Kabul that also houses several government and military compounds, as a fire engulfed part of the depot and repeated flashes lit up the night sky when ammunition ignited inside. Residents said the bombardment began shortly after midnight. &quot;We were asleep when we heard the sound of a plane,&quot; said Tamim, a taxi driver who lives near the dep...",
    "url": "https://tribune.com.pk/story/2595011/hours-long-blasts-rock-kabul-after-depot-strike",
    "published": "2026-02-28T01:35:25+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani air strikes target Taliban military installations in Kabul and other Afghan cities",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan launched air strikes on Taliban military installations in Kabul and other major Afghan cities as part of 'Operation Ghazab Lil Haq' in response to attacks on Pakistani border posts. The strikes reached as far as Kabul, causing secondary explosions that were heard across the city. This escalation highlights ongoing tensions and conflict between Pakistan and the Taliban regime."
  },
  {
    "id": "54ad6ae67339af29",
    "title_original": "World appeals for calm amid escalation",
    "content_original": "Friendly nations and global leaders on Friday urged calm between Pakistan and Afghanistan following overnight border clashes and Pakistan's punitive retaliatory action against Kabul that killed hundreds of Taliban operatives and destroyed their several check posts. Top diplomats from several countries took to social media urging restraint, dialogue and adherence to international law, while Foreign Minister Ishaq Dar reached out to his counterparts from key regional partners to brief them on the unfolding situation. Pakistan launched operation Ghazab Lil Haq soon after Taliban attacked Pakistani posts along the Pakistan-Afghanistan border at several places. In retaliation, troops beat back the Taliban attackers, and later Pakistan Air Force (PAF) blitzkrieg hit and destroyed several targets. According to Foreign Office, Deputy Prime Minister and Foreign Minister Ishaq Dar had a telephone call with Egyptian Foreign Minister Dr Badr Abdelatty and underlined that Pakistan's response to unp...",
    "url": "https://tribune.com.pk/story/2595010/world-appeals-for-calm-amid-escalation",
    "published": "2026-02-28T01:35:25+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "World appeals for calm amid escalation between Pakistan and Afghanistan",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d2c9f00ef515cb12",
    "title_original": "Govt, opposition open formal channel",
    "content_original": "After months of political stalemate, the federal government and the opposition alliance on Friday established their first formal contact in a bid to initiate the negotiation process, signalling a tentative shift from confrontation toward engagement. Federal ministers and Opposition Leader Mahmood Khan Achakzai met Prime Minister's Adviser Rana Sanaullah and Minister for Parliamentary Affairs Tariq Fazal Chaudhry at Parliament House. Senior PML-N leaders urged the opposition to move forward with political understanding and dialogue. According to sources, the prime minister himself will respond to the opposition's agenda points and conditions. Sources further said that Achakzai will present his concerns and reservations directly to the prime minister. He has also expressed his desire to meet the founder of PTI. Opposition alliance Tehreek-e-Tahafuz-e-Aain Pakistan spokesperson Akhunzada Hussain Yousafzai confirmed the development to The Express Tribune, stating that the meeting focused o...",
    "url": "https://tribune.com.pk/story/2595003/govt-opposition-open-formal-channel",
    "published": "2026-02-28T00:56:29+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Govt, opposition open formal channel",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7d596cf9c75ebf6b",
    "title_original": "SC office returns Imran hospital transfer plea",
    "content_original": "The Supreme Court Registrar's Office has returned a miscellaneous application seeking former prime minster Imran Khan's transfer from Adiala Jail to Shifa International Hospital in view of his deteriorating health conditions, after raising objections. The Registrar's Office pointed out that in its February 12 order, the SC had clearly directed the petitioner to seek appropriate relief from the Islamabad High Court (IHC). It noted that the Toshakhana criminal case involving the PTI founder is already pending before the high court. The objections further stated that the miscellaneous application was not filed through an Advocate-on-Record, as required under the Supreme Court Rules 2025. Applications filed without an Advocate-on-Record are not maintainable. Consequently, the plea was returned. Earlier on Friday, PTI lawyers, including Latif Khosa and Naeem Panjutha, appeared before a bench led by Chief Justice of Pakistan (CJP) Yahya Afridi and requested that their request for Imran's tra...",
    "url": "https://tribune.com.pk/story/2595002/sc-office-returns-imran-hospital-transfer-plea",
    "published": "2026-02-28T00:56:29+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "SC rejects Imran Khan's hospital transfer plea",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9871aef526fd83f7",
    "title_original": "FBR misses revised target by Rs450b",
    "content_original": "The federal government's tax shortfall has jumped to Rs450 billion against the downward revised target for the first eight months of this fiscal year, increasing the prospects of a second revision amid the International Monetary Fund (IMF)'s view that the tax base cannot be broadened soon. Till the last working day, the Federal Board of Revenue (FBR) pooled little under Rs8.1 trillion in taxes for the July-February period of fiscal year 2025-26. The collection was Rs450 billion below even the downward revised target. Against the original target, the shortfall was as high as Rs670 billion, showcasing the tax machinery's weak performance this fiscal year despite securing additional fiscal incentives. The government had initially set the FBR's target at Rs14.13 trillion, which was lowered by Rs216 billion after the second review talks. Sources said the FBR has made another proposal for a substantial reduction in the target, which will be taken up with the IMF next week. The government has...",
    "url": "https://tribune.com.pk/story/2594986/fbr-misses-revised-target-by-rs450b",
    "published": "2026-02-28T00:16:40+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "FBR misses revised tax collection target by Rs450 billion",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "cebaffb3810550fb",
    "title_original": "Economy may stay weak for 6 months",
    "content_original": "A majority of Pakistanis do not have hopes for an improvement in economic conditions over the next six months and 84% of respondents are less confident about making investments, reveals a new wave of Ipsos survey. The findings of the latest survey reflect the views expressed by multinational companies working in Pakistan during a meeting with the International Monetary Fund, where they sought predictability and consistency in economic policies for doing business. Only one in four Pakistanis believes the economy is strong and that opinion too is concentrated mostly in Punjab and among 30-year-old youth, shows the survey. About 23% of respondents believe the economy is strong while 60% say it is weak, reflecting the ground realities where poverty is on the rise and only a few people are benefiting from the economy. Ipsos said that although only one out of four Pakistanis termed the economy strong, the situation was far better than in early 2024, when hardly 4% saw the economy getting str...",
    "url": "https://tribune.com.pk/story/2594991/economy-may-stay-weak-for-6-months",
    "published": "2026-02-28T00:16:40+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Economy may stay weak for 6 months",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "3b997de3afc2f93b",
    "title_original": "Afghanistan conflict weighs on PSX",
    "content_original": "The Pakistan Stock Exchange (PSX) ended Friday's session on a weaker note as geopolitical tensions with Afghanistan triggered early selling, pulling the benchmark KSE-100 index down by 831 points to close at 168,062. The index had plunged as much as 3,081 points intra-day after reports that Pakistan targeted terrorist outfits and their logistical support bases in Afghanistan, before trimming losses later in the day. Heavyweight stocks, particularly United Bank, Fauji Fertiliser, Oil and Gas Development Company, Pakistan Petroleum and MCB Bank, drove the bulk of the decline, cumulatively shaving 658 points off the index. At the close of trading, the benchmark KSE-100 index posted a decline of 830.92 points, or 0.49%, and settled at 168,062.17. Topline Securities, in its market review, noted that the KSE-100 opened on a negative note and declined to the intra-day low of -3,081 points (-1.82%). The negativity can be attributed to regional tension with Afghanistan, where Pakistan carried o...",
    "url": "https://tribune.com.pk/story/2594994/afghanistan-conflict-weighs-on-psx",
    "published": "2026-02-28T00:16:40+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Afghanistan conflict impacts Pakistan Stock Exchange",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0404a28da27f388b",
    "title_original": "Strong tremors jolt Kolkata, adjoining districts",
    "content_original": "The epicentre was roughly around 90 km from Kolkata at the Bangladesh border; damage reported to buildings in some areas",
    "url": "https://www.thehindu.com/news/international/magnitude-54-earthquake-strikes-bangladesh-tremors-felt-in-kolkata-adjacent-wb-districts/article70683234.ece",
    "published": "2026-02-27T22:55:27+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Strong tremors jolt Kolkata, adjoining districts",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b6362e1420fc411c",
    "title_original": "T20 World Cup: Ahmed, Jacks blast England to thrilling win over New Zealand, keeping Pakistan’s slender hopes alive",
    "content_original": "Rehan Ahmed and Will Jacks smashed 44 off 16 balls to take England to a thrilling four-wicket T20 World Cup win in Colombo that denied New Zealand a guaranteed place in the semi-finals but kept Pakistan’s slender hopes alive. New Zealand would have joined England in the knockouts with a win in their final Super Eights match and they scored 159-6 after opting to bat. England lost wickets early and looked like they would be squeezed out at 117-6, needing 43 from the last three overs. But Ahmed and Jacks took 22 off the 18th over from Glenn Phillips to turn the match on its head. Ahmed blasted 19 off seven balls in his first T20 World Cup match alongside Jacks, who made an unbeaten 32 off 18, to see England to 161-6 with three balls to spare. England will move on to a semi-final in Mumbai on Thursday against either India or the West Indies, who clash on Sunday to decide the final semi-final berth. New Zealand now have to wait on the outcome of Saturday’s clash between Sri Lanka and Pakist...",
    "url": "https://www.dawn.com/news/1976207/t20-world-cup-ahmed-jacks-blast-england-to-thrilling-win-over-new-zealand-keeping-pakistans-slender-hopes-alive",
    "published": "2026-02-27T22:46:40+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "T20 World Cup: England defeats New Zealand, keeping Pakistan's hopes alive",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "07d6439a36493b2a",
    "title_original": "Sehri call: Karachi drummer keeps tradition alive, wins hearts",
    "content_original": "As the night deepens in Ramazan and much of the city falls silent, a steady beat still echoes through a cluster of streets in Karachi the rhythmic thud of a drum. From Nipa to Gulshan, residents have come to recognise that sound as the mark of one man: Muhammad Chand. For the past 10 to 12 years, he has walked these streets before dawn, waking families for 'suhoor', the pre-fast meal. &quot;I have been doing this for the last 10 to 12 years. By the grace of God, it makes me happy,&quot; he says. &quot;When I wake people up in the morning, it brings joy to my heart.&quot; Each night during Ramazan, he leaves his home at around 03:00 and spends nearly an hour moving through different lanes, beating his drum. &quot;I go from Nipa to Gulshan, through all the streets,&quot; he explains. &quot;I just play the drum, I don't knock on doors.&quot; For Mohammad Chand, this is more than seasonal work. It is a family tradition. &quot;I am continuing this from my father's side,&quot; he says with p...",
    "url": "https://tribune.com.pk/story/2594979/sehri-call-karachi-drummer-keeps-tradition-alive-wins-hearts",
    "published": "2026-02-27T22:45:14+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Karachi drummer keeps Ramadan tradition alive",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9e430debdc3a3f2a",
    "title_original": "Fashion industry's darker side emerges during Milan Fashion Week",
    "content_original": "Artisans in white coats greeted guests at the Tod's fashion show in Milan Friday, crafting the Made in Italy leather and needlework items for which the company &mdash;&nbsp;and country &mdash;&nbsp;is renowned. But despite that display of handcraft, there has been little mention at Milan Fashion Week of some of the industry's forgotten workers &mdash;&nbsp;whom prosecutors found were working in sweatshop conditions at subcontractors for many Italian luxury brands, including Tod's. With the glamorous catwalks, celebrities and excess of finery on display, the possibility of the recent investigations uncovering labour abuses being on anyone's mind appeared slim. After the show, Tod's founder and chairman Diego Della Valle told AFP the company's decision to highlight its artisanal heritage was in no way linked to the recent investigations. &quot;No controversy &mdash;&nbsp;I think we'll do good things together with the courts and trade associations. I think we're on the right track,&quot; ...",
    "url": "https://tribune.com.pk/story/2594982/fashion-industrys-darker-side-emerges-during-milan-fashion-week",
    "published": "2026-02-27T22:45:14+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fashion industry's darker side emerges during Milan Fashion Week",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d9ceed10736237bb",
    "title_original": "US plaintiff blames social media for her 'addiction'",
    "content_original": "The plaintiff in a blockbuster social media trial in Los Angeles took the stand Thursday, telling the jury that she could not control her use of YouTube and Instagram as a child. &quot;I was at a young age and I would spend all my time on it,&quot; Kaley G.M., a 20-year-old California resident, testified when asked to explain why she thought she was addicted to YouTube. &quot;Anytime I tried to separate myself from it, it just didn't work,&quot; she added. And even if she was bullied on Instagram, she still stayed on the app. &quot;If I was off, I would just feel like I was missing out.&quot; In the highly anticipated testimony, Kaley G.M. took questions from her lawyer, who sought to paint a picture of an emotionally fragile user who was ensnared as a child to increase her use of YouTube and Instagram. The landmark trial is expected to last until late March, when the jury will decide whether Meta, which owns Instagram, and Google-owned YouTube, bear responsibility for knowingly design...",
    "url": "https://tribune.com.pk/story/2594984/us-plaintiff-blames-social-media-for-her-addiction",
    "published": "2026-02-27T22:45:14+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US plaintiff blames social media for her 'addiction'",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0d44656704488ad6",
    "title_original": "Jailed PKK leader says laws needed in Türkiye peace process",
    "content_original": "Abdullah Ocalan’s call could be taken to endorse a road map, approved last ​week by a Turkish parliamentary ‌commission, that urges legal reforms to run alongside the PKK’s disarmament",
    "url": "https://www.thehindu.com/news/international/jailed-pkk-boss-says-laws-needed-in-turkiye-peace-process/article70685050.ece",
    "published": "2026-02-27T22:11:40+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Jailed PKK leader calls for laws in Türkiye peace process",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b945160ddede0174",
    "title_original": "U.S. military used laser to take down Border Protection drone, say lawmakers",
    "content_original": "The FAA, CBP and the Pentagon acknowledged that the military “employed counter-unmanned aircraft system authorities to mitigate a seemingly threatening unmanned aerial system operating within military airspace”",
    "url": "https://www.thehindu.com/news/international/us-military-used-laser-to-take-down-border-protection-drone-say-lawmakers/article70685480.ece",
    "published": "2026-02-27T21:53:56+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S. military uses laser to down drone near border",
    "relevant": true,
    "translated": true,
    "summary_en": "The U.S. military shot down a drone operated by U.S. Customs and Border Protection using a laser system after it entered military airspace and was deemed a threat. This incident involved coordination between the FAA, CBP, and the Pentagon, highlighting ongoing concerns about airspace security and the potential for escalation in the region."
  },
  {
    "id": "cb1dda5b3d145a48",
    "title_original": "NASA overhauls Artemis moon programme with new docking test mission",
    "content_original": "NASA also cancelled an effort to upgrade its Space Launch System rocket to ​instead focus on increasing ‌that rocket’s production and flight rate, which has been slow relative to newer rockets",
    "url": "https://www.thehindu.com/sci-tech/nasa-overhauls-artemis-moon-programme-with-new-docking-test-mission/article70685273.ece",
    "published": "2026-02-27T21:22:23+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "NASA overhauls Artemis moon programme with new docking test mission",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "3e92d202005602c4",
    "title_original": "Six-nation conference in Warsaw applauds Pakistan's crackdown on illegal migration",
    "content_original": "Federal Interior Minister Mohsin Naqvi with Interior Ministers of Poland, Estonia, Latvia, Finland, and Lithuania during the 6-nation conference on Illegal Immigration and Security Cooperation. &mdash; APPConference focused on curbing human trafficking, illegal migration.Pakistan&rsquo;s...",
    "url": "https://www.geo.tv/latest/653279-six-nation-conference-in-warsaw-applauds-pakistans-crackdown-on-illegal-migration",
    "published": "2026-02-27T21:13:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Six-nation conference in Warsaw discusses illegal migration and security cooperation",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "2253441af41b613a",
    "title_original": "DG ISPR tells Afghan Taliban regime to choose between terrorist organisations and Pakistan",
    "content_original": "Inter-Services Public Relations (ISPR) Director General (DG) Lieutenant General Ahmed Sharif Chaudhry said on Friday that the Afghan Taliban had to choose between standing with Pakistan or with terrorist organisations. “I want to make one thing clear: the oppressive Afghan Taliban regime has to make a clear choice. The choice is to choose between Tehreek-i-Taliban Pakistan, Baloch Liberation Army, Daesh, Al Qaeda, the terrorists and terrorist organisations and Pakistan,” he said while giving a briefing on security forces’ response to unprovoked aggression by the Afghan Taliban on Thursday. “They have to make this choice. It has been made clear by the government of Pakistan. It is not something new I am saying … They have to make this choice. Whether they choose terrorists and terrorism or Pakistan. We are clear … Let it be known that our choice is absolutely clear. It will always be Pakistan over everything,” he said. “The Pakistan Army and the people of Pakistan have never hesitated i...",
    "url": "https://www.dawn.com/news/1976171/dg-ispr-tells-afghan-taliban-regime-to-choose-between-terrorist-organisations-and-pakistan",
    "published": "2026-02-27T21:06:53+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan demands Afghan Taliban choose between terrorists and Pakistan",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's military spokesperson has warned the Afghan Taliban to decide between aligning with Pakistan or supporting terrorist organizations like TTP, BLA, Daesh, and Al Qaeda. This statement follows recent aggression by the Afghan Taliban and highlights regional security concerns. The ultimatum reflects escalating tensions between Pakistan and the Taliban regime over cross-border militancy."
  },
  {
    "id": "1422268cd94fd86c",
    "title_original": "Pakistan's Mahnoor Omer named among TIME's Women of the Year 2026",
    "content_original": "This undated photo shows Pakistani women's rights activist Mahnoor Omer. &mdash; Instagram/@ learningwithmahnoor Pakistani women's rights activist Mahnoor Omer, who legally fought against taxes on menstrual products, has been named among TIME magazine's Women of the Year 2026 in...",
    "url": "https://www.geo.tv/latest/653289-pakistans-mahnoor-omer-named-among-times-women-of-the-year-2026",
    "published": "2026-02-27T21:06:43+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani women's rights activist named among TIME's Women of the Year 2026",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "421fec5b281879c6",
    "title_original": "Govt bans drone flying across country amid border clashes with Afghanistan",
    "content_original": "Representational image of an unmanned aerial vehicle also known as \"drone\" fitted with a camera. &mdash; Reuters/File ISLAMABAD: The federal government on Friday imposed a ban on all drone operations across the country after tensions escalated between Pakistan and Afghanistan...",
    "url": "https://www.geo.tv/latest/653275-govt-bans-drone-flying-across-country-amid-border-clashes-with-afghanistan",
    "published": "2026-02-27T20:26:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan bans drone flying nationwide amid border tensions with Afghanistan",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "09517a80744adb9b",
    "title_original": "Ghazab Lil Haq",
    "content_original": "Operation Ghazab Lil Haq is a befitting rejoinder to the continued transgressions from Afghanistan. Pakistan's sorties flying deep inside the terror-infected country are an unavoidable response to the infiltration of terrorists from across the western frontiers. The airstrikes on Kabul, Kandahar and Paktia, meant to target terror sanctuaries, are a lawful retaliation from Pakistan. The Afghan Taliban had, over the weekend, opened unprovoked firing on Pakistani check-posts in Torkham and Tirah sub-sectors, resulting in mass casualties. This is in addition to a flurry of terror attacks carried out by Afghan and Indian proxies in the restive provinces of Balochistan and Khyber-Pakhtunkhwa, as well as in the federal capital. This escalation of terrorism in Pakistan, undoubtedly, has its epicentre in Afghanistan, and that too under the patronage of the regime in Kabul. By conducting aggression inside Pakistan, the Taliban regime stands in violation of international law. Moreover, they have ...",
    "url": "https://tribune.com.pk/story/2594944/ghazab-lil-haq",
    "published": "2026-02-27T20:07:05+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan launches Operation Ghazab Lil Haq against Afghanistan in response to terror attacks",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan conducted airstrikes on Kabul, Kandahar, and Paktia in Afghanistan as retaliation for unprovoked attacks on Pakistani check-posts and terror activities by Afghan and Indian proxies. The operation targets terror sanctuaries and is a response to casualties inflicted on Pakistani forces. This escalation highlights ongoing tensions and cross-border violence between Pakistan and Afghanistan."
  },
  {
    "id": "6339602979d465fb",
    "title_original": "Window of opportunity",
    "content_original": "The decision by the opposition bloc to respond positively &mdash; albeit conditionally &mdash; to the government's offer of dialogue is a welcome thaw in an otherwise frozen political landscape. After months of recrimination, courtroom battles and rhetorical warfare, the willingness of TTAP to engage provides a rare opening to recalibrate a system that has been running on fumes. The consultative huddle in Islamabad, attended by a spectrum of leaders from Mahmood Khan Achakzai to Shahid Khaqan Abbasi and Asad Qaiser, signals that the opposition understands the gravity of the moment. By empowering Achakzai and Allama Nasir Abbas Jafri to lead negotiations, the alliance has attempted to streamline what has too often been an incoherent and reactive response to the government's overtures. Consensus, however, must be rooted in constitutional supremacy and the restoration of democratic processes. The opposition's insistence on transparency regarding Imran Khan's health and access to due proce...",
    "url": "https://tribune.com.pk/story/2594945/window-of-opportunity",
    "published": "2026-02-27T20:07:05+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Opposition bloc agrees to dialogue with government",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "356b856a0fc0124f",
    "title_original": "Unable to verify whether Iran has suspended all uranium enrichment: UN nuclear watchdog report",
    "content_original": "Some of ​Iran’s most highly enriched ‌uranium, close to ​weapons grade, ⁠was stored in an underground area of ‌its nuclear site in Isfahan, ‌the IAEA said",
    "url": "https://www.thehindu.com/news/international/iran-uranium-enrichment-un-nuclear-watchdog-report-underground-site/article70684839.ece",
    "published": "2026-02-27T20:06:52+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UN unable to verify suspension of Iran's uranium enrichment",
    "relevant": true,
    "translated": true,
    "summary_en": "The IAEA reported it could not confirm if Iran has halted uranium enrichment, with highly enriched uranium near weapons-grade levels found at Isfahan's nuclear site. This raises concerns about Iran's nuclear program amid ongoing conflict, as it could impact escalation dynamics and international response."
  },
  {
    "id": "a6ed6a25acf627ad",
    "title_original": "Spain alerts WHO of swine flu virus believed to have been transmitted between people",
    "content_original": "The ‌Catalan health department later said the risk assessment for the population was considered “very ‌low”",
    "url": "https://www.thehindu.com/news/international/spain-alerts-who-of-swine-flu-virus-believed-to-have-been-transmitted-between-people/article70684758.ece",
    "published": "2026-02-27T19:52:30+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Spain alerts WHO of swine flu virus with human-to-human transmission",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f8209b4f8e5d9e1d",
    "title_original": "'Pakistan doing terrifically well,' Trump says on  ‘Op Ghazab Lil Haq’ against Afghan Taliban",
    "content_original": "United States President Donald Trump hailed Pakistan&rsquo;s strikes against the Afghan Taliban regime&nbsp;under 'Operation Ghazab Lil Haq' on Friday,&nbsp;saying&nbsp;the country was&nbsp;&quot;doing terrifically well&rdquo;. Earlier on Friday, Pakistani forces targeted key military installations of the Afghan Taliban regime in Kabul, Kandahar, and Paktia through effective airstrikes. The military spokesperson said the ongoing operation was producing the desired results, with insurgents effectively repulsed at 53 locations along the border, inflicting heavy losses while exercising restraint to avoid civilian harm. The government later updated that a&nbsp;total of 297 enemies were&nbsp;killed, more than 450 were&nbsp;reported injured, 89 Afghan Taliban posts were destroyed and 18 captured, 135 Afghan Taliban regime tanks and armed personnel carriers were destroyed&nbsp;while 29 locations across Afghanistan were subjected to aerial strikes. Speaking to reporters today before heading to...",
    "url": "https://tribune.com.pk/story/2594940/pakistan-doing-terrifically-well-trump-says-on-op-ghazab-lil-haq-against-afghan-taliban",
    "published": "2026-02-27T19:15:27+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan conducts strikes against Afghan Taliban under 'Operation Ghazab Lil Haq'",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan launched airstrikes targeting key military installations of the Afghan Taliban in Kabul, Kandahar, and Paktia, reportedly inflicting heavy losses and repelling insurgents at 53 locations along the border. The operation, praised by US President Trump, demonstrates Pakistan's active role in countering the Taliban and could impact regional stability and US-Pakistan relations."
  },
  {
    "id": "2d0e58f54cfca366",
    "title_original": "How Pakistan and the Taliban, former allies, slid into ‘open war’",
    "content_original": "Pakistan believed the Taliban’s return to power would restore its “strategic depth” in South-Central Asia; but the Taliban’s rise reshaped regional dynamics, defying Pakistan’s calculations",
    "url": "https://www.thehindu.com/news/international/how-pakistan-and-the-taliban-former-allies-slid-into-open-war/article70684084.ece",
    "published": "2026-02-27T18:31:12+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "How Pakistan and the Taliban, former allies, slid into ‘open war’",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "2720c411949a9804",
    "title_original": "Indo-Nepal border to remain closed from March 2 midnight ahead of Nepal polls",
    "content_original": "An official said that the import and export of goods through the ICP would remain suspended during the period, but the movement of essential medicines and other critical commodities will not be stopped",
    "url": "https://www.thehindu.com/news/international/indo-nepal-border-to-remain-closed-from-march-2-midnight-ahead-of-nepal-polls/article70684166.ece",
    "published": "2026-02-27T18:30:56+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indo-Nepal border to close ahead of Nepal elections",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "2ffd876147db6ddc",
    "title_original": "Taliban regime seeks dialogue after Pakistan inflicts heavy losses in border clashes",
    "content_original": "Taliban spokesman Zabihullah Mujahid. &mdash; ReutersPakistan carries out air and ground strikes inside Afghanistan.PM Shehbaz gets briefing on Operation Ghazab lil-Haq at GHQ.12 Pakistani soldiers martyred in border clashes: ISPR DG. The Taliban regime in Afghanistan on Friday...",
    "url": "https://www.geo.tv/latest/653266-taliban-regime-seeks-dialogue-after-pakistan-inflicts-heavy-losses-in-borde",
    "published": "2026-02-27T17:58:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Taliban seeks dialogue after Pakistan inflicts heavy losses in border clashes",
    "relevant": true,
    "translated": true,
    "summary_en": "The Taliban regime in Afghanistan is seeking dialogue with Pakistan after suffering heavy losses in border clashes. Pakistan conducted air and ground strikes inside Afghanistan, resulting in the deaths of 12 Pakistani soldiers according to ISPR DG. The military operations, including Operation Ghazab lil-Haq, highlight escalating tensions between the two nations."
  },
  {
    "id": "cf800ca88932abd2",
    "title_original": "Over 270 Taliban regime personnel, terrorists killed in Pakistan's retaliatory response: ISPR chief",
    "content_original": "Inter-Services Public Relations Director General Lieutenant General Ahmad Sharif Chaudhry addresses a press conference on February 27, 2026. &mdash; Screengrab via YouTube/Geo NewsPakistan destroys over 74 Taliban posts, seizes 18 others.22 terrorists hideouts targeted during retaliatory...",
    "url": "https://www.geo.tv/latest/653253-over-270-taliban-regime-personnel-terrorists-killed-in-pakistans-retaliatory-response-ispr-chief",
    "published": "2026-02-27T17:47:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Over 270 Taliban figures personnel, terrorists killed in Pakistan's retaliatory response",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "da9c7f8ef7fa42ad",
    "title_original": "OpenAI's $110 billion funding round draws investment from Amazon, Nvidia, SoftBank",
    "content_original": "OpenAI said on Friday it is raising $110 billion in a blockbuster funding round that would value the ChatGPT maker at $840b, in a deal that signals the feverish pace of investment in artificial intelligence. The funding round includes a $30b&nbsp;investment from SoftBank, $30b&nbsp;from Nvidia and $50b from Amazon, and comes ahead of the AI startup's expected mega-IPO later this year. Big Tech companies and large tech investors such as SoftBank are racing to forge partnerships with OpenAI,&nbsp;which is spending heavily on data centres,&nbsp;betting that closer ties with the company would give them a competitive edge in the AI race. Amazon will start with an initial $15b&nbsp;investment, followed by another $35b&nbsp;in the coming months when certain conditions are met. Read More: OpenAI faces questions over safety protocols Along with the investment, OpenAI and Amazon have also struck a deal in which OpenAI will utilise two&nbsp;gigawatts of computing capacity powered by Amazon's in-h...",
    "url": "https://tribune.com.pk/story/2594933/openais-110-billion-funding-round-draws-investment-from-amazon-nvidia-softbank",
    "published": "2026-02-27T17:25:32+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "OpenAI raises $110 billion in funding round led by Amazon, Nvidia, SoftBank",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "66743ad8258aa20a",
    "title_original": "U.S. allows some embassy staff to leave Israel, citing safety risks",
    "content_original": "The embassy did not elaborate ‌on the safety risks leading ‌to the “authorised ⁠departure”, which allows affected ⁠personnel to decide whether to leave.",
    "url": "https://www.thehindu.com/news/international/us-allows-some-embassy-staff-to-leave-israel-citing-safety-risks/article70684016.ece",
    "published": "2026-02-27T17:17:33+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S. allows some embassy staff to leave Israel due to safety risks",
    "relevant": true,
    "translated": true,
    "summary_en": "The U.S. has authorized some embassy staff to depart Israel amid escalating regional tensions and safety concerns. This move comes as hostilities continue in the Israel-Hamas conflict and broader Iran-linked conflicts. The decision reflects the U.S.'s assessment of potential risks to personnel in the region."
  },
  {
    "id": "1bfbac260c887ed6",
    "title_original": "Watch: ‘Open war’: Pakistan launches airstrikes on Kabul, Kandahar",
    "content_original": "Pakistan launched airstrikes on Kabul and Kandahar, sharply escalating tensions with Afghanistan’s Taliban government. The Taliban confirmed the strikes but denied casualties, even as border clashes intensified. Pakistan’s Defence Minister called it “open war”, drawing strong regional reactions from Iran and China.",
    "url": "https://www.thehindu.com/videos/watch-open-war-pakistan-launches-airstrikes-on-kabul-kandahar/article70683769.ece",
    "published": "2026-02-27T16:19:07+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan launches airstrikes on Kabul and Kandahar",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan conducted airstrikes on Kabul and Kandahar, escalating tensions with the Taliban government in Afghanistan. The strikes and subsequent border clashes have drawn strong reactions from regional powers like Iran and China, highlighting the potential for broader regional instability."
  },
  {
    "id": "7246a544af37db0b",
    "title_original": "Jim Carrey delivers emotional speech in French at 51st Cesar Awards",
    "content_original": "Jim Carrey received an honorary award at the 51st Cesar Awards in Paris, delivering an emotional acceptance speech entirely in French. The ceremony took place at L&rsquo;Olympia and honored Carrey for his contributions to international cinema. The actor, known for films such as The Mask and How the Grinch Stole Christmas, was introduced on stage by filmmaker Michel Gondry, who directed him in Eternal Sunshine of the Spotless Mind. The honorary Cesar is traditionally awarded to an international film figure, with Julia Roberts receiving the distinction the previous year. Speaking in French with a noticeable American accent, Carrey reflected on the craft of acting, describing characters as clay shaped by an artist&rsquo;s hands. He also shared a personal anecdote about his ancestry, noting that his ancestor Marc-Fran&ccedil;ois Carr&eacute; was born in Saint-Malo, France, before emigrating to Canada centuries ago. Carrey remarked that receiving the award brought his family history &ldquo;...",
    "url": "https://tribune.com.pk/story/2594927/jim-carrey-delivers-emotional-speech-in-french-at-51st-cesar-awards",
    "published": "2026-02-27T16:05:15+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Jim Carrey delivers emotional speech in French at 51st Cesar Awards",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "442583c39a91f498",
    "title_original": "U.N. rights chief warns that more Iranians face execution over protests",
    "content_original": "“I am horrified by reports that at least eight people, including two ‌children, have been sentenced to death ‌in connection ⁠with the protests,” Volker Turk said",
    "url": "https://www.thehindu.com/news/international/un-rights-chief-warns-that-more-iranians-face-execution-over-protests/article70683475.ece",
    "published": "2026-02-27T15:12:30+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.N. rights chief warns of increased executions in Iran over protests",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "efd97d8cac1ff103",
    "title_original": "Afghanistan-Pakistan ‘open war’: Iran, Russia, China call for dialogue, offer mediation amidst conflict",
    "content_original": "Iran offered to help “facilitate dialogue” to resolve the conflict between Afghanistan and Pakistan",
    "url": "https://www.thehindu.com/news/international/afghanistan-pakistan-confict-open-war-countries-call-for-dialogue-offer-mediation/article70683410.ece",
    "published": "2026-02-27T14:55:23+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran, Russia, China call for dialogue in Afghanistan-Pakistan conflict, offer mediation",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "1f51d40c76679667",
    "title_original": "Watch: PM Modi in Israel: a missed opportunity on Palestine: The Hindu Editorial",
    "content_original": "Prime Minister Narendra Modi’s 24-hour visit to Jerusalem was a significant bilateral outreach to Israel, but a missed opportunity on Palestine, with complex consequences for India’s ties with West Asia.",
    "url": "https://www.thehindu.com/videos/watch-pm-modi-in-israel-a-missed-opportunity-on-palestine-the-hindu-editorial/article70683378.ece",
    "published": "2026-02-27T14:23:12+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PM Modi in Israel: a missed opportunity on Palestine",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8468232a52b73be2",
    "title_original": "Pakistan-Afghanistan border tensions — what we know so far?",
    "content_original": "Pakistan Army soldiers raise national flag at a captured Afghan Taliban checkpost at border on February 27, 2026. &mdash; X@PTVNewsOfficial Simmering tensions between Pakistan and Afghanistan climaxed on Friday after the Afghan Taliban regime resorted to unprovoked firing along...",
    "url": "https://www.geo.tv/latest/653194-pakistan-afghanistan-border-tensions-what-we-know-so-far",
    "published": "2026-02-27T13:10:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan-Afghanistan border tensions escalate after Taliban firing incident",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "04a5e012b35361d7",
    "title_original": "Operation Ghazab lil-Haq: US backs Pakistan's 'right to defend' itself against Taliban attacks",
    "content_original": "Operation Ghazab lil-Haq: US backs Pakistan's 'right to defend' itself against Taliban attacks",
    "url": "https://www.geo.tv/latest/653186-operation-ghazab-lil-haq-pakistan-bombs-taliban-targets-in-afghanistan-kills-133-operatives",
    "published": "2026-02-27T12:29:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US supports Pakistan's right to self-defense against Taliban attacks",
    "relevant": true,
    "translated": true,
    "summary_en": "The US has backed Pakistan's efforts to defend itself against Taliban attacks under Operation Ghazab lil-Haq. This support signifies a potential shift in regional dynamics and could involve US intelligence or military assistance to Pakistan. The development is significant as it may impact the Taliban's operational capabilities and regional stability."
  },
  {
    "id": "dfe019e07394a78d",
    "title_original": "World urges restraint as Pakistan-Afghanistan border tensions spike",
    "content_original": "Smoke rises following Pakistan's srikes, in Kabul, Afghanistan, in this still image taken from video released on February 27, 2026. &mdash; ReutersIran offers to facilitate dialogue between Islamabad, Kabul.UN urges civilian protection, international law obligations.Over 270 Taliban regime...",
    "url": "https://www.geo.tv/latest/653183-world-urges-restraint-as-pakistan-afghanistan-border-tensions-spike",
    "published": "2026-02-27T11:53:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran offers to mediate Pakistan-Afghanistan border tensions",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran has offered to facilitate dialogue between Pakistan and Afghanistan amid escalating border tensions. The UN has urged the protection of civilians and adherence to international law. The situation is significant as it could draw in regional powers and further destabilize the region, potentially impacting US and NATO interests in Afghanistan."
  },
  {
    "id": "dd70e2e26ef51f04",
    "title_original": "Fans defend Bilal Abbas Khan after secretly filmed video in Madinah",
    "content_original": "Fans have come to the defence of Bilal Abbas Khan after a video of him praying, secretly filmed by a social media user, went viral. Known for his versatility, Bilal gained fame through hit TV dramas such as Pyar Ke Sadqay, Mun Jogi, Cheekh, and Ishq-e-Murshid. He currently stars in the drama serial Meri Zindagi Hai Tu opposite Hania Aamir, further strengthening his fan following. Despite having around 5.8 million followers on Instagram, Bilal rarely shares details of his private life, though fans frequently post videos of his personal moments on social media. &nbsp; &nbsp; &nbsp; &nbsp; View this post on Instagram &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Recently, fans spotted Bilal Abbas Khan in Madinah, reciting the Quran and visiting the Prophet&rsquo;s Mosque. In April 2024, he was also seen performing Umrah, and on both occasions, fans raised objections to secret videos being taken of him in Mecca and Madinah. This time, a video showing Bilal Ab...",
    "url": "https://tribune.com.pk/story/2594868/fans-defend-bilal-abbas-khan-after-secretly-filmed-video-in-madinah",
    "published": "2026-02-27T07:50:02+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fans defend Bilal Abbas Khan after secretly filmed video in Madinah",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "0bc00d5d88d4ff57",
    "title_original": "Poland plans social-media ban for children under 15",
    "content_original": "Poland plans to introduce new legislation to ban social media for children under 15 years of age and will hold platforms responsible for age verification, Education Minister Barbara Nowacka told Bloomberg News in an interview published on Friday. The ruling Civic Coalition will present the draft outline on Friday, with fines planned for platforms that remain accessible to younger users, Nowacka said, adding that the law could take effect by early 2027. &quot;We see the mental health of children and young people, we see a decline in their intellectual competence,&quot; said Nowacka, adding that the size of penalties that companies would have to pay is still under discussion. Several European governments, including Denmark, Greece, France, Spain and Britain, have explored similar restrictions amid claims that social-media services are harmful or addictive for minors. The British government said in January it was considering restrictions to protect children online, after Australia impleme...",
    "url": "https://tribune.com.pk/story/2594858/poland-plans-social-media-ban-for-children-under-15",
    "published": "2026-02-27T06:13:27+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Poland plans social-media ban for children under 15",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "be06178ff22821fd",
    "title_original": "Pakistan's security, integrity non-negotiable, say PM Shehbaz and President Zardari",
    "content_original": "A collage showing President Asif Ali Zardari and PM Shehbaz Sharif. &mdash; APP/Geo News/FilePakistan to firmly respond to any act of aggression: PM.Peace to not be mistaken for weakness, says President Zardari.'Armed forces fully equipped, trained, prepared for threats.' Prime Minister...",
    "url": "https://www.geo.tv/latest/653156-pakistans-security-and-integrity-non-negotiable-pm-president",
    "published": "2026-02-27T03:48:24+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan's leaders emphasize readiness to respond to aggression",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "70c61b0f01f33dba",
    "title_original": "Pakistan Afghanistan War Live Updates: Pak jet shot down in Jalalabad and pilot captured, claims Taliban; Islamabad denies",
    "content_original": "Pakistan Afghanistan War Live Updates: Pak jet shot down in Jalalabad and pilot captured, claims Taliban; Islamabad denies",
    "url": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-afghanistan-tensions-operation-ghazab-lil-haq-kabul-shehbaz-sharif-islamabad/liveblog/128827696.cms",
    "published": "2026-02-27T03:12:55+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani jet shot down in Jalalabad, pilot captured by Taliban; Islamabad denies",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "85849c7c987ca77d",
    "title_original": "'Operation Ghazab lil-Haq': Pakistan bombs defence targets in 'open war' with Afghanistan, killing 133",
    "content_original": "The image shows an Afghan security forces check post located in Angoor Adda. &mdash; Geo News/ScreengrabTaliban regime opens unprovoked fire along Pak-Afghan border.Forces give effective response to Taliban's unprovoked border attack.Taliban spread fake videos, false claims on social...",
    "url": "https://www.geo.tv/latest/653134-pakistan-forces-give-effective-response-to-taliban-regimes-unprovoked-border-action-info-ministry",
    "published": "2026-02-26T22:39:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan launches 'Operation Ghazab lil-Haq' against Afghanistan, kills 133 in border clashes",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's military conducted 'Operation Ghazab lil-Haq', bombing defense targets in Afghanistan after Taliban forces opened unprovoked fire across the border. The operation resulted in the deaths of 133 individuals. This escalation highlights ongoing tensions and conflict between Pakistan and the Taliban regime in Afghanistan, with potential regional security implications."
  },
  {
    "id": "06f18f89bf06bc29",
    "title_original": "Pakistan remains 'seized of defence ties' between Israel and India: FO",
    "content_original": "India&rsquo;s Prime Minister Narendra Modi visits Yad Vashem, alongside Israeli Prime Minister Benjamin Netanyahu in Jerusalem, February 26, 2026. &mdash; Reuters Pakistan ready to deter any Indian aggression, says FO. Says Pakistan remains cognisant of threats to its...",
    "url": "https://www.geo.tv/latest/653116-pakistan-remains-seized-of-defense-ties-between-israel-and-india-fo",
    "published": "2026-02-26T21:04:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan remains 'seized of defence ties' between Israel and India: FO",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b537b225ecdee354",
    "title_original": "Security forces kill 10 India-sponsored terrorists in Balochistan's Zhob: ISPR",
    "content_original": "Security personnel stand guard in Bajaur district of Khyber Pakhtunkhwa. &mdash; AFP/File Security forces have killed 10 India-sponsored terrorists in an operation conducted in Balochistan&rsquo;s Zhob district on February 25, said Inter-Services Public Relations in a statement...",
    "url": "https://www.geo.tv/latest/653112-security-forces-kill-10-india-sponsored-terrorists-in-balochistans-zhob-ispr",
    "published": "2026-02-26T20:26:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani forces kill 10 India-backed militants in Balochistan",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "450b330f835991da",
    "title_original": "At least seven killed as gas cylinder explodes in Balochistan's Chaman",
    "content_original": "Representational image of a blast. &mdash; Reuters/File25 people suffer injuries in cylinder blast, say police.20kg gas cylinder exploded when lassi being distributed.Several rooms of the house collapse after explosion. At least seven people, including five children, were killed...",
    "url": "https://www.geo.tv/latest/653101-at-least-seven-died-as-gas-cylinder-explodes-in-balochistans-chaman",
    "published": "2026-02-26T19:26:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Gas cylinder explosion kills seven in Balochistan's Chaman",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "f9de592254879f6f",
    "title_original": "Opposition accepts govt's offer to hold negotiations amid deadlock over Imran's eye treatment",
    "content_original": "This undated photo shows Pashtunkhwa Milli Awami Party Chief Mahmood Khan Achakzai and Majlis Wahdat-e-Muslimeen chief Allama Raja Nasir Abbas. &mdash; Screengrab via X/@MKAchakzaiPKMAPAchakzai, Abbas given mandate to represent TTAP in dialogue.Opposition \"plans to contact key govt...",
    "url": "https://www.geo.tv/latest/653080-opposition-accepts-govts-offer-to-hold-negotiations-amid-deadlock-over-imrans-eye-treatment",
    "published": "2026-02-26T18:31:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Opposition accepts govt's offer to hold negotiations amid deadlock over Imran's eye treatment",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "afe7f2257a2f1690",
    "title_original": "US AI giants accuse Chinese rivals of mass data theft",
    "content_original": "US artificial intelligence company Anthropic said Monday it had uncovered campaigns by three Chinese AI firms to illicitly extract capabilities from its Claude chatbot, in what it described as industrial-scale intellectual property theft. Anthropic said DeepSeek, Moonshot AI, and MiniMax used a technique known as &quot;distillation&quot; - using outputs from a more powerful AI system to rapidly boost the performance of a less capable one. &quot;These campaigns are growing in intensity and sophistication,&quot; the company said in a statement. &quot;The window to act is narrow&quot;. Distillation is a common practice within AI development, often used by companies to create cheaper, smaller versions of their own models. The practice grabbed headlines a year ago when the release of a low-cost generative AI model from DeepSeek performed at a similar level to ChatGPT and other top American chatbots, upending assumptions of US dominance in the sensitive sector. Read: YouTube exec says goal w...",
    "url": "https://tribune.com.pk/story/2594283/us-ai-giants-accuse-chinese-rivals-of-mass-data-theft",
    "published": "2026-02-24T07:31:53+05:00",
    "source_name": "Express Tribune (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US AI giants accuse Chinese rivals of mass data theft",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  }
]