[
  {
    "id": "2ae71386b192ff20",
    "title_original": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "content_original": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "url": "https://www.thehindu.com/news/international/iran-condemns-barbaric-attack-on-school-after-us-israeli-strikes-says-khamenei-is-alive/article70689136.ece",
    "published": "2026-02-28T22:19:56+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has condemned a 'barbaric' attack on a school following U.S. and Israeli strikes, while also addressing rumors by confirming that Supreme Leader Khamenei is alive. This suggests ongoing tensions and potential escalation as Iran reacts to recent military actions by the U.S. and Israel, with propaganda efforts to maintain domestic stability."
  },
  {
    "id": "0c4ba8dd9e032963",
    "title_original": "'Side pe ho jao, bhaago': Man screams as missile falls in Qatar amid US-Iran conflict",
    "content_original": "Residents of Barwa City in Doha witnessed a missile strike and loud explosion after Iran launched attacks.&nbsp;",
    "url": "https://www.hindustantimes.com/world-news/side-pe-ho-jao-bhaago-man-screams-as-missile-falls-in-qatar-amid-us-iran-conflict-101772291924248.html",
    "published": "2026-02-28T22:12:40+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Missile falls in Qatar amid US-Iran conflict",
    "translated": true,
    "relevant": true,
    "summary_en": "A missile struck Doha's Barwa City in Qatar following Iranian attacks, causing a loud explosion. This incident highlights the regional escalation and potential threat to Gulf states amid the US-Iran conflict. The strike underscores the risk of collateral damage and regional instability as hostilities continue."
  },
  {
    "id": "e91564d035b73b42",
    "title_original": "Indian Embassy in Israel advises citizens to register to ensure swift assistance",
    "content_original": "The embassy said that registration will enable the Embassy to contact citizens promptly.",
    "url": "https://www.hindustantimes.com/world-news/indian-embassy-in-israel-advises-citizens-to-register-to-ensure-swift-assistance-101772285604219.html",
    "published": "2026-02-28T22:09:37+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian Embassy in Israel advises citizens to register for assistance",
    "translated": true,
    "relevant": true,
    "summary_en": "The Indian Embassy in Israel is advising its citizens to register to ensure they can be contacted swiftly for assistance. This move comes amid escalating regional tensions due to the ongoing conflict between Iran and the US, which could potentially impact Israel's security. The registration is aimed at providing prompt support and updates to Indian nationals in case of any emergency or escalation."
  },
  {
    "id": "f231c8f42e4345bb",
    "title_original": "‘We heard sirens across the region’: Indian man in Kuwait recalls tense moments during Iran retaliation",
    "content_original": "Amid Iran’s counterattacks, an Indian man in Kuwait described hearing sirens and receiving safety alerts while tensions escalated.",
    "url": "https://www.hindustantimes.com/trending/we-heard-sirens-across-the-region-indian-man-in-kuwait-recalls-tense-moments-during-iran-retaliation-101772295433661.html",
    "published": "2026-02-28T22:09:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian man in Kuwait recalls hearing sirens during Iran’s retaliation",
    "translated": true,
    "relevant": true,
    "summary_en": "An Indian man in Kuwait reported hearing sirens and receiving safety alerts amid escalating tensions from Iran's retaliatory attacks. This highlights the regional impact of the conflict and the fear of escalation affecting civilians and foreign nationals in neighboring countries."
  },
  {
    "id": "127f9f6832cd6c08",
    "title_original": "‘Looks like incompetent Indians …’: Row over Shanti Narra attending NJ transit board meeting online",
    "content_original": "‘Looks like incompetent Indians …’: Row over Shanti Narra attending NJ transit board meeting online",
    "url": "https://timesofindia.indiatimes.com/world/us/looks-like-incompetent-indians-row-over-shanti-narra-attending-new-jersey-transit-board-meeting-online/articleshow/128891741.cms",
    "published": "2026-02-28T22:09:10+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Row over NJ transit board member attending meeting online",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "fd7586cfdb4ca982",
    "title_original": "Full list of places where explosions were heard in Dubai today",
    "content_original": "Dubai authorities also confirmed an “incident” in Palm Jumeirah, while precautionary evacuations and airspace closures followed across the emirate.",
    "url": "https://www.hindustantimes.com/world-news/full-list-of-places-where-explosions-blasts-were-heard-in-dubai-today-fairmont-palm-jumeirah-burj-khalifa-101772296159043.html",
    "published": "2026-02-28T22:04:17+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions heard across multiple locations in Dubai",
    "translated": true,
    "relevant": true,
    "summary_en": "Explosions were reported in various locations in Dubai, including an incident in Palm Jumeirah, prompting precautionary evacuations and airspace closures. This raises concerns about potential attacks or incidents amidst the ongoing Iran-US conflict, given Dubai's proximity to the conflict zone and its strategic importance."
  },
  {
    "id": "0f750c93df486b38",
    "title_original": "‘No ship allowed’: Iran’s blocks Strait of Hormuz; US urges ships to avoid Gulf after US-Israel strike",
    "content_original": "Vessels transiting the Strait of Hormuz are reportedly receiving radio warnings, attributed to Iran's Revolutionary Guards, stating passage is prohibited. This critical oil route, vital for global energy supplies, faces heightened tensions following recent regional strikes. Iran has not officially confirmed issuing such an order, raising concerns for commercial shipping.",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/no-ship-allowed-irans-blocks-strait-of-hormuz-us-urges-ships-to-avoid-gulf-after-us-israel-strike/articleshow/128891440.cms",
    "published": "2026-02-28T21:54:24+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran blocks Strait of Hormuz; US warns ships to avoid Gulf after US-Israel strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran's Revolutionary Guards have reportedly issued radio warnings prohibiting vessel passage through the Strait of Hormuz, a critical global oil route. The US has responded by urging ships to avoid the Gulf following recent strikes by the US and Israel. This escalation threatens to disrupt global energy supplies and further heightens regional tensions."
  },
  {
    "id": "2e71241aeeb3b1ee",
    "title_original": "Police issue public safety advisory as Karachi placed on high alert amid Pak-Afghan tensions",
    "content_original": "KARACHI: Amid escalating tensions between Pakistan and Afghanistan, police on Saturday issued a public safety advisory which stated that Karachi had been placed on “high alert”. The advisory issued by the office of the Karachi additional inspector general of police, a copy of which is available with Dawn , said, “Karachi has been placed on high alert following increased military tensions between Pakistan and Afghan Taliban forces near the Pak-Afghan border.” “Police and other law enforcement agencies (LEAs) have strengthened surveillance and tightened security at key entry-exit points, transportation hubs, sensitive and important places to pre-empt potential security threats,” it said. In the safety guidelines for residents and visitors, the Karachi police urged them to stay vigilant and alert to announcements from local police, law enforcement and provincial officials. The advisory urged the citizens to report suspicious activity and immediately notify local police or emergency servic...",
    "url": "https://www.dawn.com/news/1976635/police-issue-public-safety-advisory-as-karachi-placed-on-high-alert-amid-pak-afghan-tensions",
    "published": "2026-02-28T21:52:56+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Karachi on high alert as Pak-Afghan tensions escalate",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8b2aab80ed40ac1e",
    "title_original": "Will gold and silver prices break records? Experts raise alarm amid US-Iran-Israel conflict",
    "content_original": "Gold and silver prices are expected to rise sharply on Monday amid escalating Israel-Iran tensions, pushing investors to safe-haven assets.",
    "url": "https://www.hindustantimes.com/world-news/us-news/will-gold-and-silver-prices-break-records-experts-raise-worries-amid-us-iran-israel-conflict-101772294045996.html",
    "published": "2026-02-28T21:49:19+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Gold and silver prices expected to rise amid escalating Israel-Iran tensions",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses the potential for gold and silver prices to rise sharply due to escalating tensions between Israel and Iran. This is significant as it reflects the broader economic and market impacts of the ongoing conflict, with investors seeking safe-haven assets amid geopolitical uncertainty."
  },
  {
    "id": "20235c1d6cddc2ea",
    "title_original": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "content_original": "US and Israeli strikes on Iran triggered explosions near Khamenei’s office, bringing renewed attention to Iran’s leadership succession process.",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-succession-order-who-could-replace-irans-supremo-after-us-strikes-101772294565735.html",
    "published": "2026-02-28T21:45:13+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses potential successors to Ayatollah Ali Khamenei following recent US and Israeli strikes near his office, highlighting the significance of leadership continuity in Iran amidst ongoing conflict. This is relevant due to the direct impact of military strikes on Iran's leadership and the potential for escalation or changes in strategic decision-making."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:43:59+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "relevant": true,
    "translated": true
  },
  {
    "id": "faa2a78c8b40a019",
    "title_original": "Watch: U.S.-Israel strike Iran: What really happened| Explained",
    "content_original": "On February 28, 2026, the U.S. and Israel launched joint strikes on Iran in Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran.",
    "url": "https://www.thehindu.com/videos/watch-us-israel-strike-iran-what-really-happened-explained/article70688988.ece",
    "published": "2026-02-28T21:18:21+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S.-Israel strike Iran: What really happened| Explained",
    "relevant": true,
    "translated": true,
    "summary_en": "On February 28, 2026, the U.S. and Israel conducted joint strikes on Iran, codenamed Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran. This operation signifies a significant escalation in the ongoing conflict, showcasing coordinated military action between the U.S. and Israel against Iran's strategic assets. The strikes are likely intended to degrade Iran's military capabilities and deter further aggression in the region."
  },
  {
    "id": "fe512b1493748ee3",
    "title_original": "Watch: Iranians react with defiance after U.S.-Israel strikes",
    "content_original": "Iranians react with a mix of defiance, fear, and uncertainty following the latest strikes. While some vow that Iran will never bow down, others express concern about escalation, civilian safety, and what comes next for the region.",
    "url": "https://www.thehindu.com/videos/watch-iranians-react-with-defiance-after-us-israel-strikes/article70688982.ece",
    "published": "2026-02-28T21:17:26+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranians react with defiance after US-Israel strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian citizens are responding with defiance, fear, and uncertainty following recent US-Israel strikes on Iran. The reactions highlight a mix of resolve to resist and concerns about escalation and civilian safety, reflecting the broader regional impact and uncertainty about future developments in the conflict."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:11:25+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Supreme Leader Khamenei to give a speech amid ongoing conflict with Israel and US",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Khamenei is set to deliver a speech as tensions escalate with Israel and the US. The conflict involves Iranian strikes on US military bases in Kuwait, Qatar, the UAE, and Jordan, while Israeli PM Netanyahu emphasizes ending the threat from the Ayatollah regime. This signifies potential further escalation and strategic implications for regional stability and US forces in the Middle East."
  },
  {
    "id": "83e1931c39cb08cc",
    "title_original": "Iran to witness regime change? Foreign Minister Abbas Araghchi makes huge statement on Trump's plans",
    "content_original": "Iran's foreign minister Abbas Araghchi claims Trump's regime change goal is unattainable.",
    "url": "https://www.hindustantimes.com/world-news/us-news/iran-to-witness-regime-change-foreign-minister-abbas-araghchi-makes-huge-statement-on-trumps-plans-101772292738356.html",
    "published": "2026-02-28T21:08:26+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's foreign minister dismisses Trump's regime change goal",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Minister Abbas Araghchi stated that the US's alleged plans for regime change in Iran are unattainable. This statement comes amidst ongoing armed conflict between Iran and the US, highlighting the continued tensions and Iran's defiance against external threats. The statement is significant as it reflects Iran's stance on the conflict and its resistance to US pressure."
  },
  {
    "id": "0a86e97d326b8cc2",
    "title_original": "Fairmont Hotel in Palm Jumeirah hit? Videos show fire, smoke in Dubai amid Iran strikes",
    "content_original": "Videos allegedly showing fire and smoke near Fairmont The Palm hotel on Dubai’s Palm Jumeirah surfaced.",
    "url": "https://www.hindustantimes.com/world-news/fairmont-hotel-in-palm-jumeirah-hit-videos-show-fire-smoke-in-dubai-amid-iran-strikes-101772292705312.html",
    "published": "2026-02-28T21:08:07+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fairmont Hotel in Dubai's Palm Jumeirah hit amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Unconfirmed reports indicate that the Fairmont The Palm hotel in Dubai's Palm Jumeirah was hit, with videos showing fire and smoke in the area. This incident comes amid escalating tensions and strikes by Iran, potentially marking an expansion of the conflict into civilian areas in the UAE. The strategic significance lies in the potential disruption of tourism and business in Dubai and the broader implications for regional stability."
  },
  {
    "id": "7d4afc527d752e0b",
    "title_original": "Indian founder aboard Qatar Airways flight records pilot’s diversion announcement amid Iran retaliation",
    "content_original": "An Indian founder shared how a Qatar Airways flight to Barcelona was diverted back to Doha after Iraqi airspace closed amid escalating Middle East tensions.",
    "url": "https://www.hindustantimes.com/trending/indian-founder-aboard-qatar-airways-flight-records-pilot-s-diversion-announcement-amid-iran-retaliation-101772291884494.html",
    "published": "2026-02-28T21:07:09+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Qatar Airways flight diverted due to Iraq airspace closure amid Iran-US conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "A Qatar Airways flight from Doha to Barcelona was diverted back to Doha after Iraq closed its airspace due to escalating tensions in the Middle East. The incident highlights the broader impact of the Iran-US conflict on civilian aviation and regional stability. The diversion underscores the risks and disruptions faced by commercial airlines operating near conflict zones."
  },
  {
    "id": "59f2079cf194fa45",
    "title_original": "Iran vs Israel | Chronicles of a war foretold",
    "content_original": "America and Israel seek regime change and a permanent shift in the balance of power in West Asia. For the Islamic Republic, this is a war of survival",
    "url": "https://www.thehindu.com/news/international/iran-vs-israel-chronicles-of-a-war-foretold/article70688723.ece",
    "published": "2026-02-28T21:04:13+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran vs Israel: Chronicles of a War Foretold",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the ongoing conflict between Iran and Israel, with the US supporting regime change in Iran. This is framed as a war of survival for Iran against the US and Israel, highlighting the strategic significance of the conflict in West Asia."
  },
  {
    "id": "ea51a6922ea82500",
    "title_original": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "content_original": "Iran's Supreme Leader Ayatollah Ali Khamenei is alive, the country's finance minister confirmed",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-makes-big-move-amid-dead-rumors-iran-supreme-leader-first-response-to-us-israel-strikes-101772291485510.html",
    "published": "2026-02-28T20:54:58+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Ayatollah Ali Khamenei has made a significant move and issued his first response to recent US strikes, confirming his survival amid rumors of his death. This development is crucial as it demonstrates continued leadership and potential strategic direction for Iran during the ongoing conflict with the US. Khamenei's response could indicate Iran's next steps in the escalation or de-escalation of hostilities."
  },
  {
    "id": "46592b160d24909b",
    "title_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "content_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-white-men-allowed-row-over-toronto-university-only-hiring-professors-on-basis-of-gender-identity/articleshow/128889863.cms",
    "published": "2026-02-28T20:54:41+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Toronto University under fire for hiring policy based on gender identity",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9a5e03a5d7052f1f",
    "title_original": "Trump to deliver any remarks on strikes in Iran today? A look at his public agenda as US launches 'Op Epic Fury'",
    "content_original": "President Trump is not expected to make further public statements on the Iran strikes today, according to White House officials.",
    "url": "https://www.hindustantimes.com/world-news/us-news/donald-trump-to-deliver-any-remarks-on-strikes-in-iran-today-a-look-at-his-public-agenda-as-us-launches-op-epic-fury-101772290712176.html",
    "published": "2026-02-28T20:52:18+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump not expected to comment on Iran strikes today",
    "relevant": true,
    "translated": true,
    "summary_en": "President Trump is unlikely to make additional public statements on the ongoing US strikes in Iran, as per White House officials. This comes as the US launches 'Op Epic Fury' against Iranian targets. The silence may reflect a strategic decision to avoid escalating tensions through public remarks."
  },
  {
    "id": "38bc9df52cdadc59",
    "title_original": "Donald Trump claims stock market boom ‘saved’ NYPD officer’s marriage at Texas rally",
    "content_original": "President Trump claimed an NYPD officer's sex life improved due to his economic policies, as the officer's wife now admires his financial success. Trump stated the officer's 401(k) \"went through the roof,\" transforming his wife's perception from seeing him as a \"loser\" to a \"genius.\"",
    "url": "https://timesofindia.indiatimes.com/world/us/donald-trump-claims-stock-market-boom-saved-nypd-officers-marriage-at-texas-rally/articleshow/128889421.cms",
    "published": "2026-02-28T20:46:05+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump claims stock market boom ‘saved’ NYPD officer’s marriage at Texas rally",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "7a559a718f42d6b6",
    "title_original": "Israel and U.S. launch strikes on Iran, targeting its leadership",
    "content_original": "The apparent strike happened near the offices of Supreme Leader Ayatollah Ali Khamenei",
    "url": "https://www.thehindu.com/news/international/israel-attack-on-iran-february-28-2026/article70687211.ece",
    "published": "2026-02-28T20:43:05+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel and U.S. launch strikes on Iran, targeting its leadership",
    "relevant": true,
    "translated": true,
    "summary_en": "Israel and the US conducted strikes targeting Iran's leadership, including near the offices of Supreme Leader Ayatollah Ali Khamenei. This represents a significant escalation in the conflict, directly targeting Iran's top leadership. The strikes signify a coordinated effort by Israel and the US to weaken Iran's command structure amidst ongoing hostilities."
  },
  {
    "id": "278e422592de8003",
    "title_original": "SEBI chief, Canada FM hold talks on boosting institutional investment, regulatory ties",
    "content_original": "“The two sides discussed how both sides can further facilitate institutional investments, strengthen regulatory collaboration, and other issues of mutual interests,” SEBI said in a post on X",
    "url": "https://www.thehindu.com/business/Industry/sebi-chief-canada-fm-hold-talks-on-boosting-institutional-investment-regulatory-ties/article70688651.ece",
    "published": "2026-02-28T20:42:09+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "SEBI chief and Canada FM discuss boosting institutional investment and regulatory ties",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "df07efb53bdfb11d",
    "title_original": "Pakistani national killed in Iranian missile strikes on UAE: diplomatic officials",
    "content_original": "Smoke in the sky after reported blasts were heard, following strikes by the United States and Israel against Iran, in Abu Dhabi, United Arab Emirates, February 28, 2026, in this still image obtained from a video. &mdash; Reuters Identity of deceased has not yet been disclosed.Pakistani...",
    "url": "https://www.geo.tv/latest/653426-pakistani-national-killed-in-iranian-missile-strikes-on-uae-diplomatic-officials",
    "published": "2026-02-28T20:40:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani national killed in Iranian missile strikes on UAE",
    "relevant": true,
    "translated": true,
    "summary_en": "An unidentified Pakistani national was killed in Iranian missile strikes on the UAE, highlighting the regional escalation as Iran targets US allies. The strikes occurred amid ongoing hostilities between Iran and the US, with the UAE being a critical US partner in the region. This incident underscores the risk of civilian casualties and the potential for further diplomatic tensions as the conflict expands beyond direct combatants."
  },
  {
    "id": "9453983613675374",
    "title_original": "Missiles, interceptions, air closure on day of fear for UAE residents as US-Israel strikes on Iran ignite wider conflict",
    "content_original": "As Tehran launched simultaneous missiles across the United Arab Emirates (UAE), Bahrain, and Qatar, civilians took shelter and mostly remained indoors.",
    "url": "https://www.hindustantimes.com/world-news/missiles-interceptions-air-closure-mark-day-of-fear-for-uae-residents-as-us-israel-strikes-ignite-middle-east-conflict-101772291050371.html",
    "published": "2026-02-28T20:37:19+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Missiles, interceptions, air closure on day of fear for UAE residents as US-Israel strikes on Iran ignite wider conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missiles targeting the UAE, Bahrain, and Qatar in retaliation for US-Israel strikes on Iran, causing air closures and civilian fear. The attacks demonstrate Iran's capability to strike US allies in the Gulf region, escalating the conflict. The military significance includes heightened tensions and potential further escalation in the Gulf as US allies respond to the Iranian attacks."
  },
  {
    "id": "1554d27a1606504e",
    "title_original": "Pakistan regrets outbreak of hostilities in Middle East",
    "content_original": "The Foreign Office (FO) on Saturday regretted the “breakdown of talks and outbreak of hostilities in the Middle East”. The statement came after United States and Israel launched strikes on Iran, plunging the region into a renewed military confrontation. Subsequently, several Gulf Arab states said they were targeted by Iranian missiles after Tehran pledged to retaliate against the strikes. In a statement, the FO said, “Pakistan regrets the breakdown of talks and outbreak of hostilities in the Middle East. Pakistan condemns the unwarranted attacks against the Islamic Republic of Iran. These attacks come at a time when diplomatic efforts were underway to reach a peaceful and negotiated solution.” The ministry maintained that such a course of action “will undermine the peace and stability of the entire region, with far reaching consequences”. Pakistan also “strongly condemned” the attacks by Iran against the brotherly countries of Saudi Arabia, Bahrain, Jordan, Kuwait, Qatar, and the Unite...",
    "url": "https://www.dawn.com/news/1976494/pakistan-regrets-outbreak-of-hostilities-in-middle-east",
    "published": "2026-02-28T20:35:25+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistan expresses regret over Middle East hostilities",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan's Foreign Office has condemned the recent attacks on Iran by the United States and Israel, expressing regret over the breakdown of diplomatic efforts and the escalation of hostilities in the Middle East. This statement follows Iran's retaliatory missile strikes on several Gulf Arab states. The situation highlights the ongoing military confrontation and the failure of diplomatic initiatives to resolve the conflict peacefully."
  },
  {
    "id": "02a8bfbfd82e16ee",
    "title_original": "‘All I want is freedom for…’: Trump's big remark after US-Israel strike on Iran",
    "content_original": "Trump was speaking hours after Israel and US jointly launched strikes on Iran, which among other things targeted the area near Khamenei's residence.",
    "url": "https://www.hindustantimes.com/world-news/all-i-want-is-freedom-for-trump-remark-after-us-israel-strike-on-iran-101772290447461.html",
    "published": "2026-02-28T20:29:27+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump comments on US-Israel strike targeting area near Khamenei's residence",
    "relevant": true,
    "translated": true,
    "summary_en": "Trump made remarks shortly after a joint US-Israel strike targeted areas near Ayatollah Khamenei's residence in Iran. The strike is part of ongoing escalation between the US and its allies against Iran, demonstrating continued coordination between the US and Israel against Iranian targets. This action signifies a significant escalation in the conflict and targets the Iranian leadership directly."
  },
  {
    "id": "bd24ffbd3323ac1c",
    "title_original": "Bored of Peace? Half of Donald Trump's Board of Peace is at war",
    "content_original": "Donald Trump’s grandly titled Board of Peace was supposed to be a Trumpian alternative to the United Nations, promising order, stability, and the end of endless wars. Instead, it resembles a Yes Minister casting call where the least qualified are handed the grandest titles. Nearly half its members are now entangled in active military escalation, from US-Israel strikes on Iran to Pakistan’s growing confrontation with the Taliban. The result is an institution dedicated to peace whose members are too busy exchanging missiles to practise it. Like many international bodies before it, the Board of Peace demonstrates that peace, as ever, remains largely aspirational branding.",
    "url": "https://timesofindia.indiatimes.com/world/us/bored-of-board-of-peace-trump-iran-israel-usa-pakistan-war/articleshow/128888906.cms",
    "published": "2026-02-28T20:28:48+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's Board of Peace Members Involved in Military Conflicts",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "5b126bc3e24d918e",
    "title_original": "Did Iran strike US MST warship? All we know amid Trump's ‘Operation Epic Fury’",
    "content_original": "The IRGC announced that a U.S. MST combat support vessel was significantly damaged by its missiles in retaliation to Trump's Operation Epic Fury.",
    "url": "https://www.hindustantimes.com/world-news/us-news/did-iran-strike-us-mst-warship-all-we-know-amid-trumps-operation-epic-fury-101772289582411.html",
    "published": "2026-02-28T20:27:28+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Did Iran strike US MST warship?",
    "relevant": true,
    "translated": true,
    "summary_en": "The IRGC claims to have significantly damaged a US MST combat support vessel using missiles in retaliation to 'Operation Epic Fury' initiated by Trump. This incident, if confirmed, would mark a direct escalation in the conflict involving US naval assets."
  },
  {
    "id": "711a69b196e6069c",
    "title_original": "Ayatollah Ali Khamenei vs Trump vs Netanyahu's net worth: Who is the richest?",
    "content_original": "Ayatollah Ali Khamenei, Iran's Supreme Leader since 1989, is believed to manage a vast financial empire valued between $95 billion and $200 billion.",
    "url": "https://www.hindustantimes.com/world-news/us-news/ayatollah-khamenei-vs-trump-vs-netanyahus-net-worth-who-is-the-richest-101772281314649.html",
    "published": "2026-02-28T20:05:11+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ayatollah Ali Khamenei vs Trump vs Netanyahu's net worth: Who is the richest?",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "c9cfc163c807660d",
    "title_original": "PIA suspends flights to UAE, other Gulf countries amid Middle East crisis",
    "content_original": "View of a Pakistan International Airlines passenger plane. &mdash; APP/File In view of the &ldquo;evolving situation&rdquo; in the Middle East, the Pakistan International Airlines on Saturday suspended its flights to Gulf countries due to the &ldquo;evolving situation in the...",
    "url": "https://www.geo.tv/latest/653431-pia-suspends-flights-to-uae-other-gulf-countries-amid-middle-east-crisis",
    "published": "2026-02-28T20:04:00+05:00",
    "source_name": "Geo TV (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "PIA suspends flights to UAE and other Gulf countries due to Middle East crisis",
    "relevant": true,
    "translated": true,
    "summary_en": "Pakistan International Airlines (PIA) has suspended flights to the UAE and other Gulf countries amid the escalating conflict in the Middle East. This decision reflects growing concerns over regional instability and potential threats to civilian aviation. The move highlights the broader impact of the conflict on regional travel and transportation networks."
  },
  {
    "id": "63aea162ac5d83d9",
    "title_original": "'Obama will attack, will use Iran card': Trump’s old tweet resurfaces after US-Israeli strikes",
    "content_original": "Explosions rocked Tehran after US-Israeli strikes, reviving Donald Trump's 2013 tweet predicting Obama would attack Iran. Now, with \"Operation Epic Fury\" targeting Iran and Tehran retaliating, Trump's past accusations of using Iran for political gain echo.",
    "url": "https://timesofindia.indiatimes.com/world/us/obama-will-attack-will-use-iran-card-trumps-old-tweet-resurfaces-after-us-israeli-strikes/articleshow/128888141.cms",
    "published": "2026-02-28T20:03:26+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's old tweet about Obama attacking Iran resurfaces amid US-Israeli strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "A 2013 tweet by Donald Trump, predicting that Obama would attack Iran, has resurfaced following recent US-Israeli strikes on Tehran. The tweet's revival highlights ongoing debates about the politicization of Iran as an issue, as 'Operation Epic Fury' continues to target Iranian assets and Tehran retaliates. This adds a layer of political commentary to the ongoing military conflict."
  },
  {
    "id": "2b146e163c46f894",
    "title_original": "Fact check: Viral videos do not show Afghan rocket strikes on Pakistani military installations; visuals are old",
    "content_original": "Multiple videos have been circulating on social media platform X since February 27, claiming to show Afghan BM-21 rocket strikes, launched from the Alishero border district, targeting Pakistani military installations. However, the videos are unrelated to the current situation and are old. Pakistan launched Operation Ghazab lil-Haq against the Afghan Taliban, after the neighbouring country opened fire on multiple locations across the border in Khyber Pakhtunkhwa on late Thursday. Authorities in Kabul had called it a response to Pakistani strikes against terrorist hideouts on Afghan soil over the weekend. On Feb 27, a pro-Indian account on X shared a video of buildings set on fire. “Afghan BM-21 rocket strikes have begun from areas of Alishero district targeting Pakistani military installations across the so-called (imaginary) border… look what’s happened,” reads the caption. The post gained 100,800 views. Another pro-Indian account shared the same video with the caption: “Reports of BM ...",
    "url": "https://www.dawn.com/news/1976585/fact-check-viral-videos-do-not-show-afghan-rocket-strikes-on-pakistani-military-installations-visuals-are-old",
    "published": "2026-02-28T19:57:57+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Viral videos falsely claim Afghan rocket strikes on Pakistan military installations",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "ee913bba29d56c12",
    "title_original": "Dubai news live updates: Burj Khalifa evacuated, Dubai airport ops shut as UAE on 'high alert'",
    "content_original": "Dubai news live updates: Dubai airport halted flights after blasts amid US-Israel strikes on Iran. One civilian died in Abu Dhabi earlier after being struck by falling debris.",
    "url": "https://www.hindustantimes.com/world-news/dubai-abu-dhabi-news-live-updates-iran-israel-war-missile-attack-abu-dhabi-explosions-uae-airport-closed-news-101772286839577.html",
    "published": "2026-02-28T19:53:08+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai airport operations shut and Burj Khalifa evacuated amid high alert as UAE faces fallout from US-Israel strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The UAE has placed Dubai on high alert, shutting down airport operations and evacuating the Burj Khalifa after explosions linked to ongoing US-Israel strikes on Iran. A civilian in Abu Dhabi was killed by falling debris, highlighting the regional impact and potential escalation of the conflict."
  },
  {
    "id": "295846aadc281999",
    "title_original": "What's happening in Bahrain, Dubai, and Abu Dhabi right now? Latest updates amid reports of evacuations in Middle East",
    "content_original": "Smoke was seen over parts of Bahrain’s capital, Manama, on Saturday. Flight operations at Dubai International Airport (DXB) have been suspended.",
    "url": "https://www.hindustantimes.com/world-news/us-news/whats-happening-in-bahrain-dubai-and-abu-dhabi-right-now-latest-updates-amid-reports-of-evacuations-in-middle-east-101772286180756.html",
    "published": "2026-02-28T19:45:37+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Smoke seen in Bahrain's capital, flight operations suspended at Dubai Airport",
    "relevant": true,
    "translated": true,
    "summary_en": "Smoke was observed over Manama, Bahrain, and Dubai International Airport halted flight operations, indicating potential military or security incidents in the Gulf region. This development is significant as it suggests possible escalations affecting key US ally states and critical infrastructure amid the ongoing Iran-US conflict."
  },
  {
    "id": "7ab6ab7be33c9aa7",
    "title_original": "‘Huge blow to Indian students’: DHS letter shows US reviewing OPT work rules, STEM likely most affected",
    "content_original": "‘Huge blow to Indian students’: DHS letter shows US reviewing OPT work rules, STEM likely most affected",
    "url": "https://timesofindia.indiatimes.com/world/us/huge-blow-to-indian-students-dhs-letter-shows-us-reviewing-opt-work-rules-stem-likely-most-affected/articleshow/128888069.cms",
    "published": "2026-02-28T19:43:27+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US reviewing OPT work rules for international students",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8ce455f191e6e415",
    "title_original": "India issues advisory to nationals in Israel and Iran; advises immediate registration with embassy in Tel Aviv",
    "content_original": "More than 40,000 Indian nationals currently live and work in Israel; Embassy in Abu Dhabi also urged all Indian nationals “to avoid unnecessary travel”",
    "url": "https://www.thehindu.com/news/national/exercise-utmost-caution-india-issues-advisory-as-israel-us-bombs-iran/article70687439.ece",
    "published": "2026-02-28T19:35:08+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "India issues travel advisory for nationals in Israel and Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "India has advised its citizens in Israel and Iran to register with the embassy in Tel Aviv due to the ongoing conflict. The advisory also urges avoiding unnecessary travel, reflecting concerns over regional instability. This highlights the potential risks for civilians and the broader geopolitical tensions in the Middle East."
  },
  {
    "id": "8ad74cde776d096a",
    "title_original": "Iran fires missiles at Gulf Arab states, one killed in Abu Dhabi",
    "content_original": "State media in the United Arab Emirates said one person had been killed in Abu Dhabi, but ‌gave no details",
    "url": "https://www.thehindu.com/news/international/iran-attack-gulf-states-bahrain-abu-dhabi-kuwait-jordan-qatar-february-28-2026/article70687818.ece",
    "published": "2026-02-28T19:33:14+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran fires missiles at Gulf Arab states, one killed in Abu Dhabi",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missile attacks targeting Gulf Arab states, resulting in one fatality in Abu Dhabi. This escalation demonstrates Iran's continued efforts to strike at US allies in the region. The incident underscores the heightened risk to civilian populations and infrastructure in the Gulf region amidst the ongoing conflict."
  },
  {
    "id": "a70894d4c697b59a",
    "title_original": "‘Science maniac’ wires 400 car batteries together in extreme backyard experiment to see what would happen",
    "content_original": "Drake Anthony, the YouTuber known as Styropyro, scales his high-voltage experiments to 400 car batteries, unleashing currents exceeding 150,000 amps in a backyard test of extreme physics. Framing himself as cautious yet curious, he vaporises metals and triggers a ferrofluid fireball, blurring spectacle and science while showcasing the staggering power latent in everyday automotive batteries at massive scale.",
    "url": "https://timesofindia.indiatimes.com/etimes/trending/science-maniac-wires-400-car-batteries-together-in-extreme-backyard-experiment-to-see-what-would-happen/articleshow/128885002.cms",
    "published": "2026-02-28T19:30:11+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "YouTuber conducts extreme experiment with 400 car batteries",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "a3918fd3ee7b4e5b",
    "title_original": "Ayatollah Ali Khamenei family: Know about Iranian Supreme leader's wife, children and grandkids",
    "content_original": "The US and Israel have launched strikes on Iran, targeting locations linked to Supreme Leader Ayatollah Khamenei, whose whereabouts are unclear.",
    "url": "https://www.hindustantimes.com/world-news/us-news/ayatollah-ali-khamenei-family-know-about-iranian-supreme-leaders-wife-children-and-grandkids-101772281298368.html",
    "published": "2026-02-28T19:26:17+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes targeting locations linked to Ayatollah Khamenei",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel have conducted strikes on locations associated with Iran's Supreme Leader Ayatollah Khamenei, whose current location is unknown. This signifies an escalation targeting Iran's highest leadership and could have significant implications for the conflict's trajectory."
  },
  {
    "id": "c2df2cdfe1a8162a",
    "title_original": "‘The hypocrisy is breathtaking': Trump's Obama-era Iran warnings return as he chooses war amid negotiations",
    "content_original": "Iran's foreign affairs minister Araghchi pulled out an old Trump ‘tweet’ that said Obama would start a war to divert from his domestic political performance",
    "url": "https://www.hindustantimes.com/world-news/the-hypocrisy-is-breathtaking-trumps-obama-era-iran-warnings-return-as-he-chooses-war-amid-negotiations-101772283322090.html",
    "published": "2026-02-28T19:14:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump's past Iran war warnings resurface amid current conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Affairs Minister Araghchi highlighted Trump's past criticism of Obama, drawing a parallel to the current US-Iran conflict. This suggests Iran is attempting to portray the US as hypocritical in its approach to negotiations and military action. The statement reflects the ongoing propaganda war and psychological operations between Iran and the US."
  },
  {
    "id": "8f53b96a0738b12d",
    "title_original": "‘Explosions just 10 km away from home’: Indian man in Dubai shares chilling account amid Iran retaliation",
    "content_original": "Indian man in Dubai reported explosions after Iran’s retaliation following US Israel strikes on Iran.",
    "url": "https://www.hindustantimes.com/trending/explosions-just-10-km-away-from-home-indian-man-in-dubai-shares-chilling-account-amid-iran-retaliation-101772284199017.html",
    "published": "2026-02-28T19:00:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions near Dubai amid Iran retaliation",
    "relevant": true,
    "translated": true,
    "summary_en": "An Indian man in Dubai reported hearing explosions 10 km away following Iran's retaliatory strikes after US and Israeli attacks on Iran. This highlights the regional impact of the conflict and the potential risks for US allies and interests in the Gulf region."
  },
  {
    "id": "793b0cfe7d876e5f",
    "title_original": "ICE cancelled Indian-origin student’s visa over dismissed traffic ticket, court calls move unlawful",
    "content_original": "A US federal court has ruled that Immigration and Customs Enforcement (ICE) unlawfully terminated an Indian student's visa status over a dismissed traffic ticket. The judge criticized the agency's arbitrary decision, which lacked due process and forced the student to halt his studies. The ruling condemns ICE's reliance on minor or dismissed infractions to revoke student visas.",
    "url": "https://timesofindia.indiatimes.com/world/us/ice-cancelled-indian-origin-students-visa-over-dismissed-traffic-ticket-court-calls-move-unlawful/articleshow/128886993.cms",
    "published": "2026-02-28T18:58:30+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "ICE cancelled Indian-origin student's visa over dismissed traffic ticket, court calls move unlawful",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "b7d8950eb1e8c84b",
    "title_original": "UK man charged with criminal damage after pro-Palestinian graffiti on Churchill statue",
    "content_original": "London police said on Saturday a man had been charged with criminal damage for graffitiing a statue of Britain’s World War II prime minister Winston Churchill with pro-Palestinian slogans. The monument in the central Parliament Square was smeared with red paint early on Friday and “Zionist war criminal” among the slogans written on it. The Metropolitan Police said Caspar San Giorgio, 38, of no fixed address, was charged early on Saturday, some 24 hours after his arrest. He had been detained within minutes of officers being alerted to the incident, according to the force. He was due to appear at a London magistrates’ court later on Saturday. The words “free Palestine” and “stop the genocide” were also sprayed on the statue, which workers cleaned off on Friday. The incident prompted Prime Minister Keir Starmer’s office to call the damage “completely abhorrent” and commend police for the swift arrest. “Churchill was a great Briton,” a spokesman said. The 3.6 metre Churchill statue has bee...",
    "url": "https://www.dawn.com/news/1976544/uk-man-charged-with-criminal-damage-after-pro-palestinian-graffiti-on-churchill-statue",
    "published": "2026-02-28T18:57:53+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "UK man charged for pro-Palestinian graffiti on Churchill statue",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "34781e8fd8ed2dd5",
    "title_original": "Iran strikes U.S. bases: Complete list of bases under attack",
    "content_original": "Iran struck U.S. military bases across six Middle Eastern countries after U.S.-Israel joint operation. Here’s the full list of locations targeted",
    "url": "https://www.thehindu.com/news/international/iran-strikes-us-bases-complete-list-of-bases-under-attack/article70688056.ece",
    "published": "2026-02-28T18:52:19+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran strikes U.S. bases: Complete list of bases under attack",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched attacks on U.S. military bases in six Middle Eastern countries in retaliation for a U.S.-Israel joint operation. The strikes targeted multiple locations, indicating a significant escalation in hostilities. This development highlights the widening geographic scope of the conflict and the direct engagement between Iran and U.S. forces in the region."
  },
  {
    "id": "6df783e5b72f2cae",
    "title_original": "What is the IRGC and how did it start? Trump issues stark ultimatum to Iranian forces, ‘Surrender or face death’",
    "content_original": "Donald Trump labeled the attacks on Iran a noble mission, asserting they are crucial to counter Tehran's nuclear ambitions.",
    "url": "https://www.hindustantimes.com/world-news/us-news/what-is-the-irgc-and-how-did-it-start-trump-tells-elite-wing-of-irans-military-to-surrender-or-face-death-101772279847429.html",
    "published": "2026-02-28T18:52:05+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump issues ultimatum to IRGC forces in Iran: ‘Surrender or face death’",
    "relevant": true,
    "translated": true,
    "summary_en": "US President Donald Trump has issued a direct ultimatum to Iranian IRGC forces, demanding their surrender to avoid lethal consequences. This statement comes as part of the ongoing US military campaign against Iran, which Trump characterizes as a noble mission to counter Iran's nuclear ambitions. The ultimatum signifies an escalation in the conflict and underscores the US's strategic objective of dismantling Iran's nuclear program and weakening the IRGC."
  },
  {
    "id": "6b2b3817959ab470",
    "title_original": "US-Iran conflict: Chilling World War 3 predictions surface after Trump's latest military strikes",
    "content_original": "Amid rising tensions, social media users began sharing references to the predictions of mystics Baba Vanga and Nostradamus.",
    "url": "https://www.hindustantimes.com/world-news/us-news/us-iran-conflict-update-world-war-3-predictions-by-baba-vanga-nostradamus-surface-after-trumps-latest-military-strikes-101772282909214.html",
    "published": "2026-02-28T18:50:53+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Chilling World War 3 predictions surface after Trump's latest military strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses social media reactions to predictions by mystics Baba Vanga and Nostradamus about World War 3 following recent US military strikes. This is relevant as it reflects public discourse and perceptions of escalation in the ongoing US-Iran conflict."
  },
  {
    "id": "bac52970696ec9c5",
    "title_original": "Pakistani refugee who returned home six times secures chance to keep Canadian status",
    "content_original": "Pakistani refugee who returned home six times secures chance to keep Canadian status",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/marriage-birth-of-child-deaths-of-parents-pakistani-refugee-who-returned-home-six-times-secures-chance-to-keep-canadian-status/articleshow/128885288.cms",
    "published": "2026-02-28T18:49:21+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani refugee allowed to keep Canadian status despite multiple returns home",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "d83054463aba541f",
    "title_original": "'Black smoke, multiple emergency alerts’: Indian mom’s firsthand account of Bahrain’s sudden emergency",
    "content_original": "After the joint Israel-US strikes, US bases across the UAE, Bahrain, and Qatar were hit by Iran.",
    "url": "https://www.hindustantimes.com/trending/black-smoke-multiple-emergency-alerts-indian-mom-s-firsthand-account-of-bahrain-s-sudden-emergency-101772283349743.html",
    "published": "2026-02-28T18:35:12+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran retaliates by hitting US bases in Bahrain after joint Israel-US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched retaliatory attacks targeting US bases in Bahrain following joint Israel-US strikes. This indicates an escalation in the conflict as Iran responds to US and Israeli actions, with potential implications for regional stability and the safety of US personnel in the Gulf region."
  },
  {
    "id": "e6eb3afd0d7140c7",
    "title_original": "Iran's Revolutionary Guard commander Mohammad Pakpour likely killed in Israel-US strikes",
    "content_original": "Pakpour was appointed after his predecessor Hossein Salami was one of several key military figures killed in an Israeli strike during the war in June 2025.",
    "url": "https://www.hindustantimes.com/world-news/iran-revolutionary-guard-commander-mohammad-pakpour-likely-killed-in-israel-us-strikes-101772280704836.html",
    "published": "2026-02-28T18:29:40+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Revolutionary Guard commander Mohammad Pakpour likely killed in Israel-US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Mohammad Pakpour, the commander of Iran's Revolutionary Guard, is reportedly killed in strikes by Israel and the US. This follows the death of his predecessor Hossein Salami in an Israeli strike in June 2025. The loss of another high-ranking IRGC commander signifies a significant blow to Iran's military leadership amidst ongoing hostilities."
  },
  {
    "id": "196b0397f696f299",
    "title_original": "‘Gotta get out of here’: American reacts to Iranian attack on naval base in Bahrain — watch",
    "content_original": "Iran launched missile strikes targeting the US Navy's Fifth Fleet base in Bahrain, causing panic among residents, including Americans. Bahrain confirmed the attack as a violation of its sovereignty. This incident followed a coordinated US-Israel military operation against Iran, which reported explosions and retaliatory drone and missile launches.",
    "url": "https://timesofindia.indiatimes.com/world/us/gotta-get-out-of-here-american-reacts-to-iranian-attack-on-naval-base-in-bahrain-watch/articleshow/128884770.cms",
    "published": "2026-02-28T18:28:03+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran attacks US Navy's Fifth Fleet base in Bahrain",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missile strikes targeting the US Navy's Fifth Fleet base in Bahrain, violating Bahraini sovereignty. The attack followed a coordinated US-Israel operation against Iran, which retaliated with drone and missile launches. This incident signifies escalating hostilities and direct targeting of US military assets in the region."
  },
  {
    "id": "34bf9e5c8d3b337b",
    "title_original": "World holds breath as U.S., Israel strike Iran",
    "content_original": "Calling on Iranians to stand up to their government, Mr. Trump added, “The hour of your freedom is at hand”;",
    "url": "https://www.thehindu.com/news/international/world-holds-breath-as-us-israel-strike-iran/article70687884.ece",
    "published": "2026-02-28T18:26:59+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S. and Israel launch strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "The U.S. and Israel have conducted joint strikes on Iran, marking a significant escalation in the ongoing conflict. The strikes likely targeted Iranian military or nuclear facilities, demonstrating increased coordination between the U.S. and Israel against Iran. This development raises concerns about further escalation and potential Iranian retaliation against U.S. and Israeli interests in the region."
  },
  {
    "id": "e28ba5872197d5cc",
    "title_original": "Information ministry rubbishes claim about Pakistani jet being shot down in Afghanistan’s Nangarhar",
    "content_original": "The Ministry of Information and Broadcasting on Saturday rejected claims about a Pakistani jet being shot down in Afghanistan’s Nangarhar and the pilot being captured. The ministry’s fact check account on X attributed the claims to Afghan Taliban officials that were “amplified by Indian media”. “The Ministry of Defence of the so-called Islamic Emirate claimed that Afghan forces shot down a Pakistani fighter jet in Nangarhar and captured its pilot alive. The claim was widely amplified by Indian media and Afghan propaganda outlets,” it said. The ministry further said Pakistan’s armed forces had not reported any aircraft loss and stated that no “independent international media outlet or defence monitoring agency” had verified the claim. “The story relies solely on statements from Afghan officials and selective media amplification,” it said. It further stated that there was no visual proof of crash debris, the wreckage site or the captured pilot. “No geolocated imagery or satellite evidenc...",
    "url": "https://www.dawn.com/news/1976509/information-ministry-rubbishes-claim-about-pakistani-jet-being-shot-down-in-afghanistans-nangarhar",
    "published": "2026-02-28T18:24:13+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Pakistani jet shot down claim in Afghanistan's Nangarhar debunked",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "89337a103d6c2fdd",
    "title_original": "'Did World War 3 just start?': US-Iran escalation sparks fears on social media",
    "content_original": "The US and Israel's recent attack on Iran has led to widespread speculation on social media about the possibility of World War 3.",
    "url": "https://www.hindustantimes.com/world-news/us-news/did-world-war-3-just-start-us-iran-escalation-sparks-fears-on-social-media-101772282225662.html",
    "published": "2026-02-28T18:20:06+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US-Iran escalation sparks World War 3 fears on social media",
    "relevant": true,
    "translated": true,
    "summary_en": "The recent US and Israeli attack on Iran has fueled widespread speculation on social media about the potential onset of World War 3. This highlights growing global concerns over the escalating conflict between the US and Iran. The incident underscores the heightened tensions and potential for broader regional or global escalation."
  },
  {
    "id": "cccbf6f4bfa3c37d",
    "title_original": "‘Bombing a sovereign country is not preemptive’: Politicians, analysts react as US and Israel strike Iran",
    "content_original": "The United States and Israel launched a wave of strikes against targets in Iran on Saturday, triggering explosions in the capital Tehran and an escalation across the region. “We are going to destroy their missiles and raze their missile industry to the ground. It will be totally — again — obliterated. We’re going to annihilate their navy,” said US President Donald Trump in an address from his Florida home posted to his Truth Social platform. On the other hand, Israeli Prime Minister Benjamin Netanyahu said the operation aimed to “remove the existential threat posed by the terrorist regime in Iran”, and urged Iranians to overthrow the Islamic Republic’s clerical leadership. In response to the Israel-US aggression, the Islamic Revolutionary Guard Corps of Iran later in the day confirmed the launch of the “first wave” of missile and drone attacks against Israel in response to the strikes on its territory. Political figures and analysts in Pakistan have condemned the recent developments, p...",
    "url": "https://www.dawn.com/news/1976454/bombing-a-sovereign-country-is-not-preemptive-politicians-analysts-react-as-us-and-israel-strike-iran",
    "published": "2026-02-28T18:15:37+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "US and Israel launch strikes on Iran, triggering regional escalation",
    "relevant": true,
    "translated": true,
    "summary_en": "The US and Israel conducted coordinated strikes on Iranian targets, causing explosions in Tehran and escalating regional tensions. The attacks targeted Iran's missile capabilities and naval assets, with US President Trump vowing to destroy Iran's missile industry and navy, while Israeli PM Netanyahu aimed to eliminate the 'existential threat' from Iran. The escalation marks a significant intensification of the conflict, with potential for broader regional implications."
  },
  {
    "id": "0179d7f3cebbb9eb",
    "title_original": "'Catastrophe', 'dangerous adventure': How world leaders reacted to Israel-US joint strikes on Iran",
    "content_original": "European Union warned that the escalating situation in the region was \"perilous\" and called for civilians to be protected after US,Israel strikes on Iran",
    "url": "https://www.hindustantimes.com/world-news/perilious-dangerous-adventure-how-world-leaders-reacted-to-israel-us-joint-strikes-on-iran-101772276179542.html",
    "published": "2026-02-28T18:10:50+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "World leaders react to Israel-US joint strikes on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "World leaders, including the European Union, have expressed concern over the escalating situation following joint strikes by the US and Israel on Iran. The EU warned of the 'perilous' nature of the conflict and emphasized the need to protect civilians. This indicates growing international concern over the potential for regional escalation and civilian casualties."
  },
  {
    "id": "4e506d598f63ada6",
    "title_original": "Iranian missile hit US Navy base in Bahrain amid Middle East tensions",
    "content_original": "Bahraini authorities confirmed that the area of Juffair, where the US naval headquarters is located, was hit.",
    "url": "https://www.hindustantimes.com/world-news/iranian-missile-hit-us-navy-base-in-bahrain-amid-middle-east-tensions-101772281638722.html",
    "published": "2026-02-28T18:10:04+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranian missile hits US Navy base in Bahrain",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched a missile strike targeting the US Navy base in Juffair, Bahrain. The attack hit the area housing the US naval headquarters. This escalation signifies direct Iranian aggression against US military assets in the Gulf amid heightened regional tensions."
  },
  {
    "id": "67a8d360591722ff",
    "title_original": "'Why did Trump….: Congress raises Act of War question after Iran strikes; POTUS in trouble",
    "content_original": "Iran-US strikes update: President Donald Trump is facing backlash domestically after he announced a military action aagainst Iran",
    "url": "https://www.hindustantimes.com/world-news/us-news/why-did-trump-attack-iran-congress-raises-act-of-war-question-after-israel-uae-dubai-bahrain-strikes-101772280310571.html",
    "published": "2026-02-28T18:09:22+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Congress questions Trump's military action against Iran as Act of War",
    "relevant": true,
    "translated": true,
    "summary_en": "Congress is scrutinizing President Trump's military action against Iran, framing it as an Act of War and criticizing the POTUS for potential repercussions. This domestic backlash highlights the political fallout within the US regarding the ongoing conflict with Iran."
  },
  {
    "id": "2fb99b3c127b3d22",
    "title_original": "Dubai airport suspends operations, fresh blasts heard amid Iran strikes",
    "content_original": "Passengers are urged not to travel to the airport and to contact their respective airlines directly for the latest information on flight schedules.",
    "url": "https://www.hindustantimes.com/world-news/dubai-airport-suspends-operations-as-irans-middle-east-strikes-hit-uae-101772282304604.html",
    "published": "2026-02-28T18:08:55+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Dubai airport suspends operations amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Dubai airport has halted operations following fresh blasts heard during ongoing Iran strikes, impacting regional air travel and potentially indicating a broader escalation in hostilities affecting critical infrastructure in the UAE."
  },
  {
    "id": "7defed233768eef0",
    "title_original": "57 students killed, 60 injured in Iran in US-Israeli strikes in school",
    "content_original": "In a separate attack at a school in east of Tehran, at least two students were killed, reported Iran’s Mehr news agency.",
    "url": "https://www.hindustantimes.com/world-news/at-least-42-students-killed-in-us-israeli-strikes-on-schools-iran-authorities-101772281200990.html",
    "published": "2026-02-28T17:58:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "57 students killed, 60 injured in Iran in US-Israeli strikes on school",
    "relevant": true,
    "translated": true,
    "summary_en": "US and Israeli forces reportedly conducted strikes on a school in Iran, resulting in the deaths of 57 students and injuring 60 others. The attack occurred in an unspecified location, with a separate incident in east Tehran killing at least two more students. This represents a significant escalation in targeting civilian infrastructure and could provoke further Iranian retaliation."
  }
]