[
  {
    "id": "faa2a78c8b40a019",
    "title_original": "Watch: U.S.-Israel strike Iran: What really happened| Explained",
    "content_original": "On February 28, 2026, the U.S. and Israel launched joint strikes on Iran in Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran.",
    "url": "https://www.thehindu.com/videos/watch-us-israel-strike-iran-what-really-happened-explained/article70688988.ece",
    "published": "2026-02-28T21:18:21+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S.-Israel strike Iran: What really happened| Explained",
    "relevant": true,
    "translated": true,
    "summary_en": "On February 28, 2026, the U.S. and Israel conducted joint strikes on Iran, codenamed Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran. This operation signifies a significant escalation in the ongoing conflict, showcasing coordinated military action between the U.S. and Israel against Iran's strategic assets. The strikes are likely intended to degrade Iran's military capabilities and deter further aggression in the region."
  },
  {
    "id": "fe512b1493748ee3",
    "title_original": "Watch: Iranians react with defiance after U.S.-Israel strikes",
    "content_original": "Iranians react with a mix of defiance, fear, and uncertainty following the latest strikes. While some vow that Iran will never bow down, others express concern about escalation, civilian safety, and what comes next for the region.",
    "url": "https://www.thehindu.com/videos/watch-iranians-react-with-defiance-after-us-israel-strikes/article70688982.ece",
    "published": "2026-02-28T21:17:26+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranians react with defiance after US-Israel strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian citizens are responding with defiance, fear, and uncertainty following recent US-Israel strikes on Iran. The reactions highlight a mix of resolve to resist and concerns about escalation and civilian safety, reflecting the broader regional impact and uncertainty about future developments in the conflict."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:11:25+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Supreme Leader Khamenei to give a speech amid ongoing conflict with Israel and US",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Khamenei is set to deliver a speech as tensions escalate with Israel and the US. The conflict involves Iranian strikes on US military bases in Kuwait, Qatar, the UAE, and Jordan, while Israeli PM Netanyahu emphasizes ending the threat from the Ayatollah regime. This signifies potential further escalation and strategic implications for regional stability and US forces in the Middle East."
  },
  {
    "id": "83e1931c39cb08cc",
    "title_original": "Iran to witness regime change? Foreign Minister Abbas Araghchi makes huge statement on Trump's plans",
    "content_original": "Iran's foreign minister Abbas Araghchi claims Trump's regime change goal is unattainable.",
    "url": "https://www.hindustantimes.com/world-news/us-news/iran-to-witness-regime-change-foreign-minister-abbas-araghchi-makes-huge-statement-on-trumps-plans-101772292738356.html",
    "published": "2026-02-28T21:08:26+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's foreign minister dismisses Trump's regime change goal",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Minister Abbas Araghchi stated that the US's alleged plans for regime change in Iran are unattainable. This statement comes amidst ongoing armed conflict between Iran and the US, highlighting the continued tensions and Iran's defiance against external threats. The statement is significant as it reflects Iran's stance on the conflict and its resistance to US pressure."
  },
  {
    "id": "0a86e97d326b8cc2",
    "title_original": "Fairmont Hotel in Palm Jumeirah hit? Videos show fire, smoke in Dubai amid Iran strikes",
    "content_original": "Videos allegedly showing fire and smoke near Fairmont The Palm hotel on Dubai’s Palm Jumeirah surfaced.",
    "url": "https://www.hindustantimes.com/world-news/fairmont-hotel-in-palm-jumeirah-hit-videos-show-fire-smoke-in-dubai-amid-iran-strikes-101772292705312.html",
    "published": "2026-02-28T21:08:07+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fairmont Hotel in Dubai's Palm Jumeirah hit amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Unconfirmed reports indicate that the Fairmont The Palm hotel in Dubai's Palm Jumeirah was hit, with videos showing fire and smoke in the area. This incident comes amid escalating tensions and strikes by Iran, potentially marking an expansion of the conflict into civilian areas in the UAE. The strategic significance lies in the potential disruption of tourism and business in Dubai and the broader implications for regional stability."
  },
  {
    "id": "7d4afc527d752e0b",
    "title_original": "Indian founder aboard Qatar Airways flight records pilot’s diversion announcement amid Iran retaliation",
    "content_original": "An Indian founder shared how a Qatar Airways flight to Barcelona was diverted back to Doha after Iraqi airspace closed amid escalating Middle East tensions.",
    "url": "https://www.hindustantimes.com/trending/indian-founder-aboard-qatar-airways-flight-records-pilot-s-diversion-announcement-amid-iran-retaliation-101772291884494.html",
    "published": "2026-02-28T21:07:09+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Qatar Airways flight diverted due to Iraq airspace closure amid Iran-US conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "A Qatar Airways flight from Doha to Barcelona was diverted back to Doha after Iraq closed its airspace due to escalating tensions in the Middle East. The incident highlights the broader impact of the Iran-US conflict on civilian aviation and regional stability. The diversion underscores the risks and disruptions faced by commercial airlines operating near conflict zones."
  },
  {
    "id": "59f2079cf194fa45",
    "title_original": "Iran vs Israel | Chronicles of a war foretold",
    "content_original": "America and Israel seek regime change and a permanent shift in the balance of power in West Asia. For the Islamic Republic, this is a war of survival",
    "url": "https://www.thehindu.com/news/international/iran-vs-israel-chronicles-of-a-war-foretold/article70688723.ece",
    "published": "2026-02-28T21:04:13+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran vs Israel: Chronicles of a War Foretold",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the ongoing conflict between Iran and Israel, with the US supporting regime change in Iran. This is framed as a war of survival for Iran against the US and Israel, highlighting the strategic significance of the conflict in West Asia."
  },
  {
    "id": "ea51a6922ea82500",
    "title_original": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "content_original": "Iran's Supreme Leader Ayatollah Ali Khamenei is alive, the country's finance minister confirmed",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-makes-big-move-amid-dead-rumors-iran-supreme-leader-first-response-to-us-israel-strikes-101772291485510.html",
    "published": "2026-02-28T20:54:58+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Ayatollah Ali Khamenei has made a significant move and issued his first response to recent US strikes, confirming his survival amid rumors of his death. This development is crucial as it demonstrates continued leadership and potential strategic direction for Iran during the ongoing conflict with the US. Khamenei's response could indicate Iran's next steps in the escalation or de-escalation of hostilities."
  },
  {
    "id": "46592b160d24909b",
    "title_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "content_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-white-men-allowed-row-over-toronto-university-only-hiring-professors-on-basis-of-gender-identity/articleshow/128889863.cms",
    "published": "2026-02-28T20:54:41+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Toronto University under fire for hiring policy based on gender identity",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9a5e03a5d7052f1f",
    "title_original": "Trump to deliver any remarks on strikes in Iran today? A look at his public agenda as US launches 'Op Epic Fury'",
    "content_original": "President Trump is not expected to make further public statements on the Iran strikes today, according to White House officials.",
    "url": "https://www.hindustantimes.com/world-news/us-news/donald-trump-to-deliver-any-remarks-on-strikes-in-iran-today-a-look-at-his-public-agenda-as-us-launches-op-epic-fury-101772290712176.html",
    "published": "2026-02-28T20:52:18+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump not expected to comment on Iran strikes today",
    "relevant": true,
    "translated": true,
    "summary_en": "President Trump is unlikely to make additional public statements on the ongoing US strikes in Iran, as per White House officials. This comes as the US launches 'Op Epic Fury' against Iranian targets. The silence may reflect a strategic decision to avoid escalating tensions through public remarks."
  }
]