[
  {
    "id": "2ae71386b192ff20",
    "title_original": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "content_original": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "url": "https://www.thehindu.com/news/international/iran-condemns-barbaric-attack-on-school-after-us-israeli-strikes-says-khamenei-is-alive/article70689136.ece",
    "published": "2026-02-28T22:19:56+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran condemns 'barbaric' attack on school after U.S., Israeli strikes; says Khamenei is ‘alive’",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has condemned a 'barbaric' attack on a school following U.S. and Israeli strikes, while also addressing rumors by confirming that Supreme Leader Khamenei is alive. This suggests ongoing tensions and potential escalation as Iran reacts to recent military actions by the U.S. and Israel, with propaganda efforts to maintain domestic stability."
  },
  {
    "id": "0c4ba8dd9e032963",
    "title_original": "'Side pe ho jao, bhaago': Man screams as missile falls in Qatar amid US-Iran conflict",
    "content_original": "Residents of Barwa City in Doha witnessed a missile strike and loud explosion after Iran launched attacks.&nbsp;",
    "url": "https://www.hindustantimes.com/world-news/side-pe-ho-jao-bhaago-man-screams-as-missile-falls-in-qatar-amid-us-iran-conflict-101772291924248.html",
    "published": "2026-02-28T22:12:40+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Missile falls in Qatar amid US-Iran conflict",
    "translated": true,
    "relevant": true,
    "summary_en": "A missile struck Doha's Barwa City in Qatar following Iranian attacks, causing a loud explosion. This incident highlights the regional escalation and potential threat to Gulf states amid the US-Iran conflict. The strike underscores the risk of collateral damage and regional instability as hostilities continue."
  },
  {
    "id": "e91564d035b73b42",
    "title_original": "Indian Embassy in Israel advises citizens to register to ensure swift assistance",
    "content_original": "The embassy said that registration will enable the Embassy to contact citizens promptly.",
    "url": "https://www.hindustantimes.com/world-news/indian-embassy-in-israel-advises-citizens-to-register-to-ensure-swift-assistance-101772285604219.html",
    "published": "2026-02-28T22:09:37+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian Embassy in Israel advises citizens to register for assistance",
    "translated": true,
    "relevant": true,
    "summary_en": "The Indian Embassy in Israel is advising its citizens to register to ensure they can be contacted swiftly for assistance. This move comes amid escalating regional tensions due to the ongoing conflict between Iran and the US, which could potentially impact Israel's security. The registration is aimed at providing prompt support and updates to Indian nationals in case of any emergency or escalation."
  },
  {
    "id": "f231c8f42e4345bb",
    "title_original": "‘We heard sirens across the region’: Indian man in Kuwait recalls tense moments during Iran retaliation",
    "content_original": "Amid Iran’s counterattacks, an Indian man in Kuwait described hearing sirens and receiving safety alerts while tensions escalated.",
    "url": "https://www.hindustantimes.com/trending/we-heard-sirens-across-the-region-indian-man-in-kuwait-recalls-tense-moments-during-iran-retaliation-101772295433661.html",
    "published": "2026-02-28T22:09:14+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Indian man in Kuwait recalls hearing sirens during Iran’s retaliation",
    "translated": true,
    "relevant": true,
    "summary_en": "An Indian man in Kuwait reported hearing sirens and receiving safety alerts amid escalating tensions from Iran's retaliatory attacks. This highlights the regional impact of the conflict and the fear of escalation affecting civilians and foreign nationals in neighboring countries."
  },
  {
    "id": "127f9f6832cd6c08",
    "title_original": "‘Looks like incompetent Indians …’: Row over Shanti Narra attending NJ transit board meeting online",
    "content_original": "‘Looks like incompetent Indians …’: Row over Shanti Narra attending NJ transit board meeting online",
    "url": "https://timesofindia.indiatimes.com/world/us/looks-like-incompetent-indians-row-over-shanti-narra-attending-new-jersey-transit-board-meeting-online/articleshow/128891741.cms",
    "published": "2026-02-28T22:09:10+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Row over NJ transit board member attending meeting online",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "fd7586cfdb4ca982",
    "title_original": "Full list of places where explosions were heard in Dubai today",
    "content_original": "Dubai authorities also confirmed an “incident” in Palm Jumeirah, while precautionary evacuations and airspace closures followed across the emirate.",
    "url": "https://www.hindustantimes.com/world-news/full-list-of-places-where-explosions-blasts-were-heard-in-dubai-today-fairmont-palm-jumeirah-burj-khalifa-101772296159043.html",
    "published": "2026-02-28T22:04:17+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Explosions heard across multiple locations in Dubai",
    "translated": true,
    "relevant": true,
    "summary_en": "Explosions were reported in various locations in Dubai, including an incident in Palm Jumeirah, prompting precautionary evacuations and airspace closures. This raises concerns about potential attacks or incidents amidst the ongoing Iran-US conflict, given Dubai's proximity to the conflict zone and its strategic importance."
  },
  {
    "id": "0f750c93df486b38",
    "title_original": "‘No ship allowed’: Iran’s blocks Strait of Hormuz; US urges ships to avoid Gulf after US-Israel strike",
    "content_original": "Vessels transiting the Strait of Hormuz are reportedly receiving radio warnings, attributed to Iran's Revolutionary Guards, stating passage is prohibited. This critical oil route, vital for global energy supplies, faces heightened tensions following recent regional strikes. Iran has not officially confirmed issuing such an order, raising concerns for commercial shipping.",
    "url": "https://timesofindia.indiatimes.com/world/middle-east/no-ship-allowed-irans-blocks-strait-of-hormuz-us-urges-ships-to-avoid-gulf-after-us-israel-strike/articleshow/128891440.cms",
    "published": "2026-02-28T21:54:24+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran blocks Strait of Hormuz; US warns ships to avoid Gulf after US-Israel strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran's Revolutionary Guards have reportedly issued radio warnings prohibiting vessel passage through the Strait of Hormuz, a critical global oil route. The US has responded by urging ships to avoid the Gulf following recent strikes by the US and Israel. This escalation threatens to disrupt global energy supplies and further heightens regional tensions."
  },
  {
    "id": "2e71241aeeb3b1ee",
    "title_original": "Police issue public safety advisory as Karachi placed on high alert amid Pak-Afghan tensions",
    "content_original": "KARACHI: Amid escalating tensions between Pakistan and Afghanistan, police on Saturday issued a public safety advisory which stated that Karachi had been placed on “high alert”. The advisory issued by the office of the Karachi additional inspector general of police, a copy of which is available with Dawn , said, “Karachi has been placed on high alert following increased military tensions between Pakistan and Afghan Taliban forces near the Pak-Afghan border.” “Police and other law enforcement agencies (LEAs) have strengthened surveillance and tightened security at key entry-exit points, transportation hubs, sensitive and important places to pre-empt potential security threats,” it said. In the safety guidelines for residents and visitors, the Karachi police urged them to stay vigilant and alert to announcements from local police, law enforcement and provincial officials. The advisory urged the citizens to report suspicious activity and immediately notify local police or emergency servic...",
    "url": "https://www.dawn.com/news/1976635/police-issue-public-safety-advisory-as-karachi-placed-on-high-alert-amid-pak-afghan-tensions",
    "published": "2026-02-28T21:52:56+05:00",
    "source_name": "Dawn (Pakistan)",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Karachi on high alert as Pak-Afghan tensions escalate",
    "translated": true,
    "relevant": false,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "8b2aab80ed40ac1e",
    "title_original": "Will gold and silver prices break records? Experts raise alarm amid US-Iran-Israel conflict",
    "content_original": "Gold and silver prices are expected to rise sharply on Monday amid escalating Israel-Iran tensions, pushing investors to safe-haven assets.",
    "url": "https://www.hindustantimes.com/world-news/us-news/will-gold-and-silver-prices-break-records-experts-raise-worries-amid-us-iran-israel-conflict-101772294045996.html",
    "published": "2026-02-28T21:49:19+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Gold and silver prices expected to rise amid escalating Israel-Iran tensions",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses the potential for gold and silver prices to rise sharply due to escalating tensions between Israel and Iran. This is significant as it reflects the broader economic and market impacts of the ongoing conflict, with investors seeking safe-haven assets amid geopolitical uncertainty."
  },
  {
    "id": "20235c1d6cddc2ea",
    "title_original": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "content_original": "US and Israeli strikes on Iran triggered explosions near Khamenei’s office, bringing renewed attention to Iran’s leadership succession process.",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-succession-order-who-could-replace-irans-supremo-after-us-strikes-101772294565735.html",
    "published": "2026-02-28T21:45:13+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ayatollah Ali Khamenei succession order: Who could replace Iran's supremo after US strikes?",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses potential successors to Ayatollah Ali Khamenei following recent US and Israeli strikes near his office, highlighting the significance of leadership continuity in Iran amidst ongoing conflict. This is relevant due to the direct impact of military strikes on Iran's leadership and the potential for escalation or changes in strategic decision-making."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:43:59+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "relevant": true,
    "translated": true
  },
  {
    "id": "faa2a78c8b40a019",
    "title_original": "Watch: U.S.-Israel strike Iran: What really happened| Explained",
    "content_original": "On February 28, 2026, the U.S. and Israel launched joint strikes on Iran in Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran.",
    "url": "https://www.thehindu.com/videos/watch-us-israel-strike-iran-what-really-happened-explained/article70688988.ece",
    "published": "2026-02-28T21:18:21+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "U.S.-Israel strike Iran: What really happened| Explained",
    "relevant": true,
    "translated": true,
    "summary_en": "On February 28, 2026, the U.S. and Israel conducted joint strikes on Iran, codenamed Operation Epic Fury/Roaring Lion, targeting nuclear sites, missile facilities, and leadership in Tehran. This operation signifies a significant escalation in the ongoing conflict, showcasing coordinated military action between the U.S. and Israel against Iran's strategic assets. The strikes are likely intended to degrade Iran's military capabilities and deter further aggression in the region."
  },
  {
    "id": "fe512b1493748ee3",
    "title_original": "Watch: Iranians react with defiance after U.S.-Israel strikes",
    "content_original": "Iranians react with a mix of defiance, fear, and uncertainty following the latest strikes. While some vow that Iran will never bow down, others express concern about escalation, civilian safety, and what comes next for the region.",
    "url": "https://www.thehindu.com/videos/watch-iranians-react-with-defiance-after-us-israel-strikes/article70688982.ece",
    "published": "2026-02-28T21:17:26+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iranians react with defiance after US-Israel strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iranian citizens are responding with defiance, fear, and uncertainty following recent US-Israel strikes on Iran. The reactions highlight a mix of resolve to resist and concerns about escalation and civilian safety, reflecting the broader regional impact and uncertainty about future developments in the conflict."
  },
  {
    "id": "65fe8862cfb7c6d0",
    "title_original": "Iran-Israel conflict LIVE: Iran's supreme leader Khamenei to give a speech shortly, says broadcaster",
    "content_original": "\"The aim of the operation is to put an end to the threat from the Ayatollah regime in Iran,\" says Israeli PM Netanyahu; Iran has targeted U.S. military bases in Kuwait, Qatar, the UAE, and Jordan",
    "url": "https://www.thehindu.com/news/international/iran-israel-usa-conflict-strikes-attack-west-asia-us-trump-live-updates-february-28-2026/article70687247.ece",
    "published": "2026-02-28T21:11:25+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's Supreme Leader Khamenei to give a speech amid ongoing conflict with Israel and US",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Khamenei is set to deliver a speech as tensions escalate with Israel and the US. The conflict involves Iranian strikes on US military bases in Kuwait, Qatar, the UAE, and Jordan, while Israeli PM Netanyahu emphasizes ending the threat from the Ayatollah regime. This signifies potential further escalation and strategic implications for regional stability and US forces in the Middle East."
  },
  {
    "id": "83e1931c39cb08cc",
    "title_original": "Iran to witness regime change? Foreign Minister Abbas Araghchi makes huge statement on Trump's plans",
    "content_original": "Iran's foreign minister Abbas Araghchi claims Trump's regime change goal is unattainable.",
    "url": "https://www.hindustantimes.com/world-news/us-news/iran-to-witness-regime-change-foreign-minister-abbas-araghchi-makes-huge-statement-on-trumps-plans-101772292738356.html",
    "published": "2026-02-28T21:08:26+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran's foreign minister dismisses Trump's regime change goal",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Foreign Minister Abbas Araghchi stated that the US's alleged plans for regime change in Iran are unattainable. This statement comes amidst ongoing armed conflict between Iran and the US, highlighting the continued tensions and Iran's defiance against external threats. The statement is significant as it reflects Iran's stance on the conflict and its resistance to US pressure."
  },
  {
    "id": "0a86e97d326b8cc2",
    "title_original": "Fairmont Hotel in Palm Jumeirah hit? Videos show fire, smoke in Dubai amid Iran strikes",
    "content_original": "Videos allegedly showing fire and smoke near Fairmont The Palm hotel on Dubai’s Palm Jumeirah surfaced.",
    "url": "https://www.hindustantimes.com/world-news/fairmont-hotel-in-palm-jumeirah-hit-videos-show-fire-smoke-in-dubai-amid-iran-strikes-101772292705312.html",
    "published": "2026-02-28T21:08:07+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Fairmont Hotel in Dubai's Palm Jumeirah hit amid Iran strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Unconfirmed reports indicate that the Fairmont The Palm hotel in Dubai's Palm Jumeirah was hit, with videos showing fire and smoke in the area. This incident comes amid escalating tensions and strikes by Iran, potentially marking an expansion of the conflict into civilian areas in the UAE. The strategic significance lies in the potential disruption of tourism and business in Dubai and the broader implications for regional stability."
  },
  {
    "id": "7d4afc527d752e0b",
    "title_original": "Indian founder aboard Qatar Airways flight records pilot’s diversion announcement amid Iran retaliation",
    "content_original": "An Indian founder shared how a Qatar Airways flight to Barcelona was diverted back to Doha after Iraqi airspace closed amid escalating Middle East tensions.",
    "url": "https://www.hindustantimes.com/trending/indian-founder-aboard-qatar-airways-flight-records-pilot-s-diversion-announcement-amid-iran-retaliation-101772291884494.html",
    "published": "2026-02-28T21:07:09+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Qatar Airways flight diverted due to Iraq airspace closure amid Iran-US conflict",
    "relevant": true,
    "translated": true,
    "summary_en": "A Qatar Airways flight from Doha to Barcelona was diverted back to Doha after Iraq closed its airspace due to escalating tensions in the Middle East. The incident highlights the broader impact of the Iran-US conflict on civilian aviation and regional stability. The diversion underscores the risks and disruptions faced by commercial airlines operating near conflict zones."
  },
  {
    "id": "59f2079cf194fa45",
    "title_original": "Iran vs Israel | Chronicles of a war foretold",
    "content_original": "America and Israel seek regime change and a permanent shift in the balance of power in West Asia. For the Islamic Republic, this is a war of survival",
    "url": "https://www.thehindu.com/news/international/iran-vs-israel-chronicles-of-a-war-foretold/article70688723.ece",
    "published": "2026-02-28T21:04:13+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Iran vs Israel: Chronicles of a War Foretold",
    "relevant": true,
    "translated": true,
    "summary_en": "The article discusses the ongoing conflict between Iran and Israel, with the US supporting regime change in Iran. This is framed as a war of survival for Iran against the US and Israel, highlighting the strategic significance of the conflict in West Asia."
  },
  {
    "id": "ea51a6922ea82500",
    "title_original": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "content_original": "Iran's Supreme Leader Ayatollah Ali Khamenei is alive, the country's finance minister confirmed",
    "url": "https://www.hindustantimes.com/world-news/ayatollah-ali-khamenei-makes-big-move-amid-dead-rumors-iran-supreme-leader-first-response-to-us-israel-strikes-101772291485510.html",
    "published": "2026-02-28T20:54:58+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Ali Khamenei makes big move amid dead rumors; Iran Supremo's first response to US strikes",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran's Supreme Leader Ayatollah Ali Khamenei has made a significant move and issued his first response to recent US strikes, confirming his survival amid rumors of his death. This development is crucial as it demonstrates continued leadership and potential strategic direction for Iran during the ongoing conflict with the US. Khamenei's response could indicate Iran's next steps in the escalation or de-escalation of hostilities."
  },
  {
    "id": "46592b160d24909b",
    "title_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "content_original": "‘No white men allowed’: Row over Toronto University only hiring professors on basis of ‘gender identity’",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/no-white-men-allowed-row-over-toronto-university-only-hiring-professors-on-basis-of-gender-identity/articleshow/128889863.cms",
    "published": "2026-02-28T20:54:41+05:30",
    "source_name": "Times of India World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Toronto University under fire for hiring policy based on gender identity",
    "relevant": false,
    "translated": true,
    "summary_en": "[Not relevant to Iran–US war monitor]"
  },
  {
    "id": "9a5e03a5d7052f1f",
    "title_original": "Trump to deliver any remarks on strikes in Iran today? A look at his public agenda as US launches 'Op Epic Fury'",
    "content_original": "President Trump is not expected to make further public statements on the Iran strikes today, according to White House officials.",
    "url": "https://www.hindustantimes.com/world-news/us-news/donald-trump-to-deliver-any-remarks-on-strikes-in-iran-today-a-look-at-his-public-agenda-as-us-launches-op-epic-fury-101772290712176.html",
    "published": "2026-02-28T20:52:18+05:30",
    "source_name": "Hindustan Times World",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Trump not expected to comment on Iran strikes today",
    "relevant": true,
    "translated": true,
    "summary_en": "President Trump is unlikely to make additional public statements on the ongoing US strikes in Iran, as per White House officials. This comes as the US launches 'Op Epic Fury' against Iranian targets. The silence may reflect a strategic decision to avoid escalating tensions through public remarks."
  }
]