[
  {
    "id": "5022558df46a214d",
    "title_original": "Генсек ООН осудил масштабную атаку США и Израиля на Иран",
    "content_original": "Генсек ООН осудил масштабную атаку США и Израиля на Иран",
    "url": "https://ria.ru/20260301/oon-2077554034.html",
    "published": "2026-03-01T00:15:37+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "UN Secretary-General condemns large-scale US and Israeli attack on Iran",
    "relevant": true,
    "summary_en": "The UN Secretary-General has condemned a large-scale attack by the US and Israel on Iran, highlighting international criticism of the escalation in the ongoing conflict. This signifies growing global concern over the direct military actions taken by the US and Israel against Iran, potentially further destabilizing the region and complicating diplomatic efforts to de-escalate the situation.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Iran",
      "brief": "The direct military engagement by US and Israeli forces against Iran marks a significant escalation, posing a critical threat to regional stability and diplomatic efforts."
    },
    "merged_source_count": 3,
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "6cc76a302b48b161",
    "title_original": "Катар вызвал иранского посла на фоне ударов по катарской территории",
    "content_original": "Катар вызвал иранского посла на фоне ударов по катарской территории",
    "url": "https://ria.ru/20260301/katar-2077553324.html",
    "published": "2026-03-01T00:10:24+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Qatar Summons Iranian Ambassador Amid Strikes on Qatari Territory",
    "relevant": true,
    "summary_en": "Qatar has summoned the Iranian ambassador in response to strikes on its territory, indicating escalating tensions in the region. This diplomatic move follows military actions that have impacted Qatar, likely linked to the ongoing Iran-US conflict and proxy activities. The incident underscores the regional instability and potential for further escalation as Iran and US-backed forces clash.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "clash",
      "proxy"
    ],
    "classification": {
      "is_attack": true,
      "category": "proxy_operation",
      "severity": "medium",
      "parties_involved": [
        "Qatar",
        "Iran"
      ],
      "location": "Qatar",
      "brief": "The incident highlights the potential for regional escalation as Iran may be using proxy forces to target US allies in the Gulf, exacerbating tensions in the Iran-US conflict."
    },
    "lat": 25.33,
    "lng": 51.23
  },
  {
    "id": "997fb5d9079ab658",
    "title_original": "Целями ударов по Израилю являются базы и военные объекты, заявили в КСИР",
    "content_original": "Целями ударов по Израилю являются базы и военные объекты, заявили в КСИР",
    "url": "https://ria.ru/20260301/udary-2077553207.html",
    "published": "2026-03-01T00:08:12+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC Claims Strikes on Israel Targeted Military Bases and Facilities",
    "relevant": true,
    "summary_en": "The IRGC announced that their strikes on Israel were aimed at military bases and facilities. This indicates an escalation in the conflict as Iran directly targets Israeli military infrastructure. The strategic significance involves potential retaliatory measures by Israel and broader regional implications.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "irgc_action",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Israel",
      "brief": "The IRGC's direct strikes on Israeli military bases and facilities mark a significant escalation, posing a high risk of retaliatory measures and broader regional conflict."
    },
    "lat": 31.5,
    "lng": 34.8
  },
  {
    "id": "4b3ef006f920408a",
    "title_original": "Опубликовано видео авиаудара Израиля и США по Зенджану",
    "content_original": "По словам корреспондента израильского канала I24 Ариэля Осерана, вторичные взрывы указывают на вероятность нанесения удара по ракетному комплексу",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26593695",
    "published": "2026-02-28T23:49:33+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Israel and US Airstrike on Zanjan Reported",
    "relevant": true,
    "summary_en": "Israel and the US conducted a joint airstrike on Zanjan, Iran. Secondary explosions suggest the target may have been a missile complex. This strike is significant as it indicates continued escalation in direct military action against Iranian assets.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "strike",
      "airstrike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "United States",
        "Iran"
      ],
      "location": "Zanjan, Iran",
      "brief": "The joint airstrike by Israel and the US on a suspected missile complex in Zanjan, Iran, signifies a significant escalation in direct military action against Iranian assets."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "63ab7dc7f12ed4e5",
    "title_original": "Израиль заявил о ликвидации секретаря Совета по обороне Ирана, глав МО и КСИР",
    "content_original": "ЦАХАЛ утверждает, что высокопоставленные иранские чиновники были уничтожены во время первого удара ВВС",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26593769",
    "published": "2026-02-28T23:41:10+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Israel Claims to Have Eliminated Iran's Defense Council Secretary and IRGC Chiefs",
    "relevant": true,
    "summary_en": "Israel's IDF reportedly conducted strikes that killed high-ranking Iranian officials, including the Secretary of the Supreme National Security Council and heads of the Ministry of Defense and IRGC. This operation signifies a significant escalation in the conflict and targets Iran's military leadership directly. The strategic impact could disrupt Iran's command and control capabilities in the ongoing conflict.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "conflict",
      "killed",
      "irgc",
      "idf"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran",
        "IRGC"
      ],
      "location": "Iran",
      "brief": "Israel's airstrike targeting Iran's top military leadership, including the Secretary of the Supreme National Security Council and IRGC chiefs, significantly disrupts Iran's command structure and escalates regional tensions."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "e60d3d9330cb4107",
    "title_original": "Израиль заявил, что в ходе атаки погиб командующий КСИР",
    "content_original": "Израиль заявил, что в ходе атаки погиб командующий КСИР",
    "url": "https://ria.ru/20260228/iran-2077549684.html",
    "published": "2026-02-28T23:41:02+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Israel claims senior IRGC commander killed in strike",
    "relevant": true,
    "summary_en": "Israel announced that a senior IRGC commander was killed during an attack, likely referring to a recent operation targeting Iranian military leadership. This development signifies a significant escalation in Israel's campaign against Iran-linked targets and could provoke further retaliatory actions from Iran and its proxies.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "attack",
      "killed",
      "strike",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran",
        "IRGC"
      ],
      "location": "Unspecified, likely Iran or Syria",
      "brief": "The killing of a senior IRGC commander by Israel marks a significant escalation in regional tensions and could provoke direct retaliatory actions from Iran or its proxies against US or allied interests."
    }
  },
  {
    "id": "a5e22cd35e7dc2de",
    "title_original": "Кувейт заявил об успешном перехвате БПЛА при атаке на базу на юге страны",
    "content_original": "Кувейт заявил об успешном перехвате БПЛА при атаке на базу на юге страны",
    "url": "https://ria.ru/20260228/bpla-2077549433.html",
    "published": "2026-02-28T23:38:41+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Kuwait Reports Successful Interception of Drone Attack on Southern Base",
    "relevant": true,
    "summary_en": "Kuwait announced the successful interception of a drone targeting a military base in the southern part of the country. This incident highlights the ongoing regional tensions and potential threats to US allies in the Gulf amid the Iran-US conflict. The strategic significance lies in the potential implications for the security of US assets and personnel in Kuwait.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "drone",
      "attack",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Kuwait",
        "Iran (suspected)",
        "US (indirect)"
      ],
      "location": "southern Kuwait",
      "brief": "The drone attack on a Kuwaiti military base raises concerns for US assets and personnel security in the region amid ongoing Iran-US tensions."
    },
    "lat": 29.38,
    "lng": 47.99
  },
  {
    "id": "949b815c3ef400f8",
    "title_original": "WSJ: США ранее не сталкивались с таким числом атак на базы за рубежом",
    "content_original": "WSJ: США ранее не сталкивались с таким числом атак на базы за рубежом",
    "url": "https://ria.ru/20260228/ssha-2077540398.html",
    "published": "2026-02-28T22:54:27+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "WSJ: US Faces Unprecedented Number of Attacks on Overseas Bases",
    "relevant": true,
    "summary_en": "The Wall Street Journal reports that the US is experiencing an unprecedented number of attacks on its overseas bases, likely referring to the ongoing Iran-US conflict and related proxy attacks. This highlights the escalating military pressure on US forces in the Middle East and the challenges faced by US CENTCOM in protecting personnel and assets. The situation underscores the strategic significance of the conflict's impact on US military presence and operations in the region.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "proxy",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "proxy_operation",
      "severity": "high",
      "parties_involved": [
        "United States",
        "Iran",
        "IRGC",
        "US CENTCOM"
      ],
      "location": "Middle East, unspecified US overseas bases",
      "brief": "The unprecedented number of attacks on US overseas bases signifies a significant escalation in proxy operations by Iran and its allies, posing a high-level threat to US military assets and personnel in the region."
    },
    "lat": 29.0,
    "lng": 47.0
  },
  {
    "id": "8f4301d3e104d979",
    "title_original": "Reuters: верховный лидер Ирана Али Хаменеи погиб",
    "content_original": "Верховный лидер Ирана Али Хаменеи погиб в результате израильского удара по его резиденции сегодня утром. Тело аятоллы нашли в руинах разрушенной резиденции.",
    "url": "https://www.kommersant.ru/doc/8477239",
    "published": "2026-02-28T22:46:51+03:00",
    "source_name": "Kommersant",
    "source_category": "independent",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran's Supreme Leader Ali Khamenei killed in Israeli strike",
    "relevant": true,
    "summary_en": "Israel reportedly conducted a strike on the residence of Iran's Supreme Leader Ali Khamenei, resulting in his death. The attack took place this morning, and Khamenei's body was found in the ruins of his destroyed residence. This is a significant escalation in the conflict with potentially major implications for Iran's leadership and decision-making.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "death",
      "killed",
      "attack",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Iran, residence of Ali Khamenei",
      "brief": "The assassination of Iran's Supreme Leader Ali Khamenei by Israel marks a critical escalation, potentially triggering a direct military confrontation between Israel and Iran and destabilizing Iran's command structure."
    },
    "merged_source_count": 4,
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "3b32a134f5f98eb7",
    "title_original": "Израиль заявил о перехвате нескольких беспилотников, запущенных из Ирана",
    "content_original": "Израиль заявил о перехвате нескольких беспилотников, запущенных из Ирана",
    "url": "https://ria.ru/20260228/armija-2077536443.html",
    "published": "2026-02-28T22:32:28+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Israel Reports Interception of Multiple Drones Launched from Iran",
    "relevant": true,
    "summary_en": "Israel intercepted multiple drones launched from Iran. This incident occurred in Israeli airspace, highlighting ongoing tensions and potential escalation between Israel and Iran. The interception underscores the persistent threat of Iranian drone operations and Israel's active air defense measures.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "drone",
      "air defense",
      "threat"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Israeli airspace",
      "brief": "The drone interception highlights ongoing tensions and escalation risks between Israel and Iran, with potential implications for US regional interests."
    },
    "lat": 30.8124247,
    "lng": 34.8594762
  },
  {
    "id": "1d6cf58bdaa97e4b",
    "title_original": "Нетаньяху заявил о разрушении резиденции Хаменеи",
    "content_original": "Нетаньяху заявил о разрушении резиденции Хаменеи",
    "url": "https://ria.ru/20260228/ssha-2077535507.html",
    "published": "2026-02-28T22:29:26+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Netanyahu Claims Destruction of Khamenei's Residence",
    "relevant": true,
    "summary_en": "Israeli Prime Minister Netanyahu announced the destruction of Iranian Supreme Leader Khamenei's residence, likely referring to an airstrike. This represents a significant escalation in Israeli operations targeting Iranian leadership and infrastructure. The strategic significance includes potential Iranian retaliation and increased regional tensions.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "airstrike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Iran (specific location not provided)",
      "brief": "The destruction of Iranian Supreme Leader Khamenei's residence by Israel represents a significant escalation in regional tensions and increases the likelihood of direct Iranian retaliation against Israel or US interests."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "99d8a05d32edcf84",
    "title_original": "ОАЭ осудили ракетные удары Ирана по региону",
    "content_original": "Тегеран, Иран",
    "url": "https://www.rbc.ru/rbcfreenews/69a331759a7947b46e7f017a",
    "published": "2026-02-28T22:28:41+03:00",
    "source_name": "RBC",
    "source_category": "independent",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "UAE Condemns Iran's Missile Strikes on the Region",
    "relevant": true,
    "summary_en": "The UAE has condemned Iran's missile strikes targeting the region, highlighting the escalating tensions and potential threats to regional stability. This condemnation comes amid ongoing hostilities between Iran and the US, with the UAE expressing concerns over the impact on their security and interests. The statement underscores the UAE's alignment with efforts to de-escalate the conflict and maintain regional peace.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "missile",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE"
      ],
      "location": "UAE region",
      "brief": "Iran's missile strikes on the UAE region signal a direct escalation in the Iran-US conflict, posing a significant threat to regional stability and US interests in the Gulf."
    },
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "fba40ec568d40172",
    "title_original": "Drone Attacks Target Military Sites in Southern Iraq",
    "content_original": "By John Lee. Iraqi air defences have intercepted and shot down nine drones targeting military sites in Dhi Qar and Basra provinces, according to updates from the Joint Operations Command . Four drones were downed after attempting to strike a military location inside Imam Ali Air Base in Dhi Qar province. Two were intercepted at 22:50, with no casualties or material losses reported. In separate incidents, five additional drones were detected and destroyed while attempting to target military sites in Basra province. One earlier attempt to strike a military location in Basra resulted in a soldier being injured. In total, nine drones were intercepted across the reported incidents. Authorities confirmed that, aside from the one injured soldier, no further human or material losses were recorded. Investigations have been launched in line with established procedures. Separately, Jurf Al-Nasr in northern Babil province was subjected to two air strikes at 19:25. The authorities said they are clo...",
    "url": "https://www.iraq-businessnews.com/2026/02/28/drone-attacks-target-military-sites-in-southern-iraq/",
    "published": "2026-02-28T22:16:54+00:00",
    "source_name": "Iraq Business News",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Drone Attacks Target Military Sites in Southern Iraq",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Iraq",
        "Iranian-backed militias"
      ],
      "location": "Southern Iraq",
      "brief": "Drone strikes on military sites in Southern Iraq indicate ongoing proxy operations by Iran, escalating tensions in the region and posing a threat to US interests and allies."
    },
    "lat": 33.1,
    "lng": 44.17
  },
  {
    "id": "57c74d84b00bbb04",
    "title_original": "‼️   🇮🇷   ❌   🇮🇱  — Sirens sound across central Israel as Iran continues to launch ballistic missiles.  The IDF says ...",
    "content_original": "‼️ 🇮🇷 ❌ 🇮🇱 — Sirens sound across central Israel as Iran continues to launch ballistic missiles. The IDF says it is working to intercept the projectiles.",
    "url": "https://t.me/CIG_telegram/69723",
    "published": "2026-02-28T22:15:05+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iranian ballistic missiles trigger air raid sirens in central Israel",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has launched ballistic missiles targeting central Israel, prompting air raid sirens across the region. The IDF is actively working to intercept the incoming projectiles, indicating a significant escalation in the conflict between Iran and Israel.",
    "keyword_matches": 7,
    "matched_keywords": [
      "ballistic",
      "intercept",
      "raid",
      "conflict",
      "idf"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "central Israel",
      "brief": "Iran's ballistic missile attack on central Israel represents a significant escalation, directly involving two regional adversaries and posing a direct threat to Israeli territory."
    },
    "lat": 31.9,
    "lng": 34.8
  },
  {
    "id": "83538bb45cb8fb88",
    "title_original": "Burgers, then war: Trump’s bluffs before Iran strikes",
    "content_original": "On a visit to Texas on Friday, US President Donald Trump gave a raucous speech on the economy and then stopped off at a fast-food joint. “Hamburgers for everyone!” Trump declared to cheering customers at the Whataburger restaurant in Corpus Christi, before the 47th president left clutching a bag with order No 47. Nine hours later, in the dead of night, Trump announced from his Mar-a-Lago resort in Florida that he had ordered the start of a major attack against Iran. It was the culmination of a...",
    "url": "https://www.scmp.com/news/world/middle-east/article/3345001/burgers-then-war-trumps-bluffs-iran-strikes?utm_source=rss_feed",
    "published": "2026-02-28T22:13:05+00:00",
    "source_name": "South China Morning Post",
    "source_category": "independent",
    "language": "en",
    "region": "china",
    "skip_translation": true,
    "title_en": "Trump ordered major attack on Iran after public appearance",
    "translated": true,
    "relevant": true,
    "summary_en": "Former US President Donald Trump ordered a major attack on Iran after a public appearance in Texas, where he visited a fast-food restaurant. The attack was announced nine hours later from his Mar-a-Lago resort in Florida. This highlights the abrupt escalation and potential decision-making process during the conflict.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "us_strike_on_iran",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Iran"
      ],
      "location": "Iran",
      "brief": "The article suggests a direct US military strike on Iran ordered by a former US President, indicating a significant escalation with major strategic implications for the conflict."
    },
    "merged_source_count": 3,
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "fb6d999728a2ec8c",
    "title_original": "One person killed in Tel Aviv rocket attack",
    "content_original": "One person killed in Tel Aviv rocket attack An Israeli woman has been killed in a rocket strike on Tel Aviv, according to Israeli media. The fatality comes after emergency services reported that 21 people were wounded in the attack on the city. Ambulance officials said two of the injured remain in critical condition.",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/one-person-killed-tel-aviv-rocket-attack",
    "published": "2026-02-28T22:12:46+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "One person killed in Tel Aviv rocket attack",
    "translated": true,
    "relevant": true,
    "summary_en": "A rocket attack on Tel Aviv resulted in the death of one Israeli woman and left 21 people wounded, with two in critical condition. This attack highlights the ongoing conflict and the threat under which Israeli civilians are living, likely linked to recent regional escalations.",
    "keyword_matches": 10,
    "matched_keywords": [
      "death",
      "rocket",
      "wounded",
      "attack",
      "killed",
      "conflict",
      "threat"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah"
      ],
      "location": "Tel Aviv, Israel",
      "brief": "The rocket attack on Tel Aviv by Hezbollah-linked forces signifies an escalation in regional hostilities, posing a direct threat to Israeli civilian populations amidst ongoing tensions."
    },
    "lat": 32.08,
    "lng": 34.78
  },
  {
    "id": "3fc1310c1c518fd0",
    "title_original": "Panic at Dubai Airport as 'it is hit by an Iranian suicide drone' and passengers flee wrecked terminal",
    "content_original": "Panic at Dubai Airport as 'it is hit by an Iranian suicide drone' and passengers flee wrecked terminal",
    "url": "https://www.dailymail.co.uk/news/article-15602525/Dubai-Airport-explosions-passengers-evacuate-warfare.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
    "published": "2026-02-28T22:12:39+00:00",
    "source_name": "Daily Mail",
    "source_category": "independent",
    "language": "en",
    "region": "western",
    "skip_translation": true,
    "title_en": "Panic at Dubai Airport as 'it is hit by an Iranian suicide drone' and passengers flee wrecked terminal",
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "suicide",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "United Arab Emirates"
      ],
      "location": "Dubai Airport, United Arab Emirates",
      "brief": "An Iranian suicide drone attack on Dubai Airport highlights Iran's willingness to target critical infrastructure in the region, escalating tensions in the Gulf amidst the Iran–US conflict."
    },
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "caffecb2769ebe60",
    "title_original": "Death toll from Israel-US school strike in Minab rises to 108",
    "content_original": "Death toll from Israel-US school strike in Minab rises to 108 The death toll from the strike on the Shajareh Tayyebeh girls’ primary school in Minab has climbed to 108, according to Iran’s Mizan News Agency. Citing the Minab Prosecutor’s Office, the agency said the number of casualties continues to rise following the attack on the school in southern Iran.&nbsp;",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/death-toll-israel-us-school-strike-minab-rises-108",
    "published": "2026-02-28T21:59:58+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Death toll from Israel-US school strike in Minab rises to 108",
    "translated": true,
    "relevant": true,
    "summary_en": "The death toll from an Israel-US strike on a girls' primary school in Minab, Iran, has risen to 108, according to Iran's Mizan News Agency. The attack on the Shajareh Tayyebeh school in southern Iran continues to cause casualties, highlighting the ongoing conflict's impact on civilian infrastructure and raising concerns about escalation.",
    "keyword_matches": 6,
    "matched_keywords": [
      "attack",
      "conflict",
      "strike",
      "death"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Israel",
        "Iran"
      ],
      "location": "Minab, Iran",
      "brief": "The strike on a civilian school in Iran, resulting in over 100 casualties, represents a significant escalation in the conflict with direct US involvement and severe impact on civilian infrastructure."
    },
    "lat": 27.1,
    "lng": 57.08
  },
  {
    "id": "07d2e7a7c4a0ac65",
    "title_original": "‘We can suffer to help the Iranian people’: Reservist has home damaged by Iranian missile fragment",
    "content_original": "As the missile hit the ground, fragmented pieces of metal were broken off and launched into his home, burning holes into the ceiling and smashing his windows.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888311",
    "published": "2026-02-28T21:59:21+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Iranian missile fragment damages reservist's home in retaliatory strike",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian missile attack resulted in fragments damaging a reservist's home, causing structural damage and highlighting the direct impact on civilians. The incident occurred in an unspecified location, likely within range of Iranian missile capabilities. This underscores the risk under which military personnel and civilians live amidst ongoing hostilities.",
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "strike",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Unspecified location within range of Iranian missile capabilities",
      "brief": "The incident highlights Iran's continued use of ballistic missiles in retaliatory strikes, posing a direct threat to civilian populations and military personnel in the region."
    }
  },
  {
    "id": "92872722ed90ed57",
    "title_original": "Israeli officials informed Khamenei assassinated in Iran strike, body said to be found in rubble",
    "content_original": "The body of Ali Khamenei, Iran’s supreme leader since 1989, was reportedly found under the rubble in Tehran. His death marks a major turning point for the Islamic Republic’s leadership.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888283",
    "published": "2026-02-28T21:39:17+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Khamenei reportedly killed in Israeli strike in Iran",
    "translated": true,
    "relevant": true,
    "summary_en": "Israeli officials claim that Ali Khamenei, Iran's supreme leader, was assassinated in a strike on Tehran, with his body reportedly found under rubble. This event marks a significant escalation and potential turning point in the ongoing conflict, as it targets the highest authority in Iran's government.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "killed",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Tehran, Iran",
      "brief": "The assassination of Iran's Supreme Leader Ali Khamenei by Israel marks a critical escalation, potentially triggering a direct and severe response from Iran against Israel and its allies in the region."
    },
    "lat": 35.69,
    "lng": 51.39
  },
  {
    "id": "e7b6ba9a69a76435",
    "title_original": "Dubai airport following an Iranian drone strike @PressTV",
    "content_original": "Dubai airport following an Iranian drone strike @PressTV",
    "url": "https://t.me/presstv/177308",
    "published": "2026-02-28T21:30:17+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Dubai airport hit by Iranian drone strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched a drone strike targeting Dubai airport, a major regional transportation hub. This attack demonstrates Iran's capability to strike high-profile civilian infrastructure in the UAE, escalating tensions in the Gulf region. The strike will likely prompt increased security measures and international condemnation, with potential repercussions for Iran's ongoing conflict with the US and its allies.",
    "keyword_matches": 8,
    "matched_keywords": [
      "attack",
      "drone",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "United Arab Emirates"
      ],
      "location": "Dubai airport, UAE",
      "brief": "Iran's drone strike on Dubai airport demonstrates its capability to target high-profile civilian infrastructure in the Gulf region, escalating regional tensions and posing a direct threat to US allies."
    },
    "merged_source_count": 2,
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "dde30e405bc59e23",
    "title_original": "سپاه پاسداران انقلاب اسلامی: سبرپوشان سپاه شناورهای دشمن را از رده خارج کردند",
    "content_original": "سپاه پاسداران انقلاب اسلامی: سبرپوشان سپاه شناورهای دشمن را از رده خارج کردند",
    "url": "https://www.irna.ir/news/86089883/%D8%B3%D9%BE%D8%A7%D9%87-%D9%BE%D8%A7%D8%B3%D8%AF%D8%A7%D8%B1%D8%A7%D9%86-%D8%A7%D9%86%D9%82%D9%84%D8%A7%D8%A8-%D8%A7%D8%B3%D9%84%D8%A7%D9%85%DB%8C-%D8%B3%D8%A8%D8%B1%D9%BE%D9%88%D8%B4%D8%A7%D9%86-%D8%B3%D9%BE%D8%A7%D9%87-%D8%B4%D9%86%D8%A7%D9%88%D8%B1%D9%87%D8%A7%DB%8C-%D8%AF%D8%B4%D9%85%D9%86-%D8%B1%D8%A7-%D8%A7%D8%B2",
    "published": "2026-02-28T21:21:04+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "IRGC Claims to Have Destroyed Enemy Vessels with Missile Defense Systems",
    "relevant": true,
    "summary_en": "The IRGC announced that its missile defense systems have destroyed enemy vessels, likely in the Persian Gulf or Gulf of Oman. This indicates ongoing naval engagements between Iran and US or allied forces, highlighting the escalation of maritime hostilities in the region.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "irgc",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "IRGC",
        "US Navy"
      ],
      "location": "Persian Gulf or Gulf of Oman",
      "brief": "The IRGC's claim of destroying enemy vessels using missile defense systems indicates a significant escalation in maritime hostilities between Iran and US forces in the strategically critical Persian Gulf region."
    }
  },
  {
    "id": "5e3abef7abd85473",
    "title_original": "Trump says reports of Khamenei’s death ‘we feel are correct’",
    "content_original": "Trump says reports of Khamenei’s death ‘we feel are correct’ US President Donald Trump has said he believes reports that Iran’s Supreme Leader Ayatollah Ali Khamenei was killed in air strikes are accurate, though he stopped short of confirming the claim outright. “We feel that that is a correct story,” Trump told NBC News. Speaking separately to ABC News, he added: “I don't want to say anything definitively until I see things but we believe he is. And much of their leaders are gone.” His remarks follow earlier comments from Israeli Prime Minister Benjamin Netanyahu, who said there were “many signs” that Khamenei had been killed in a strike on his compound during the joint US-Israeli campaign. Iranian media outlets have denied the reports.",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/trump-says-reports-khameneis-death-we-feel-are-correct",
    "published": "2026-02-28T21:18:25+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Trump suggests belief in reports of Khamenei's death",
    "translated": true,
    "relevant": true,
    "summary_en": "US President Donald Trump has indicated his belief in reports that Iran's Supreme Leader Ayatollah Ali Khamenei was killed in air strikes, though he did not confirm it outright. This follows Israeli Prime Minister Benjamin Netanyahu's statement about signs of Khamenei's death in a strike on his compound. The potential death of Khamenei would be a significant escalation in the conflict, impacting Iranian leadership and decision-making.",
    "keyword_matches": 6,
    "matched_keywords": [
      "conflict",
      "killed",
      "death",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Israel",
        "Iran"
      ],
      "location": "Iran (specific location not confirmed)",
      "brief": "The potential killing of Iran's Supreme Leader Ayatollah Ali Khamenei in an airstrike would represent a significant escalation in the conflict, directly impacting Iranian leadership and potentially triggering a major response."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "a3cc739942b5492c",
    "title_original": "💥 🇮🇱  Iranian missiles struck a ship off the coast of Ashkelon. @CIG_telegram",
    "content_original": "💥 🇮🇱 Iranian missiles struck a ship off the coast of Ashkelon. @CIG_telegram",
    "url": "https://t.me/CIG_telegram/69718",
    "published": "2026-02-28T21:17:30+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iranian missiles strike ship off Ashkelon coast",
    "translated": true,
    "relevant": true,
    "summary_en": "Iranian forces launched missiles targeting a ship near Ashkelon, Israel. This incident occurred in the Mediterranean Sea, close to Israeli territory. The strike signifies an escalation in maritime hostilities and direct Iranian involvement in the conflict, potentially impacting regional shipping and naval dynamics.",
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Mediterranean Sea, near Ashkelon, Israel",
      "brief": "Iran's direct missile strike on a ship near Israeli territory escalates maritime hostilities and signifies increased involvement in regional conflicts."
    },
    "lat": 31.5,
    "lng": 34.8
  },
  {
    "id": "8c0984eb1e8a20ec",
    "title_original": "CENTCOM: военные США отразили сотни атак иранских ракет и беспилотников",
    "content_original": "Информации о жертвах и ранениях среди американцев в связи с боевыми действиями не поступало",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26592929",
    "published": "2026-02-28T21:16:20+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "CENTCOM: US Military Repels Hundreds of Iranian Missile and Drone Attacks",
    "relevant": true,
    "summary_en": "US CENTCOM reports that American forces have successfully defended against hundreds of Iranian missile and drone attacks. No casualties or injuries among US personnel have been reported. This highlights the ongoing escalation and defensive measures in the region amid the Iran-US conflict.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "drone",
      "missile",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "United States",
        "Iran"
      ],
      "location": "CENTCOM region",
      "brief": "The coordinated Iranian missile and drone attack on US forces represents a significant escalation in the conflict, despite no casualties being reported."
    },
    "lat": 10.3357315,
    "lng": 123.9011738
  },
  {
    "id": "07563501a80e8e6a",
    "title_original": "تعداد شهدای حمله به دبستان میناب به ۱۱۵ شهید رسید",
    "content_original": "تعداد شهدای حمله به دبستان میناب به ۱۱۵ شهید رسید",
    "url": "https://www.irna.ir/news/86089904/%D8%AA%D8%B9%D8%AF%D8%A7%D8%AF-%D8%B4%D9%87%D8%AF%D8%A7%DB%8C-%D8%AD%D9%85%D9%84%D9%87-%D8%A8%D9%87-%D8%AF%D8%A8%D8%B3%D8%AA%D8%A7%D9%86-%D9%85%DB%8C%D9%86%D8%A7%D8%A8-%D8%A8%D9%87-%DB%B1%DB%B1%DB%B5-%D8%B4%D9%87%DB%8C%D8%AF-%D8%B1%D8%B3%DB%8C%D8%AF",
    "published": "2026-02-28T21:15:08+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Attack on Minab Elementary School Kills 115",
    "relevant": true,
    "summary_en": "An attack on Minab Elementary School in Iran has resulted in 115 fatalities. The incident occurred in Minab, Iran, and while the specific details of the attack are not provided, the high casualty count indicates a significant and devastating event. This could have implications for domestic security and potentially provoke a response from Iranian authorities.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "major",
      "parties_involved": [
        "Iran"
      ],
      "location": "Minab, Iran",
      "brief": "The attack on a school in Iran resulting in 115 fatalities is a significant domestic incident that could provoke a strong response from Iranian authorities and impact regional stability."
    },
    "lat": 27.1,
    "lng": 57.08
  },
  {
    "id": "4339353e37c43dcb",
    "title_original": "#BREAKING ⚡️ 🇮🇷 🇮🇷 ❌ 🇮🇱 🇺🇸  - The IRGC has announced targeting an IDF's Naval Base in the  Haifa  port and a shipyard...",
    "content_original": "#BREAKING ⚡️ 🇮🇷 🇮🇷 ❌ 🇮🇱 🇺🇸 - The IRGC has announced targeting an IDF's Naval Base in the Haifa port and a shipyard in the area, the Ramat David Airbase, the \" Kirya \" Ministry of War building , the \" Beit Shemesh \" military-industrial complex, and the Ashdod military industrial complex. The IRGC has stated it used missiles \"more advanced\" and \"precise\" than that of Operation \"True Promise III\".",
    "url": "https://t.me/CIG_telegram/69716",
    "published": "2026-02-28T21:12:06+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "IRGC claims strikes on multiple Israeli military targets including Haifa naval base and Ramat David Airbase",
    "translated": true,
    "relevant": true,
    "summary_en": "The IRGC announced it targeted multiple Israeli military facilities, including the Haifa naval base, Ramat David Airbase, Kirya Ministry of War building, and military-industrial complexes in Beit Shemesh and Ashdod. The use of 'more advanced' and 'precise' missiles than those used in a previous operation suggests an escalation in Iranian capabilities and intent to strike high-value Israeli military assets.",
    "keyword_matches": 4,
    "matched_keywords": [
      "strike",
      "irgc",
      "war"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [],
      "location": "Unknown",
      "brief": "Classified by keyword matching (LLM unavailable)"
    }
  },
  {
    "id": "58fd6350ff9d46f8",
    "title_original": "Explosion rocks central Israel after Iran missile barrage",
    "content_original": "Explosion rocks central Israel after Iran missile barrage Loud explosions have been heard in central Israel following what Israeli media describe as a fresh missile barrage from Iran. Channel 12 reported the blast as sirens sounded across Tel Aviv. Israel Hayom said a missile struck the city, though officials have not yet released full details. Haaretz, citing a police source, said five people were wounded at the site of the impact in central Israel. Emergency crews have deployed to the area as authorities assess the damage.",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/explosion-rocks-central-israel-after-iran-missile-barrage",
    "published": "2026-02-28T21:11:52+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Explosion rocks central Israel after Iran missile barrage",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched a missile barrage targeting central Israel, causing explosions heard in Tel Aviv and resulting in at least five injuries. The incident signifies a significant escalation in the conflict as Iran directly targets Israeli population centers. Emergency crews are responding, and authorities are assessing the damage.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "missile",
      "explosion"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "central Israel",
      "brief": "Iran's direct ballistic missile attack on central Israel marks a significant escalation, demonstrating Tehran's willingness to target Israeli population centers and escalating the regional conflict."
    },
    "lat": 31.9,
    "lng": 34.8
  },
  {
    "id": "aa79d21940a76b83",
    "title_original": "Unprecedented scenes in central occupied Palestine as Iranian missile strikes set vehicles ablaze and damage building...",
    "content_original": "Unprecedented scenes in central occupied Palestine as Iranian missile strikes set vehicles ablaze and damage buildings. @PressTV",
    "url": "https://t.me/presstv/177304",
    "published": "2026-02-28T21:09:26+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian missile strikes hit central occupied Palestine, igniting vehicles and damaging buildings",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched missile strikes targeting central occupied Palestine, resulting in vehicles being set ablaze and buildings sustaining damage. This escalation signifies direct Iranian involvement in the conflict within the region, potentially aimed at Israeli assets or infrastructure. The strikes mark a significant escalation in hostilities and could provoke further Israeli or US retaliatory actions.",
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel",
        "US"
      ],
      "location": "Central occupied Palestine",
      "brief": "Iran's direct missile strikes on occupied Palestine represent a significant escalation, posing a direct threat to US interests and regional stability by targeting Israeli assets."
    },
    "lat": 31.5197847,
    "lng": 35.0494777
  },
  {
    "id": "33be436b48a5f6a4",
    "title_original": "⚡️ Massive destruction in Tel Aviv following Iranian missile strike",
    "content_original": "⚡️ Massive destruction in Tel Aviv following Iranian missile strike",
    "url": "https://t.me/warmonitors/40122",
    "published": "2026-02-28T21:04:05+00:00",
    "source_name": "War Monitors (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Massive destruction in Tel Aviv following Iranian missile strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched a missile strike on Tel Aviv, causing massive destruction. This attack is a significant escalation in the conflict, demonstrating Iran's capability to target Israeli population centers. The strike will likely prompt a strong Israeli and US response, further escalating regional tensions.",
    "keyword_matches": 7,
    "matched_keywords": [
      "attack",
      "strike",
      "missile",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel",
        "United States"
      ],
      "location": "Tel Aviv, Israel",
      "brief": "Iran's ballistic missile strike on Tel Aviv represents a direct attack on a major Israeli population center, posing a significant escalation with direct implications for US regional security commitments."
    },
    "merged_source_count": 6,
    "lat": 32.08,
    "lng": 34.78
  },
  {
    "id": "66d0cde7de857090",
    "title_original": "📝 Главное от Рыбаря 📝 дайджест материалов за 28 февраля Весь мир  следит  за бомбежками Ирана и ответными ударами по ...",
    "content_original": "📝 Главное от Рыбаря 📝 дайджест материалов за 28 февраля Весь мир следит за бомбежками Ирана и ответными ударами по странам Залива. Кажется, будто война на Ближнем востоке движется к кульминации, а израильтяне добились своей заветной цели - убили Хаменеи. Вот только режим в Иране пока не свергли, управление не нарушено, а значит ночью нас ожидает продолжение. ❗️ Подробнее об этой и других темах читайте в нашем дайджесте. ➡️ Рыбарь @rybar — говорим о сложном просто. Основной ресурс нашего аналитического центра. Самые важные и интересные материалы. ▪️ Начало войны против Ирана ▪️ Хаменеи мертв ? ▪️ Война в Иране как отвлечение от американских проблем ▪️ Разведывательная активность ВС США ▪️ Пророчество Жириновского ▪️ О возможных последствиях для ВСУ из-за войны на Ближнем Востоке ▪️ Массированный удар по зарубежным базам США ▪️ Как иранские власти приспособились к работе в Telegram ▪️ Как в СМИ « хоронят » иранских чиновников ▪️ Иранские удары по Бахрейну ▪️ Новый комикс от Рыбаря ➡️ АЗИ...",
    "url": "https://t.me/rybar/77954",
    "published": "2026-02-28T21:03:58+00:00",
    "source_name": "Rybar (TG)",
    "source_category": "state-aligned",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "World Watches as Iran Bombings and Retaliatory Strikes Escalate in the Gulf",
    "relevant": true,
    "summary_en": "The ongoing conflict has escalated with Iran facing bombings and launching retaliatory strikes against Gulf countries. Israeli forces reportedly killed Iran's Supreme Leader Khamenei, though the regime remains in control, suggesting further escalation is imminent. This indicates a potential climax in the Middle East conflict with significant military and strategic implications for regional stability.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "killed"
    ],
    "classification": {
      "is_attack": true,
      "category": "escalation",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel",
        "Gulf countries"
      ],
      "location": "Gulf region",
      "brief": "The assassination of Iran's Supreme Leader Khamenei and subsequent retaliatory strikes mark a critical escalation in the Middle East conflict with profound implications for regional stability and potential direct US involvement."
    },
    "lat": 26.0,
    "lng": 52.0
  },
  {
    "id": "ac90b78910cf65a3",
    "title_original": "— ❗️ 🇮🇷 / 🇧🇭 / 🇦🇪  BREAKING:  Iranian ballistic missiles towards Bahrain and the UAE @Middle_East_Spectator",
    "content_original": "— ❗️ 🇮🇷 / 🇧🇭 / 🇦🇪 BREAKING: Iranian ballistic missiles towards Bahrain and the UAE @Middle_East_Spectator",
    "url": "https://t.me/CIG_telegram/69708",
    "published": "2026-02-28T21:03:28+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iranian ballistic missiles target Bahrain and the UAE",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has launched ballistic missiles towards Bahrain and the UAE, escalating regional tensions. This attack directly threatens US allies and interests in the Gulf region. The incident signifies a significant escalation in the conflict with potential implications for US naval and air operations in the area.",
    "keyword_matches": 4,
    "matched_keywords": [
      "attack",
      "ballistic",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Bahrain",
        "UAE",
        "United States"
      ],
      "location": "Bahrain, UAE",
      "brief": "Iran's ballistic missile attack on Bahrain and the UAE represents a direct escalation targeting US allies and critical Gulf region interests, posing a significant threat to regional stability and US military operations."
    },
    "lat": 26.07,
    "lng": 50.55
  },
  {
    "id": "271a46b09980cc69",
    "title_original": "— ❗️ 🇮🇷 / 🇶🇦 / 🇺🇸  Al-Udeid Airbase, Qatar, interceptions ongoing @Middle_East_Spectator",
    "content_original": "— ❗️ 🇮🇷 / 🇶🇦 / 🇺🇸 Al-Udeid Airbase, Qatar, interceptions ongoing @Middle_East_Spectator",
    "url": "https://t.me/CIG_telegram/69711",
    "published": "2026-02-28T21:03:28+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Interceptions Ongoing at Al-Udeid Airbase, Qatar",
    "translated": true,
    "relevant": true,
    "summary_en": "US forces at Al-Udeid Airbase in Qatar are conducting ongoing interceptions, likely in response to missile or drone threats. This indicates active hostilities targeting US assets in the region and highlights the persistent threat under which US bases in the Gulf operate.",
    "keyword_matches": 3,
    "matched_keywords": [
      "threat",
      "drone",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "United States",
        "Iran",
        "IRGC"
      ],
      "location": "Al-Udeid Airbase, Qatar",
      "brief": "The ongoing interceptions at Al-Udeid Airbase highlight the persistent threat under which US assets operate in the Gulf, indicating active hostilities and potential escalation risks."
    },
    "lat": 25.33,
    "lng": 51.23
  },
  {
    "id": "ce6df61e356b77eb",
    "title_original": "— ❗️ 🇮🇱 / 🇮🇷  Tel Aviv @Middle_East_Spectator",
    "content_original": "— ❗️ 🇮🇱 / 🇮🇷 Tel Aviv @Middle_East_Spectator",
    "url": "https://t.me/CIG_telegram/69706",
    "published": "2026-02-28T21:03:27+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "IDF Strikes IRGC Targets in Southern Syria",
    "translated": true,
    "relevant": true,
    "summary_en": "The Israeli Defense Forces (IDF) conducted airstrikes targeting IRGC assets in southern Syria. The strikes are in response to recent missile launches by Iranian-backed groups towards Israel. This escalation highlights the ongoing tensions and proxy conflict between Israel and Iran in the region.",
    "keyword_matches": 7,
    "matched_keywords": [
      "idf",
      "proxy",
      "missile",
      "conflict",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "IRGC",
        "Iran"
      ],
      "location": "southern Syria",
      "brief": "The airstrikes by Israel on IRGC targets in southern Syria reflect ongoing proxy conflict escalation between Israel and Iran, with potential regional implications for the Iran–US conflict."
    },
    "merged_source_count": 2,
    "lat": 34.8,
    "lng": 38.99
  },
  {
    "id": "fa1eb59ffd5005e3",
    "title_original": "Residence of US soldiers in Bahrain engulfed in flames following an Iranian drone attack  @PressTV",
    "content_original": "Residence of US soldiers in Bahrain engulfed in flames following an Iranian drone attack @PressTV",
    "url": "https://t.me/presstv/177297",
    "published": "2026-02-28T20:58:53+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian drone attack sets US soldiers' residence in Bahrain ablaze",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched a drone attack targeting a US military residence in Bahrain, causing a fire. This incident signifies an escalation in Iranian operations against US assets in the Gulf region. The attack demonstrates Iran's intent to target US military infrastructure outside of direct conflict zones.",
    "keyword_matches": 6,
    "matched_keywords": [
      "drone",
      "attack",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "United States",
        "US military in Bahrain"
      ],
      "location": "Bahrain",
      "brief": "The Iranian drone strike on a US military residence in Bahrain marks a significant escalation, demonstrating Iran's willingness to target US assets in the Gulf region outside of direct conflict zones."
    },
    "merged_source_count": 2,
    "lat": 26.07,
    "lng": 50.55
  },
  {
    "id": "c7110406597b4705",
    "title_original": "Live coverage captures the moment an Iranian missile hit Tel Aviv  @PressTV",
    "content_original": "Live coverage captures the moment an Iranian missile hit Tel Aviv @PressTV",
    "url": "https://t.me/presstv/177294",
    "published": "2026-02-28T20:53:58+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian missile strikes Tel Aviv",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian missile hit Tel Aviv, marking a significant escalation in the conflict as it directly targets a major Israeli city. This attack is likely in retaliation for previous Israeli strikes on Iranian targets and demonstrates Iran's willingness to escalate hostilities against Israel. The strike has significant military and strategic implications, potentially drawing Israel further into the broader US-Iran conflict.",
    "keyword_matches": 6,
    "matched_keywords": [
      "attack",
      "conflict",
      "strike",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel",
        "United States"
      ],
      "location": "Tel Aviv, Israel",
      "brief": "Iran's ballistic missile strike on Tel Aviv represents a significant escalation, directly involving Israel and potentially drawing the US further into the conflict."
    },
    "merged_source_count": 14,
    "lat": 32.08,
    "lng": 34.78
  },
  {
    "id": "c7b32a12086ed624",
    "title_original": "موج سوم و چهارم با موشک های پیشرفته‌تر از وعده صادق ۳ آغاز شده است",
    "content_original": "موج سوم و چهارم با موشک های پیشرفته‌تر از وعده صادق ۳ آغاز شده است",
    "url": "https://www.irna.ir/news/86089882/%D9%85%D9%88%D8%AC-%D8%B3%D9%88%D9%85-%D9%88-%DA%86%D9%87%D8%A7%D8%B1%D9%85-%D8%A8%D8%A7-%D9%85%D9%88%D8%B4%DA%A9-%D9%87%D8%A7%DB%8C-%D9%BE%DB%8C%D8%B4%D8%B1%D9%81%D8%AA%D9%87-%D8%AA%D8%B1-%D8%A7%D8%B2-%D9%88%D8%B9%D8%AF%D9%87-%D8%B5%D8%A7%D8%AF%D9%82-%DB%B3-%D8%A2%D8%BA%D8%A7%D8%B2-%D8%B4%D8%AF%D9%87",
    "published": "2026-02-28T20:52:16+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Iran launches third and fourth waves of attacks with advanced missiles from Sajjil-3",
    "relevant": true,
    "summary_en": "Iran has initiated new waves of missile attacks using more advanced variants of the Sajjil-3 missile system. This escalation targets US bases and interests in the region, demonstrating Iran's continued capability to strike back against US forces. The use of advanced missile technology signifies a potential shift in Iran's strategy, aiming to overwhelm defenses and inflict greater damage.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "strike",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "US bases and interests in the region",
      "brief": "Iran's use of advanced Sajjil-3 missiles to target US bases signifies a significant escalation with potential for high casualties and strategic impact."
    },
    "lat": 40.8472515,
    "lng": -73.8322691
  },
  {
    "id": "130332feba7e28bf",
    "title_original": "💥 🇮🇱   Channel 12 reports explosions over Haifa! @CIG_telegram",
    "content_original": "💥 🇮🇱 Channel 12 reports explosions over Haifa! @CIG_telegram",
    "url": "https://t.me/CIG_telegram/69699",
    "published": "2026-02-28T20:50:35+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Explosions reported over Haifa, Israel",
    "translated": true,
    "relevant": true,
    "summary_en": "Explosions have been reported over Haifa, Israel, likely indicating a military strike or attack. This event is significant as it suggests potential escalation in the conflict involving Israel, potentially linked to regional tensions with Hezbollah or other Iran-backed groups. The military and strategic implications could involve Israeli defensive measures and potential retaliatory actions.",
    "keyword_matches": 4,
    "matched_keywords": [
      "attack",
      "hezbollah",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran"
      ],
      "location": "Haifa, Israel",
      "brief": "The explosions over Haifa suggest a potential escalation in regional tensions, likely involving Hezbollah as an Iran-backed proxy, with implications for Israeli defensive measures and potential retaliatory actions."
    },
    "lat": 32.79,
    "lng": 34.99
  },
  {
    "id": "6bbfb8d9a428239c",
    "title_original": "🇮🇷 🇮🇱 ⚡️ - Another visual confirmation of an Iranian missile impact in central Israel.",
    "content_original": "🇮🇷 🇮🇱 ⚡️ - Another visual confirmation of an Iranian missile impact in central Israel.",
    "url": "https://t.me/CIG_telegram/69698",
    "published": "2026-02-28T20:49:34+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iranian missile strikes central Israel, confirmed by visual evidence",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has launched missiles targeting central Israel, with visual confirmation of impacts. This represents a significant escalation in the conflict, demonstrating Iran's willingness to directly engage Israel from a distance. The strikes likely aim to pressure Israel and test its air defense capabilities amidst the broader US-Iran conflict.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "air defense",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "central Israel",
      "brief": "Iran's ballistic missile strikes on central Israel mark a direct engagement and significant escalation in the broader US-Iran conflict, demonstrating Iran's capability and willingness to target Israel from a distance."
    },
    "merged_source_count": 2,
    "lat": 31.9,
    "lng": 34.8
  },
  {
    "id": "907c6c96e9dff841",
    "title_original": "🚨 اصابت موشک به اسرائیل  ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات و اخبار جدید ایران و آمریکا  🌐 ✅   @SA...",
    "content_original": "🚨 اصابت موشک به اسرائیل ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44879",
    "published": "2026-02-28T20:45:28+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Missile Strikes Israel",
    "relevant": true,
    "summary_en": "A missile has struck Israel, likely from Iranian-backed groups such as Hezbollah or Hamas. This attack is part of the ongoing escalation in the region, with potential implications for Israeli operations against Iran-linked targets and broader regional stability.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "hamas",
      "hezbollah",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran"
      ],
      "location": "Israel",
      "brief": "Missile strike by Iranian-backed Hezbollah on Israel escalates regional tensions and threatens to widen the conflict."
    },
    "merged_source_count": 3,
    "lat": 31.5,
    "lng": 34.8
  },
  {
    "id": "b2e550010865f577",
    "title_original": "🎥  The moment an Iranian missile struck a US military base in Erbil, Iraq @PressTV",
    "content_original": "🎥 The moment an Iranian missile struck a US military base in Erbil, Iraq @PressTV",
    "url": "https://t.me/presstv/177279",
    "published": "2026-02-28T20:03:04+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian missile strikes US military base in Erbil, Iraq",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian missile hit a US military base in Erbil, Iraq, showcasing ongoing Iranian retaliation against US forces in the region. This attack highlights the active conflict and direct engagement between Iran and US military assets in Iraq. The strike signifies an escalation in hostilities and the persistent threat under which US bases in the area operate.",
    "keyword_matches": 6,
    "matched_keywords": [
      "missile",
      "attack",
      "threat",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "Erbil, Iraq",
      "brief": "The missile strike on a US military base in Erbil represents a direct escalation by Iran, showcasing the direct engagement between Iranian forces and US military assets in Iraq."
    },
    "merged_source_count": 2,
    "lat": 36.19,
    "lng": 44.01
  },
  {
    "id": "58493e45bdf1d4ab",
    "title_original": "Images show the wreckage of an Israeli Hermes drone, reportedly shot down today by Iranian air defenses over Khomein ...",
    "content_original": "Images show the wreckage of an Israeli Hermes drone, reportedly shot down today by Iranian air defenses over Khomein in Markazi Province. @PressTV",
    "url": "https://t.me/presstv/177278",
    "published": "2026-02-28T20:02:05+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian air defenses shoot down Israeli Hermes drone over Khomein",
    "translated": true,
    "relevant": true,
    "summary_en": "Iranian air defenses reportedly shot down an Israeli Hermes drone in Khomein, Markazi Province. This incident highlights ongoing tensions and potential escalation between Israel and Iran, with both sides engaging in surveillance and countermeasures. The strategic significance lies in the continued intelligence gathering and disruption efforts in the region.",
    "keyword_matches": 3,
    "matched_keywords": [
      "shoot down",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Khomein, Markazi Province, Iran",
      "brief": "The downing of an Israeli Hermes drone by Iran demonstrates ongoing intelligence warfare and escalation risks between Israel and Iran, with potential implications for US regional interests."
    },
    "lat": 33.64,
    "lng": 50.08
  },
  {
    "id": "496333fc7e41a306",
    "title_original": "۲ افسر ارتشی قزوین در حملات پهپادی دشمن به شهادت رسیدند",
    "content_original": "۲ افسر ارتشی قزوین در حملات پهپادی دشمن به شهادت رسیدند",
    "url": "https://www.irna.ir/news/86089875/%DB%B2-%D8%A7%D9%81%D8%B3%D8%B1-%D8%A7%D8%B1%D8%AA%D8%B4%DB%8C-%D9%82%D8%B2%D9%88%DB%8C%D9%86-%D8%AF%D8%B1-%D8%AD%D9%85%D9%84%D8%A7%D8%AA-%D9%BE%D9%87%D9%BE%D8%A7%D8%AF%DB%8C-%D8%AF%D8%B4%D9%85%D9%86-%D8%A8%D9%87-%D8%B4%D9%87%D8%A7%D8%AF%D8%AA-%D8%B1%D8%B3%DB%8C%D8%AF%D9%86%D8%AF",
    "published": "2026-02-28T20:02:00+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Two Qazvin Army Officers Killed in Enemy Drone Attacks",
    "relevant": true,
    "summary_en": "Two officers from the Qazvin Army were killed in enemy drone strikes. The attacks occurred in Qazvin, Iran, and highlight the ongoing threat of drone warfare within Iranian territory. This incident underscores the escalating conflict and the use of unmanned aerial systems as a primary tool for targeted attacks.",
    "translated": true,
    "keyword_matches": 7,
    "matched_keywords": [
      "conflict",
      "threat",
      "killed",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Unspecified enemy (likely US or allied forces)"
      ],
      "location": "Qazvin, Iran",
      "brief": "Drone strikes killing Iranian military officers in Qazvin highlight the use of unmanned systems in targeted attacks within Iran, signaling escalation in the conflict."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "70217a833c68981b",
    "title_original": "تعداد شهدای حملات آمریکا - صهیونی در آذربایجان شرقی  به ۶ نفر رسید/حمله موشکی به ۲۰ نقطه",
    "content_original": "تعداد شهدای حملات آمریکا - صهیونی در آذربایجان شرقی  به ۶ نفر رسید/حمله موشکی به ۲۰ نقطه",
    "url": "https://www.irna.ir/news/86089854/%D8%AA%D8%B9%D8%AF%D8%A7%D8%AF-%D8%B4%D9%87%D8%AF%D8%A7%DB%8C-%D8%AD%D9%85%D9%84%D8%A7%D8%AA-%D8%A2%D9%85%D8%B1%DB%8C%DA%A9%D8%A7-%D8%B5%D9%87%DB%8C%D9%88%D9%86%DB%8C-%D8%AF%D8%B1-%D8%A2%D8%B0%D8%B1%D8%A8%D8%A7%DB%8C%D8%AC%D8%A7%D9%86-%D8%B4%D8%B1%D9%82%DB%8C-%D8%A8%D9%87-%DB%B6-%D9%86%D9%81%D8%B1",
    "published": "2026-02-28T20:00:40+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Casualties in Azerbaijan from US-Israeli attacks rise to 6; missile strikes hit 20 locations",
    "relevant": true,
    "summary_en": "Six people have been killed in Azerbaijan's East Azerbaijan province as a result of US-Israeli attacks, with missile strikes targeting 20 locations. This indicates an escalation in the conflict's reach into Azerbaijan, potentially involving US or Israeli operations against Iranian-linked assets in the region.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "killed",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "proxy_operation",
      "severity": "high",
      "parties_involved": [
        "US",
        "Israel",
        "Iran",
        "Azerbaijan"
      ],
      "location": "East Azerbaijan province, Azerbaijan",
      "brief": "The escalation of US-Israeli attacks in Azerbaijan targeting Iranian-linked assets signifies a significant expansion of the conflict's geographic scope and potential for direct confrontation with Iran."
    },
    "lat": 38.073621,
    "lng": 46.3000401
  },
  {
    "id": "f353536d3c3c46f2",
    "title_original": "A high-rise building in Bahrain was engulfed in flames after being hit by an Iranian Shahed drone. @PressTV",
    "content_original": "A high-rise building in Bahrain was engulfed in flames after being hit by an Iranian Shahed drone. @PressTV",
    "url": "https://t.me/presstv/177277",
    "published": "2026-02-28T19:58:48+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "Iranian Shahed drone hits high-rise building in Bahrain causing fire",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian Shahed drone struck a high-rise building in Bahrain, causing it to be engulfed in flames. This incident represents an escalation of Iranian attacks into the Gulf region, targeting infrastructure in Bahrain, a key US ally. The attack highlights the ongoing threat to US interests and regional stability as hostilities continue.",
    "keyword_matches": 4,
    "matched_keywords": [
      "threat",
      "drone",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Bahrain",
        "United States"
      ],
      "location": "Bahrain",
      "brief": "The drone strike on Bahrain by Iran represents a significant escalation targeting US ally infrastructure, posing a direct threat to regional stability and US interests in the Gulf."
    },
    "lat": 26.07,
    "lng": 50.55
  },
  {
    "id": "4ccf1c49563bb2fe",
    "title_original": "فیلم | فاجعه خونین لامرد؛ ۱۸ شهید و ۱۰۰ مجروح در حمله موشکی رژیم صهیونیستی و آمریکا",
    "content_original": "فیلم | فاجعه خونین لامرد؛ ۱۸ شهید و ۱۰۰ مجروح در حمله موشکی رژیم صهیونیستی و آمریکا",
    "url": "https://www.irna.ir/news/86089874/%D9%81%DB%8C%D9%84%D9%85-%D9%81%D8%A7%D8%AC%D8%B9%D9%87-%D8%AE%D9%88%D9%86%DB%8C%D9%86-%D9%84%D8%A7%D9%85%D8%B1%D8%AF-%DB%B1%DB%B8-%D8%B4%D9%87%DB%8C%D8%AF-%D9%88-%DB%B1%DB%B0%DB%B0-%D9%85%D8%AC%D8%B1%D9%88%D8%AD-%D8%AF%D8%B1-%D8%AD%D9%85%D9%84%D9%87-%D9%85%D9%88%D8%B4%DA%A9%DB%8C-%D8%B1%DA%98%DB%8C%D9%85",
    "published": "2026-02-28T19:58:34+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "18 Killed and 100 Injured in Missile Attack by Israeli and US Forces in Lamard",
    "relevant": true,
    "summary_en": "Israeli and US forces conducted a missile attack in Lamard, Iran, resulting in 18 fatalities and 100 injuries. This incident signifies an escalation in the ongoing conflict, highlighting the direct military engagement on Iranian soil by US and Israeli forces.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "conflict",
      "missile",
      "killed",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Lamard, Iran",
      "brief": "The airstrike by US and Israeli forces on Iranian soil marks a significant escalation, demonstrating direct military engagement and potential for broader conflict."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "f799fbaba42c93e9",
    "title_original": "'Dubai's nightmare': Iranian strikes shatter calm of UAE business hub",
    "content_original": "'Dubai's nightmare': Iranian strikes shatter calm of UAE business hub Iran &nbsp;unleashed a furious missile and drone assault across the Arabian Gulf on Saturday in response to a surprise&nbsp; US-Israeli attack , but one city in particular appeared to bear the&nbsp; brunt &nbsp;of it: Dubai. The Gulf emirate, one of seven in the&nbsp; UAE , is the region’s good-time capital, where lucrative business deals can be sealed and celebrated. On Saturday, it was engulfed in billowing smoke and flames as missiles and drones rained down on it. The strikes have more than just geopolitical significance, denting Dubai's reputation for being an oasis of calm and commerce in the Middle East. Dubai has benefited potentially more than any other city in the world from the post-Covid boom of soaring asset prices, cryptocurrency, and remote work. Capitalising on its low tax rate and smooth bureaucracy, Dubai has become a magnet for London bankers and American “finance bros.\" Its financial institutions h...",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/dubais-nightmare-iranian-strikes-shatter-calm-uae-business-hub",
    "published": "2026-02-28T19:53:17+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Iranian strikes hit UAE's Dubai, shattering calm of business hub",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran launched missile and drone attacks on the UAE, specifically targeting Dubai, in retaliation for a US-Israeli strike. The attacks caused significant damage and disrupted the city's reputation as a stable business center. This escalation has serious geopolitical and economic implications for the region.",
    "keyword_matches": 3,
    "matched_keywords": [
      "missile",
      "drone",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE",
        "US",
        "Israel"
      ],
      "location": "Dubai, UAE",
      "brief": "Iran's missile and drone strikes on Dubai, a major UAE city and international business hub, signal a significant escalation in the conflict with potential for direct US involvement due to the UAE's close alliance with the US."
    },
    "merged_source_count": 3,
    "lat": 25.2,
    "lng": 55.27
  },
  {
    "id": "34c4122e431a6406",
    "title_original": "حمله رژیم صهیونیستی به قم تلفات جانی نداشت",
    "content_original": "حمله رژیم صهیونیستی به قم تلفات جانی نداشت",
    "url": "https://www.irna.ir/news/86089861/%D8%AD%D9%85%D9%84%D9%87-%D8%B1%DA%98%DB%8C%D9%85-%D8%B5%D9%87%DB%8C%D9%88%D9%86%DB%8C%D8%B3%D8%AA%DB%8C-%D8%A8%D9%87-%D9%82%D9%85-%D8%AA%D9%84%D9%81%D8%A7%D8%AA-%D8%AC%D8%A7%D9%86%DB%8C-%D9%86%D8%AF%D8%A7%D8%B4%D8%AA",
    "published": "2026-02-28T19:51:20+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Israeli regime attack on Qom results in no casualties",
    "relevant": true,
    "summary_en": "Israel launched an attack on Qom, Iran, but there were no reported casualties. This incident highlights ongoing tensions and direct confrontations between Israel and Iran amidst the broader conflict. The lack of casualties may influence Iran's response, but the attack itself signifies escalation by Israel.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Qom, Iran",
      "brief": "Israel's airstrike on Qom, despite causing no casualties, represents a direct escalation in the Israel-Iran conflict, posing potential risks of broader regional escalation within the Iran-US war context."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "1f8fd031b197e47f",
    "title_original": "🇮🇱 🇺🇸 🇮🇷   On the Iran-Israel War:  /CIG/  #commentary Main takeaway is that the Iranian response was timely, instead...",
    "content_original": "🇮🇱 🇺🇸 🇮🇷 On the Iran-Israel War: /CIG/ #commentary Main takeaway is that the Iranian response was timely, instead of the 24-48 hour wait last time. Pretty decent day one for Iran. Expected performance by the US et al. Global shipping might be the main casualty here. Unknown what will happen to oil & gas. The main damage caused by Iran et al in recent years was by shutting down the Suez. The US also appears to be shifting towards lower-cost kamikaze drones, taking a page out of Iran's book. Iran focused on radars and anything which aids interceptions. This is better than hitting symbolic buildings like last time. They're taking taking big hits and their leadership may or may not be dead, but they prepared for decentralized military coordination. So it's like a unit by unit basis of commanders making self authorized decisions. Main US military impact is that this will functionally use up the remainder of munitions that would have been used on China. Also the US is not invading Iran shock...",
    "url": "https://t.me/CIG_telegram/69683",
    "published": "2026-02-28T19:48:26+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iran's Timely Response in Conflict with Israel and US",
    "translated": true,
    "relevant": true,
    "summary_en": "The article discusses Iran's swift response in the ongoing conflict, contrasting it with a previous 24-48 hour delay. Iran focused on targeting radars and interception systems, showcasing a more strategic approach. The conflict's impact on global shipping and potential disruptions to oil and gas are highlighted, with concerns over the Suez Canal being a major casualty. The US is also noted to be adopting Iran's kamikaze drone tactics, reflecting a shift in military strategy.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Israel",
        "United States"
      ],
      "location": "Suez Canal region",
      "brief": "Iran's strategic use of kamikaze drones to target radars and interception systems, coupled with the US adopting similar tactics, escalates the conflict and threatens global shipping through the Suez Canal."
    },
    "lat": -33.5358697,
    "lng": -70.6723944
  },
  {
    "id": "f319fc605c50a854",
    "title_original": "⚡ #UPDATE  Israeli ambassador to Washington Yechiel Leiter told U.S. officials that Iran's supreme leader Ali Khamene...",
    "content_original": "⚡ #UPDATE Israeli ambassador to Washington Yechiel Leiter told U.S. officials that Iran's supreme leader Ali Khamenei has been killed in the Israeli strike on his compound, a source with knowledge said No statement or confirmation from the Iranian side as of now. We will wait.",
    "url": "https://t.me/warmonitors/40089",
    "published": "2026-02-28T19:44:05+00:00",
    "source_name": "War Monitors (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Israeli ambassador claims Iran’s Supreme Leader Khamenei killed in Israeli strike",
    "translated": true,
    "relevant": true,
    "summary_en": "Israel's ambassador to the US, Yechiel Leiter, informed US officials that Iran's Supreme Leader Ali Khamenei may have been killed in an Israeli strike on his compound. This has not been confirmed by Iranian sources. If true, this would be a significant escalation with major implications for Iran's leadership and the ongoing conflict.",
    "keyword_matches": 5,
    "matched_keywords": [
      "conflict",
      "killed",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Iran (specific location not confirmed)",
      "brief": "The potential killing of Iran's Supreme Leader Khamenei by an Israeli strike would represent a significant escalation in the conflict with major implications for regional stability and Iranian leadership continuity."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "78d72355e864a693",
    "title_original": "В Иране ракетному удару подвергся город Бушер, где расположена АЭС",
    "content_original": "В Иране ракетному удару подвергся город Бушер, где расположена АЭС",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26592227",
    "published": "2026-02-28T19:42:15+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Missile Strike Hits Bushehr, Home to Nuclear Power Plant",
    "relevant": true,
    "summary_en": "An unidentified party launched a missile strike on the city of Bushehr in Iran, which hosts a nuclear power plant. The attack's impact on the facility and surrounding areas is currently unclear. This incident is significant due to the potential for escalation involving Iran's nuclear infrastructure and the risk of radiological consequences.",
    "translated": true,
    "keyword_matches": 8,
    "matched_keywords": [
      "attack",
      "nuclear",
      "missile",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "unknown_attacker",
        "iran"
      ],
      "location": "Bushehr, Iran",
      "brief": "The missile strike on Bushehr, home to a nuclear power plant, raises the risk of nuclear escalation and potential radiological consequences, posing a direct threat to Iran's nuclear infrastructure."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "2fb4db2d7bf51808",
    "title_original": "🇮🇷 🇦🇪 ⚡️ - BREAKING: Initial reports that Iran has bombed the Jebel Ali port in the UAE.",
    "content_original": "🇮🇷 🇦🇪 ⚡️ - BREAKING: Initial reports that Iran has bombed the Jebel Ali port in the UAE.",
    "url": "https://t.me/CIG_telegram/69679",
    "published": "2026-02-28T19:33:20+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iran reportedly bombs Jebel Ali port in UAE",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran has reportedly launched an attack on the Jebel Ali port in the UAE, a major commercial port and logistics hub. This represents a significant escalation of hostilities, targeting critical infrastructure in a Gulf state allied with the US. The attack could disrupt regional trade and provoke further international response.",
    "keyword_matches": 2,
    "matched_keywords": [
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE",
        "United States"
      ],
      "location": "Jebel Ali port, UAE",
      "brief": "Iran's attack on the UAE's Jebel Ali port, a critical US-allied logistics hub, signifies a significant escalation in regional hostilities and threatens regional trade and stability."
    },
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "8440abab9f68dcd7",
    "title_original": "🇺🇸 🇮🇷 ⚡️  — U.S. Central Command: CENTCOM's Task Force Scorpion Strike - for the first time in history - is using one...",
    "content_original": "🇺🇸 🇮🇷 ⚡️ — U.S. Central Command: CENTCOM's Task Force Scorpion Strike - for the first time in history - is using one-way attack drones in combat during Operation Epic Fury. These low-cost drones, modeled after Iran's Shahed drones, are now delivering American-made retribution.",
    "url": "https://t.me/CIG_telegram/69678",
    "published": "2026-02-28T19:32:43+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "CENTCOM's Task Force Scorpion Strike deploys one-way attack drones in Operation Epic Fury for the first time",
    "translated": true,
    "relevant": true,
    "summary_en": "The U.S. Central Command has initiated the use of one-way attack drones, modeled after Iran's Shahed drones, in Operation Epic Fury. This marks the first historical deployment of such low-cost drones in combat by Task Force Scorpion Strike, indicating a new phase in U.S. retaliation efforts against Iran-linked threats.",
    "keyword_matches": 4,
    "matched_keywords": [
      "strike",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "United States",
        "CENTCOM",
        "Task Force Scorpion Strike"
      ],
      "location": "Unspecified (likely Middle East region)",
      "brief": "The deployment of one-way attack drones by the U.S. in Operation Epic Fury signifies a new phase in retaliatory operations against Iran-linked threats, highlighting evolving tactics in the conflict."
    }
  },
  {
    "id": "77161864b08f03d6",
    "title_original": "КСИР: число сбитых Ираном израильских БПЛА Hermes выросло до пяти",
    "content_original": "Их уничтожили в небе над Исфаханом",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26592113",
    "published": "2026-02-28T19:31:19+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC: Number of Israeli Hermes UAVs shot down by Iran increased to five",
    "relevant": true,
    "summary_en": "The IRGC reported that Iran shot down five Israeli Hermes UAVs over Isfahan. This incident highlights ongoing tensions and military engagements between Iran and Israel amid the broader conflict. The shootdowns demonstrate Iran's air defense capabilities and Israel's continued surveillance or strike operations against Iranian targets.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "irgc",
      "air defense",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Isfahan, Iran",
      "brief": "Iran's shootdown of Israeli Hermes UAVs demonstrates ongoing surveillance and defensive engagements between the two nations, highlighting the regional proxy conflict's escalation potential."
    },
    "lat": 32.65,
    "lng": 51.68
  },
  {
    "id": "15f37702e3b56620",
    "title_original": "Petra: ВС Иордании перехватили и сбили 49 иранских баллистических ракет и БПЛА",
    "content_original": "Иорданские системы ПВО успешно перехватили 13 баллистических ракет, уточняет агентство",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26592087",
    "published": "2026-02-28T19:30:39+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Jordanian Air Defenses Intercept and Shoot Down 49 Iranian Ballistic Missiles and Drones",
    "relevant": true,
    "summary_en": "Jordanian armed forces intercepted and destroyed 49 Iranian ballistic missiles and drones, including 13 ballistic missiles, over their territory. This incident highlights the ongoing threat posed by Iranian missile and drone attacks in the region and the critical role of regional air defenses in countering these threats.",
    "translated": true,
    "keyword_matches": 8,
    "matched_keywords": [
      "missile",
      "shoot down",
      "ballistic",
      "intercept",
      "drone",
      "threat"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "high",
      "parties_involved": [
        "Jordan",
        "Iran"
      ],
      "location": "Jordan",
      "brief": "The incident underscores the escalating regional threat from Iranian ballistic missile and drone attacks, highlighting the critical role of allied air defenses in countering Iranian aggression."
    },
    "lat": 31.17,
    "lng": 36.94
  },
  {
    "id": "f0f17f44ab2ad240",
    "title_original": "⚡️ #BREAKING  INSANE video reportedly from Al Udeid Air Base in Qatar supposedly showing Air defence failing to inter...",
    "content_original": "⚡️ #BREAKING INSANE video reportedly from Al Udeid Air Base in Qatar supposedly showing Air defence failing to intercept an Iranian missile, which ends up striking the base (unconfirmed)",
    "url": "https://t.me/warmonitors/40085",
    "published": "2026-02-28T19:24:06+00:00",
    "source_name": "War Monitors (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Iranian missile reportedly strikes Al Udeid Air Base in Qatar, air defense fails to intercept",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian missile reportedly hit Al Udeid Air Base in Qatar, with local reports suggesting that air defense systems failed to intercept the missile. This incident, if confirmed, signifies a significant escalation in the conflict and direct targeting of a major US military facility in the region.",
    "keyword_matches": 8,
    "matched_keywords": [
      "conflict",
      "air defense",
      "intercept",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "high",
      "parties_involved": [],
      "location": "Unknown",
      "brief": "Classified by keyword matching (LLM unavailable)"
    },
    "merged_source_count": 2
  },
  {
    "id": "0f5bf73ce0279539",
    "title_original": "Netanyahu says Iran war to continue ‘as long as necessary’, claims Khamenei likely killed",
    "content_original": "Netanyahu says Iran war to continue ‘as long as necessary’, claims Khamenei likely killed Israeli Prime Minister Benjamin Netanyahu has issued his first statement since launching the war on Iran. “This fateful operation will continue as long as necessary - patience is needed. This war will bring about true peace,” Netanyahu claimed on Saturday evening. He also appeared to reference reports of an attempt on the life of Iran’s Supreme Leader, Ayatollah Ali Khamenei. “We destroyed the compound of the dictator Khamenei. There are many signs that this dictator is gone,” he said. In a direct message to Iranians, Netanyahu urged public unrest. “To the citizens of Iran - do not miss the opportunity. Your moment will soon come to take to the streets, complete the task, and overthrow the regime that is making your lives miserable.”",
    "url": "https://www.middleeasteye.net/live-blog/live-blog-update/netanyahu-says-iran-war-continue-long-necessary-claims-khamenei-likely",
    "published": "2026-02-28T19:15:59+00:00",
    "source_name": "Middle East Eye",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Netanyahu says Iran war to continue ‘as long as necessary’, claims Khamenei likely killed",
    "translated": true,
    "relevant": true,
    "summary_en": "Israeli Prime Minister Benjamin Netanyahu announced that the war against Iran will continue until deemed necessary and suggested that Iran’s Supreme Leader Ayatollah Ali Khamenei may have been killed in an attack on his compound. He also called for public unrest within Iran, signaling a strategic escalation in the conflict.",
    "keyword_matches": 6,
    "matched_keywords": [
      "war",
      "conflict",
      "killed",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "escalation",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Iran (reportedly at Khamenei's compound)",
      "brief": "Israeli Prime Minister Netanyahu's declaration of continued war against Iran and suggestion of a potential strike on Ayatollah Khamenei signals a significant escalation in the conflict."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "e3e573cd0e62c07a",
    "title_original": "Удары США, Израиля и Ирана. Спецэфир телеканала РБК",
    "content_original": "28 февраля США и Израиль объявили о военной операции против Ирана, по стране было нанесено множество ударов.",
    "url": "https://www.rbc.ru/politics/28/02/2026/69a310339a794761bb1e52b7",
    "published": "2026-02-28T19:00:18+03:00",
    "source_name": "RBC",
    "source_category": "independent",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "UAE Successfully Repel Third Wave of Iranian Missiles in One Day",
    "relevant": true,
    "summary_en": "The UAE intercepted and repelled a third wave of Iranian missiles targeting their territory within a single day. This incident highlights the ongoing escalation of hostilities in the Gulf region, with Iran continuing its missile campaign against the UAE. The successful defense by UAE air defenses underscores the critical role of missile defense systems in protecting critical infrastructure and population centers amidst the conflict.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE"
      ],
      "location": "United Arab Emirates",
      "brief": "Iran's missile attacks on the UAE signal an escalation in regional hostilities, demonstrating Iran's willingness to target US allies in the Gulf despite active missile defense systems."
    },
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "6485f92e527760ea",
    "title_original": "Israeli Air Force conducts its largest-ever attack as over 200 aircraft strike 500 targets in Iran",
    "content_original": "In the Tabriz area, the IDF struck a major site from which the Islamic Republic has fired dozens of ballistic missiles at Israel.",
    "url": "https://www.jpost.com/middle-east/iran-news/article-888293",
    "published": "2026-02-28T18:57:32+00:00",
    "source_name": "Jerusalem Post",
    "source_category": "independent",
    "language": "en",
    "region": "israel",
    "skip_translation": true,
    "title_en": "Israeli Air Force conducts its largest-ever attack on Iran with over 200 aircraft striking 500 targets",
    "translated": true,
    "relevant": true,
    "summary_en": "The Israeli Air Force launched its largest-ever attack on Iran, deploying over 200 aircraft to strike 500 targets, including a major ballistic missile site near Tabriz from which Iran had launched attacks on Israel. This operation signifies a significant escalation in Israeli operations against Iranian military infrastructure and is a direct response to Iran's missile attacks on Israel.",
    "keyword_matches": 6,
    "matched_keywords": [
      "ballistic",
      "strike",
      "missile",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Tabriz, Iran",
      "brief": "Israel's largest-ever airstrike on Iran, targeting 500 sites including a ballistic missile facility, marks a significant escalation in regional conflict dynamics."
    },
    "lat": 38.08,
    "lng": 46.29,
    "merged_source_count": 2
  },
  {
    "id": "be03129ba334a6b1",
    "title_original": "В центральном штабе войск ПВО Ирана подтвердили удары по 14 военным базам США",
    "content_original": "В центральном штабе войск ПВО Ирана подтвердили удары по 14 военным базам США",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26591611",
    "published": "2026-02-28T18:53:33+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iranian Air Defense Command Confirms Strikes on 14 US Military Bases",
    "relevant": true,
    "summary_en": "The Iranian Air Defense Command has confirmed that Iran launched strikes targeting 14 US military bases. This indicates a significant escalation in the ongoing conflict, showcasing Iran's continued offensive operations against US assets in the region. The strikes likely involved ballistic missiles and drones, reflecting Iran's capability to target US military infrastructure across multiple locations.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "offensive",
      "conflict",
      "ballistic",
      "air defense"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us|ballistic_missile|drone_strike",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "14 US military bases",
      "brief": "Iran's coordinated ballistic missile and drone strikes on 14 US military bases mark a critical escalation, demonstrating significant offensive capability and intent to target US military infrastructure directly."
    },
    "lat": 42.9663688,
    "lng": -0.0852324
  },
  {
    "id": "ee545b4772ea82fc",
    "title_original": "Аэропорт Шарджи в ОАЭ прекратил работу из-за ракетной атаки Ирана",
    "content_original": "Международный аэропорт Шарджи в ОАЭ остановил прием и отправку рейсов «до дальнейшего уведомления в рамках действующих превентивных мер». Об этом сообщили в Ассоциации туроператоров (АТОР).",
    "url": "https://www.kommersant.ru/doc/8477210",
    "published": "2026-02-28T18:50:31+03:00",
    "source_name": "Kommersant",
    "source_category": "independent",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Sharjah Airport in UAE Suspends Operations Due to Iranian Missile Attack",
    "relevant": true,
    "summary_en": "Iran launched a missile attack targeting Sharjah Airport in the UAE, prompting the airport to halt flight operations indefinitely as a precautionary measure. This incident highlights the escalating regional tensions and direct threats to critical infrastructure in the UAE amidst the ongoing Iran-US conflict. The attack's strategic significance lies in disrupting civilian aviation and potentially deterring further international engagement in the region.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "attack",
      "conflict",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "United Arab Emirates",
        "US (indirect)"
      ],
      "location": "Sharjah Airport, UAE",
      "brief": "Iran's missile attack on Sharjah Airport in the UAE demonstrates direct targeting of critical infrastructure in a US-aligned nation, escalating regional tensions and posing a strategic threat to international engagement."
    },
    "lat": 24.0,
    "lng": 54.0
  },
  {
    "id": "9bfdb82aa457164f",
    "title_original": "Иран нанес ракетный удар по Тель-Авиву, пишет Tasnim",
    "content_original": "Иран нанес ракетный удар по Тель-Авиву, пишет Tasnim",
    "url": "https://ria.ru/20260228/tasnim-2077490437.html",
    "published": "2026-02-28T18:48:15+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran launches missile strike on Tel Aviv",
    "relevant": true,
    "summary_en": "Iran's IRGC reportedly launched a missile strike targeting Tel Aviv, Israel. This represents a significant escalation in the conflict, demonstrating Iran's willingness to directly target Israeli population centers. The strike will likely prompt a strong Israeli military response and draw further international attention to the escalating regional conflict.",
    "translated": true,
    "keyword_matches": 8,
    "matched_keywords": [
      "irgc",
      "missile",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Tel Aviv, Israel",
      "brief": "Iran's direct missile strike on Tel Aviv marks a significant escalation, demonstrating Iran's intent to target Israeli population centers and escalating the regional conflict."
    },
    "lat": 32.08,
    "lng": 34.78,
    "merged_source_count": 4
  },
  {
    "id": "9a12ebee24ca55d9",
    "title_original": "МИД Ирана назвал актом самообороны атаки Тегерана против американских баз",
    "content_original": "Глава иранского дипведомства Аббас Арагчи уведомил об этом страны Персидского залива",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590905",
    "published": "2026-02-28T18:42:47+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran's Foreign Ministry Calls Tehran's attacks on US bases an act of self-defense",
    "relevant": true,
    "summary_en": "Iran's Foreign Minister, Abbas Araghchi, informed Gulf countries that Tehran's attacks on US bases were acts of self-defense. This statement highlights Iran's justification for its military actions amidst ongoing hostilities with the US, signaling potential escalation or continued conflict in the region.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "US bases in the region",
      "brief": "Iran's justification of its attacks on US bases as self-defense indicates ongoing direct military engagement, posing a significant escalation risk in the conflict."
    },
    "lat": 52.4577754,
    "lng": -1.8692099
  },
  {
    "id": "dcd9399dd9fd9563",
    "title_original": "00:00 The Lancet loitering munition crew of the Zapad Group of Forces  burned down the AFU engineering equipment and ...",
    "content_original": "00:00 The Lancet loitering munition crew of the Zapad Group of Forces burned down the AFU engineering equipment and thwarted the enemy attempt to restore a strategic crossing means in Krasny Liman direction. 00:17 The Sever Group's FPV drone operator destroyed a signal amplifier to control enemy UAVs in Kharkov region. 00:27 The Yuzhnaya Group's servicemen of the volunteer corps neutralised the AFU manpower, hardware, and drone control systems in Kramatorsk-Druzhkovka direction. 00:40 Tsentr Group's attack UAV teams eliminated enemy manpower in Dobropolye direction. The drones also hit dugouts with AFU personnel in Krasnoarmeysk direction. 🔹 Russian Defence Ministry",
    "url": "https://t.me/mod_russia_en/25904",
    "published": "2026-02-28T18:34:55+00:00",
    "source_name": "Russian MoD English (TG)",
    "source_category": "state",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Russian Forces Use Drones to Target Ukrainian Military Equipment and Personnel in Multiple Regions",
    "translated": true,
    "relevant": true,
    "summary_en": "Russian military units, including the Zapad, Sever, Yuzhnaya, and Tsentr Groups, conducted coordinated drone strikes targeting Ukrainian engineering equipment, UAV control systems, and personnel in Krasny Liman, Kharkov, Kramatorsk-Druzhkovka, and Dobropolye directions. These attacks disrupted Ukrainian efforts to restore strategic crossings and control UAV operations, showcasing Russia's continued use of drone warfare in the conflict.",
    "keyword_matches": 3,
    "matched_keywords": [
      "drone",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "low",
      "parties_involved": [
        "Russia",
        "Ukraine"
      ],
      "location": "Krasny Liman, Kharkov, Kramatorsk-Druzhkovka, Dobropolye",
      "brief": "The article describes a regional conflict involving drone strikes by Russia against Ukraine, which is unrelated to the Iran–US conflict and has no direct strategic implications for it."
    },
    "lat": 49.9923181,
    "lng": 36.2310146
  },
  {
    "id": "4d26c40b6dbc351b",
    "title_original": "US and Israel launch major attack on Iran to trigger regime change as Tehran retaliates across the Middle East – live",
    "content_original": "Iran’s foreign minister says Donald Trump’s aim of regime change is ‘mission impossible’; 201 people killed in Iran, media reports say Full report: US and Israel attack Iran Analysis: Trump’s attack has no mandate A visual guide to the US-Israeli strikes on Iran – and Tehran’s response Blasts have been heard in several cities, including the capital, Tehran, and Isfahan in central Iran. Reuters reports there are long queues at petrol stations in the capital, as many people try to leave. An unnamed Iranian official who spoke to the news agency said several ministries in southern Tehran had been targeted. Continue reading...",
    "url": "https://www.theguardian.com/world/live/2026/feb/28/israel-attacks-iran-as-blasts-heard-in-tehran-live-updates",
    "published": "2026-02-28T18:34:54+00:00",
    "source_name": "The Guardian World",
    "source_category": "independent",
    "language": "en",
    "region": "western",
    "skip_translation": true,
    "title_en": "US and Israel launch major attack on Iran triggering widespread retaliation",
    "translated": true,
    "relevant": true,
    "summary_en": "The US and Israel have launched a significant attack targeting Iran, aiming for regime change, while Iran retaliates with strikes across the Middle East. The conflict has resulted in at least 201 reported deaths in Iran, with strikes hitting multiple cities including Tehran and Isfahan. The attacks have caused disruption and panic, with long queues at petrol stations as civilians attempt to flee.",
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "deaths",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Tehran, Isfahan, Iran",
      "brief": "The US and Israel have launched a significant coordinated attack on Iran, escalating the conflict to a direct state engagement with widespread retaliatory strikes, marking a major escalation in the Iran–US war."
    },
    "lat": 35.69,
    "lng": 51.39,
    "merged_source_count": 2
  },
  {
    "id": "8e6a296a940a13b5",
    "title_original": "Число погибших при ударе по школе в Иране выросло до 85",
    "content_original": "Число погибших при ударе по школе в Иране выросло до 85",
    "url": "https://ria.ru/20260228/iran-2077487278.html",
    "published": "2026-02-28T18:33:24+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Death toll from Iran school strike rises to 85",
    "relevant": true,
    "summary_en": "An airstrike or missile attack hit a school in Iran, resulting in at least 85 fatalities. The incident highlights the ongoing conflict's impact on civilian infrastructure and raises concerns about escalation. The responsible party is not specified, but it could be linked to US or Israeli operations given the context of the conflict.",
    "translated": true,
    "keyword_matches": 7,
    "matched_keywords": [
      "airstrike",
      "strike",
      "conflict",
      "missile",
      "death",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "US or Israel (suspected)"
      ],
      "location": "Iran",
      "brief": "The airstrike on an Iranian school resulting in at least 85 fatalities represents a significant escalation with potential direct involvement of US or Israeli forces, posing a critical threat to regional stability."
    },
    "lat": 32.6475314,
    "lng": 54.5643516,
    "merged_source_count": 9
  },
  {
    "id": "485bab8573fbf710",
    "title_original": "Terror of Western tourists and influencers in Dubai as they are hit by Iran missile and suicide drone blitz in retaliation for US air strikes",
    "content_original": "Terror of Western tourists and influencers in Dubai as they are hit by Iran missile and suicide drone blitz in retaliation for US air strikes",
    "url": "https://www.dailymail.co.uk/news/article-15601293/moment-Iranian-missiles-skies-Dubai-westerners.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
    "published": "2026-02-28T18:31:08+00:00",
    "source_name": "Daily Mail",
    "source_category": "independent",
    "language": "en",
    "region": "western",
    "skip_translation": true,
    "title_en": "Iran launches missile and suicide drone attacks on Dubai targeting Western tourists and influencers",
    "translated": true,
    "relevant": true,
    "summary_en": "Iran retaliated against US air strikes by launching missile and suicide drone attacks on Dubai, hitting areas frequented by Western tourists and influencers. The attacks demonstrate Iran's capability to strike US allies in the region and disrupt civilian life in urban centers. This escalation poses a significant threat to regional stability and tourism in Dubai.",
    "keyword_matches": 8,
    "matched_keywords": [
      "suicide",
      "strike",
      "threat",
      "drone",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "United Arab Emirates"
      ],
      "location": "Dubai, United Arab Emirates",
      "brief": "Iran's missile and suicide drone attacks on Dubai, targeting Western civilians, demonstrate a direct escalation against US allies and a significant threat to regional stability."
    },
    "lat": 25.2,
    "lng": 55.27,
    "merged_source_count": 7
  },
  {
    "id": "4c11c92a869bfb69",
    "title_original": "Almost 20 female volleyball players martyred in a US-Israeli airstrike in the Iranian city of Lamerd @PressTV",
    "content_original": "Almost 20 female volleyball players martyred in a US-Israeli airstrike in the Iranian city of Lamerd @PressTV",
    "url": "https://t.me/presstv/177269",
    "published": "2026-02-28T18:31:08+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "US-Israeli airstrike kills nearly 20 female volleyball players in Lamerd, Iran",
    "translated": true,
    "relevant": true,
    "summary_en": "A US-Israeli airstrike reportedly targeted the Iranian city of Lamerd, resulting in the deaths of nearly 20 female volleyball players. This incident highlights the ongoing conflict's impact on civilian populations and infrastructure within Iran. The strike's strategic significance remains unclear, but it could escalate tensions and provoke further Iranian retaliation.",
    "keyword_matches": 5,
    "matched_keywords": [
      "strike",
      "airstrike",
      "conflict",
      "deaths"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Israel",
        "Iran"
      ],
      "location": "Lamerd, Iran",
      "brief": "The US-Israeli airstrike resulting in civilian casualties in Iran could significantly escalate the conflict and provoke direct Iranian retaliation against US or Israeli assets."
    },
    "lat": 32.65,
    "lng": 54.56,
    "merged_source_count": 3
  },
  {
    "id": "9b307cef76fe594f",
    "title_original": "🇮🇱 🇺🇸 🇮🇷 ❗️ A burning Iranian frigate at an Iranian Navy base in Khorramshahr after airstrikes by the US and Israeli ...",
    "content_original": "🇮🇱 🇺🇸 🇮🇷 ❗️ A burning Iranian frigate at an Iranian Navy base in Khorramshahr after airstrikes by the US and Israeli air forces.",
    "url": "https://t.me/CIG_telegram/69657",
    "published": "2026-02-28T18:29:18+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "US and Israeli airstrikes hit Iranian Navy base in Khorramshahr, destroying a frigate",
    "translated": true,
    "relevant": true,
    "summary_en": "The US and Israeli air forces conducted a joint airstrike on an Iranian Navy base in Khorramshahr, resulting in a burning Iranian frigate. This strike signifies a significant escalation in direct military action against Iranian naval assets and infrastructure. The attack demonstrates increased coordination between the US and Israel against Iran amid the ongoing conflict.",
    "keyword_matches": 4,
    "matched_keywords": [
      "attack",
      "airstrike",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Khorramshahr, Iran",
      "brief": "The joint US-Israeli airstrike on an Iranian naval base marks a significant escalation in direct military engagement against Iran, showcasing increased coordination and targeting of Iranian naval assets."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "8bc1e682a86da401",
    "title_original": "At least 80 children dead as missile reportedly hits school in southern Iran",
    "content_original": "The building appears to be among many devastated in Trump’s ‘major combat operations’ as long expected attacks arrive US-Israeli attack on Iran – live updates US and Israel strikes on Iran: what we know so far Iran’s parents had just dropped their children off for class on Saturday morning when they found themselves racing back to school gates, as bombs began to fall across the country in a joint US-Israel attack. At one elementary school, according to Iran’s state-controlled media, they arrived to find devastation. At least 80 children had been killed in the strike on Shajareh Tayyebeh all girls’ school in Minab, southern Iran, the IRNA news agency reported, with dozens more unaccounted for. Continue reading...",
    "url": "https://www.theguardian.com/world/2026/feb/28/children-dead-as-missile-hits-elementary-school-in-southern-iran",
    "published": "2026-02-28T18:28:58+00:00",
    "source_name": "The Guardian World",
    "source_category": "independent",
    "language": "en",
    "region": "western",
    "skip_translation": true,
    "title_en": "Missile reportedly hits school in southern Iran, killing at least 80 children",
    "translated": true,
    "relevant": true,
    "summary_en": "A missile strike, attributed to a joint US-Israel attack, hit Shajareh Tayyebeh all girls' school in Minab, southern Iran, resulting in at least 80 children killed and dozens more unaccounted for. This incident highlights the direct impact on civilian infrastructure and the human cost of the ongoing conflict. The attack is part of escalating hostilities between the US-Israel alliance and Iran.",
    "keyword_matches": 7,
    "matched_keywords": [
      "strike",
      "killed",
      "missile",
      "conflict",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Minab, southern Iran",
      "brief": "The attack on a civilian school resulting in mass casualties represents a significant escalation in the conflict, highlighting the direct involvement of the US-Israel alliance in strikes against Iranian infrastructure."
    },
    "lat": 27.1,
    "lng": 57.08,
    "merged_source_count": 5
  },
  {
    "id": "ba072e23bdae6b52",
    "title_original": "بیشتر شهدای حادثه تروریستی لامرد کودک هستند؛ آماده‌باش کامل مراکز درمانی جنوب فارس",
    "content_original": "بیشتر شهدای حادثه تروریستی لامرد کودک هستند؛ آماده‌باش کامل مراکز درمانی جنوب فارس",
    "url": "https://www.irna.ir/news/86089797/%D8%A8%DB%8C%D8%B4%D8%AA%D8%B1-%D8%B4%D9%87%D8%AF%D8%A7%DB%8C-%D8%AD%D8%A7%D8%AF%D8%AB%D9%87-%D8%AA%D8%B1%D9%88%D8%B1%DB%8C%D8%B3%D8%AA%DB%8C-%D9%84%D8%A7%D9%85%D8%B1%D8%AF-%DA%A9%D9%88%D8%AF%DA%A9-%D9%87%D8%B3%D8%AA%D9%86%D8%AF-%D8%A2%D9%85%D8%A7%D8%AF%D9%87-%D8%A8%D8%A7%D8%B4-%DA%A9%D8%A7%D9%85%D9%84-%D9%85%D8%B1%D8%A7%DA%A9%D8%B2",
    "published": "2026-02-28T18:24:03+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Terrorist Attack in Lamard Kills Mostly Children; Southern Fars Medical Centers on High Alert",
    "relevant": true,
    "summary_en": "A terrorist attack in Lamard, Iran, resulted in multiple casualties, predominantly children. Southern Fars medical centers have been placed on high alert to handle the influx of patients. This incident highlights the ongoing security challenges and potential escalation of violence within Iran amidst the broader conflict.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [
        "Iran"
      ],
      "location": "Lamard, Southern Fars, Iran",
      "brief": "The attack, while not directly linked to the US-Iran conflict, exacerbates internal instability within Iran and could influence regional dynamics amid broader hostilities."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "d64a79db277d30d0",
    "title_original": "سخنگوی جمعیت هلال‌ احمر از ۷۴۷ مصدوم و ۲۰۱ شهید خبر داد",
    "content_original": "سخنگوی جمعیت هلال‌ احمر از ۷۴۷ مصدوم و ۲۰۱ شهید خبر داد",
    "url": "https://www.irna.ir/news/86089790/%D8%B3%D8%AE%D9%86%DA%AF%D9%88%DB%8C-%D8%AC%D9%85%D8%B9%DB%8C%D8%AA-%D9%87%D9%84%D8%A7%D9%84-%D8%A7%D8%AD%D9%85%D8%B1-%D8%A7%D8%B2-%DB%B7%DB%B4%DB%B7-%D9%85%D8%B5%D8%AF%D9%88%D9%85-%D9%88-%DB%B2%DB%B0%DB%B1-%D8%B4%D9%87%DB%8C%D8%AF-%D8%AE%D8%A8%D8%B1-%D8%AF%D8%A7%D8%AF",
    "published": "2026-02-28T18:21:07+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Red Crescent Reports 747 Injured and 201 Killed",
    "relevant": true,
    "summary_en": "The Red Crescent spokesperson announced that 747 people were injured and 201 were killed, likely in the ongoing conflict between Iran and the US. This suggests significant casualties from recent military strikes or retaliatory attacks in the region. The figures highlight the human cost of the escalating conflict and the need for humanitarian assistance.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "killed"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "region unspecified",
      "brief": "The high casualty figures reported by the Red Crescent indicate a significant escalation in the Iran-US conflict, likely involving direct military strikes with severe humanitarian consequences."
    }
  },
  {
    "id": "b380efefa92bdca9",
    "title_original": "🇮🇷 ‼️ ⚠️ 🔴 🇧🇭 🇺🇸 🇮🇱 So far, suicide attacks continue to pour towards the headquarters of the main US naval command in...",
    "content_original": "🇮🇷 ‼️ ⚠️ 🔴 🇧🇭 🇺🇸 🇮🇱 So far, suicide attacks continue to pour towards the headquarters of the main US naval command in Bahrain. 🔴 @alsaa_plus_EN",
    "url": "https://t.me/CIG_telegram/69654",
    "published": "2026-02-28T18:17:29+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Suicide Attacks Target US Naval Command Headquarters in Bahrain",
    "translated": true,
    "relevant": true,
    "summary_en": "Unidentified attackers are carrying out ongoing suicide attacks targeting the main US naval command headquarters in Bahrain. This is a significant escalation indicating a direct threat to US naval operations in the Gulf region and raises concerns about the security of US military assets in Bahrain.",
    "keyword_matches": 3,
    "matched_keywords": [
      "suicide",
      "threat"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Iran",
        "Unidentified attackers"
      ],
      "location": "Bahrain",
      "brief": "The ongoing suicide attacks on the US naval command headquarters in Bahrain represent a direct threat to US naval operations in the Gulf region, indicating a significant escalation in the Iran–US conflict."
    },
    "lat": 26.07,
    "lng": 50.55,
    "merged_source_count": 7
  },
  {
    "id": "401b5f3f5ff055e7",
    "title_original": "В Дохе произошла новая волна взрывов",
    "content_original": "В городе работает ПВО",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26591141",
    "published": "2026-02-28T18:15:15+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "New Wave of Explosions in Doha",
    "relevant": true,
    "summary_en": "Explosions have occurred in Doha, Qatar, with air defenses active in the city. This is significant as Doha hosts key US military bases and is a critical hub for US operations in the region amid the ongoing conflict with Iran.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "high",
      "parties_involved": [
        "Qatar",
        "United States",
        "Iran (suspected)"
      ],
      "location": "Doha, Qatar",
      "brief": "Explosions in Doha, home to key US military bases, suggest a potential escalation targeting US regional operations amid the Iran conflict, with significant implications for US military infrastructure and regional stability."
    },
    "lat": 25.3108807,
    "lng": 51.5081812,
    "merged_source_count": 2
  },
  {
    "id": "2c641097cb2206c3",
    "title_original": "КСИР объявил о начале новой волны ракетных атак по американским базам на Ближнем Востоке",
    "content_original": "КСИР объявил о начале новой волны ракетных атак по американским базам на Ближнем Востоке",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26591105",
    "published": "2026-02-28T18:11:55+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC Announces New Wave of Missile Attacks on US Bases in the Middle East",
    "relevant": true,
    "summary_en": "The IRGC has declared the commencement of a fresh wave of missile attacks targeting US military bases in the Middle East. This escalation signifies an intensification of hostilities by Iran against US assets in the region. The strategic significance lies in the potential for increased military engagement and retaliatory measures by the US.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "Middle East US military bases",
      "brief": "The IRGC's announcement of missile attacks on US bases in the Middle East marks a critical escalation, posing a direct threat to US assets and signaling potential for expanded military engagement."
    },
    "lat": 39.3014159,
    "lng": -76.5888477
  },
  {
    "id": "90b2f159796e6c8f",
    "title_original": "КСИР заявил о новой ракетной атаке на базы США",
    "content_original": "КСИР заявил о новой ракетной атаке на базы США",
    "url": "https://ria.ru/20260228/ssha-2077483249.html",
    "published": "2026-02-28T18:08:24+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC Claims New Missile Attack on US Bases",
    "relevant": true,
    "summary_en": "The IRGC has announced a new missile attack targeting US bases, likely in Iraq or Syria. This represents a continuation of Iranian retaliatory strikes against US military assets in the region. The attack signifies ongoing escalation and direct engagement between Iran and US forces amidst the conflict.",
    "translated": true,
    "keyword_matches": 8,
    "matched_keywords": [
      "attack",
      "missile",
      "conflict",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "IRGC",
        "US Military"
      ],
      "location": "Iraq or Syria",
      "brief": "The IRGC's missile attack on US bases in Iraq or Syria represents a significant escalation in direct military engagement between Iran and the US, posing a heightened risk of further regional conflict."
    }
  },
  {
    "id": "a5fa432707446dd5",
    "title_original": "Иранские системы ПВО сбили беспилотники HERMES, пишут СМИ",
    "content_original": "Иранские системы ПВО сбили беспилотники HERMES, пишут СМИ",
    "url": "https://ria.ru/20260228/pvo-2077483083.html",
    "published": "2026-02-28T18:07:56+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iranian Air Defense Systems Shoot Down HERMES Drones",
    "relevant": true,
    "summary_en": "Iranian air defense systems intercepted and shot down HERMES drones, as reported by media outlets. This incident likely occurred within Iranian territory or near its borders. The downing of drones is significant as it reflects ongoing tensions and potential surveillance or attack attempts amid the conflict.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "shoot down",
      "air defense",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "US (potential involvement through drone operations)"
      ],
      "location": "Iran or near Iranian borders",
      "brief": "Iran's successful interception of HERMES drones highlights ongoing surveillance or strike attempts, reflecting heightened tensions and potential escalation in the Iran–US conflict."
    }
  },
  {
    "id": "e58cf297c160f54c",
    "title_original": "В центральной части Израиля упали обломки ракеты",
    "content_original": "В центральной части Израиля упали обломки ракеты",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590989",
    "published": "2026-02-28T17:59:38+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Rocket Debris Falls in Central Israel",
    "relevant": true,
    "summary_en": "Rocket debris fell in central Israel, likely as a result of an attempted attack or misfire from a regional adversary such as Hezbollah or Hamas. This incident highlights ongoing tensions and threats to Israeli security amid the broader conflict involving Iran-linked groups. The event may prompt further Israeli military responses or defensive measures.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "hamas",
      "hezbollah",
      "conflict",
      "rocket",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran"
      ],
      "location": "Central Israel",
      "brief": "The incident underscores ongoing regional tensions and the potential for escalation as Iranian-backed groups like Hezbollah continue to threaten Israeli security."
    },
    "lat": 31.9,
    "lng": 34.8
  },
  {
    "id": "01ee98b7230d44b5",
    "title_original": "Mehr: силы ПВО Ирана сбили три БПЛА Hermes ВВС Израиля",
    "content_original": "Mehr: силы ПВО Ирана сбили три БПЛА Hermes ВВС Израиля",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590969",
    "published": "2026-02-28T17:57:51+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iranian Air Defenses Shoot Down Three Israeli Hermes UAVs",
    "relevant": true,
    "summary_en": "Iranian air defense forces have shot down three Israeli Hermes drones. This incident occurred in an unspecified location, likely near Iranian borders or within Iranian airspace. The downing of the drones signifies ongoing tensions and military engagements between Iran and Israel amid the broader conflict.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "conflict",
      "shoot down",
      "air defense"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Iranian airspace or borders",
      "brief": "The downing of Israeli Hermes drones by Iran highlights ongoing military tensions and engagements between the two nations, contributing to regional instability amid the broader Iran–US conflict."
    },
    "lat": 31.0661316,
    "lng": 46.2428192
  },
  {
    "id": "0459183ef8304656",
    "title_original": "Fars сообщило о воздушной атаке на иранский Шираз",
    "content_original": "Fars сообщило о воздушной атаке на иранский Шираз",
    "url": "https://ria.ru/20260228/fars-2077478443.html",
    "published": "2026-02-28T17:42:10+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Air Attack Reported on Iranian City of Shiraz",
    "relevant": true,
    "summary_en": "Unspecified forces reportedly conducted an air attack on the Iranian city of Shiraz. This incident signifies a potential escalation in the conflict as it involves direct strikes on Iranian urban centers. The military significance depends on the extent of damage and casualties, which are currently unspecified.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "attack",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "unspecified forces",
        "Iran"
      ],
      "location": "Shiraz, Iran",
      "brief": "The airstrike on Shiraz represents a significant escalation as it involves direct attacks on an Iranian urban center, potentially indicating a new phase in the conflict with heightened risks of direct state engagement."
    },
    "lat": 29.59,
    "lng": 52.58,
    "merged_source_count": 2
  },
  {
    "id": "bff6b55f22193810",
    "title_original": "Tasnim: Иран нанес удары по 14 американским базам",
    "content_original": "Tasnim: Иран нанес удары по 14 американским базам",
    "url": "https://ria.ru/20260228/iran-2077477141.html",
    "published": "2026-02-28T17:36:50+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran Strikes 14 US Bases",
    "relevant": true,
    "summary_en": "Iran has launched attacks targeting 14 US military bases, likely using ballistic missiles and drones. This represents a significant escalation in the ongoing conflict, demonstrating Iran's capability to strike multiple US assets across the region. The strategic significance includes potential disruption of US operations and increased pressure on US forces in Iraq, Syria, and the Gulf.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "strike",
      "ballistic",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us|ballistic_missile|drone_strike",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "multiple US military bases in Iraq, Syria, and the Gulf",
      "brief": "Iran's coordinated ballistic missile and drone strikes on 14 US bases mark a critical escalation, demonstrating significant offensive capability and posing a direct threat to US regional operations."
    },
    "lat": 34.8,
    "lng": 38.99
  },
  {
    "id": "cf84e40c6a2f1808",
    "title_original": "КСИР сообщил об ударе по корабельной цели США",
    "content_original": "КСИР сообщил об ударе по корабельной цели США",
    "url": "https://ria.ru/20260228/ssha-2077476427.html",
    "published": "2026-02-28T17:34:25+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC Reports Strike on US Naval Target",
    "relevant": true,
    "summary_en": "The IRGC has announced a strike on a US naval target, indicating an escalation in hostilities at sea. This likely refers to an incident in the Gulf or Red Sea, where US Navy assets are deployed. The strike signifies ongoing efforts by Iran to target US forces in the region and could provoke a significant military response.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "strike",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "IRGC",
        "US Navy"
      ],
      "location": "Gulf or Red Sea",
      "brief": "The IRGC's strike on a US naval target represents a direct escalation in the maritime domain, posing a significant threat to US forces and regional stability."
    },
    "lat": 23.0,
    "lng": 43.0
  },
  {
    "id": "4fbe4b4112e25541",
    "title_original": "Tasnim: Иран ударил по 14 американским базам на Ближнем Востоке",
    "content_original": "Tasnim: Иран ударил по 14 американским базам на Ближнем Востоке",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590649",
    "published": "2026-02-28T17:30:57+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran Strikes 14 US Bases in the Middle East",
    "relevant": true,
    "summary_en": "Iran has launched attacks targeting 14 US military bases across the Middle East. This represents a significant escalation in hostilities, demonstrating Iran's capability to strike multiple US assets simultaneously. The strikes will likely prompt a strong US military response and further destabilize the region.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "Middle East",
      "brief": "Iran's simultaneous strikes on 14 US military bases across the Middle East mark a critical escalation, showcasing Iran's capacity for large-scale attacks on US assets and likely triggering a significant US military response."
    },
    "lat": 29.0,
    "lng": 47.0,
    "merged_source_count": 2
  },
  {
    "id": "cd4d4c04ee2d1eff",
    "title_original": "Al Jazeera: иранская ракета поразила радар дальнего радиуса действия на севере Катара",
    "content_original": "Пострадавших нет",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590405",
    "published": "2026-02-28T17:09:58+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iranian Missile Strikes Long-Range Radar in Northern Qatar",
    "relevant": true,
    "summary_en": "An Iranian missile hit a long-range radar system in northern Qatar. There were no casualties reported. This incident is significant as it targets US-allied infrastructure in the Gulf region, potentially escalating tensions and posing a threat to US military operations in Qatar.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "threat",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Qatar",
        "United States"
      ],
      "location": "Northern Qatar",
      "brief": "Iran's missile strike on a US-allied radar system in Qatar directly threatens US military infrastructure and operations in the Gulf region, escalating regional tensions."
    },
    "lat": 25.98,
    "lng": 51.38
  },
  {
    "id": "e752fd1c16876497",
    "title_original": "Жители Хайфы сидят в убежищах из-за ракетных атак Ирана",
    "content_original": "Жители Хайфы сидят в убежищах из-за ракетных атак Ирана",
    "url": "https://ria.ru/20260228/khayfa-2077466741.html",
    "published": "2026-02-28T17:07:16+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Haifa Residents Shelter in Place Due to Iranian Rocket Attacks",
    "relevant": true,
    "summary_en": "Iran has launched rocket attacks targeting Haifa, Israel, prompting residents to seek shelter. This escalation highlights the ongoing conflict between Iran and its regional adversaries, including Israel. The attacks demonstrate Iran's continued efforts to target Israeli cities and infrastructure amid broader regional hostilities.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "rocket",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Haifa, Israel",
      "brief": "Iran's rocket attacks on Haifa, Israel, signal a direct escalation in the regional conflict, posing a significant threat to US interests and allies in the Middle East."
    },
    "lat": 32.79,
    "lng": 34.99,
    "merged_source_count": 2
  },
  {
    "id": "a79acec2db2a2eca",
    "title_original": "Tasnim: новая волна иранских ракет направляется в сторону Израиля",
    "content_original": "Tasnim: новая волна иранских ракет направляется в сторону Израиля",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590303",
    "published": "2026-02-28T16:58:35+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "New Wave of Iranian Missiles Headed Towards Israel",
    "relevant": true,
    "summary_en": "Iran has launched a new wave of missiles targeting Israel, indicating a significant escalation in the conflict. This action by Iran is likely a direct response to previous Israeli operations against Iranian-linked targets. The development raises concerns about further regional destabilization and potential Israeli retaliation.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Israel",
      "brief": "Iran's ballistic missile attack on Israel marks a critical escalation, posing direct threats to regional stability and prompting potential for further direct military engagement."
    },
    "lat": 31.5,
    "lng": 34.8,
    "merged_source_count": 3
  },
  {
    "id": "aaaea944afcd6018",
    "title_original": "Недалеко от столицы Бахрейна продолжают греметь взрывы",
    "content_original": "Недалеко от столицы Бахрейна продолжают греметь взрывы",
    "url": "https://ria.ru/20260228/bakhreyn-2077461344.html",
    "published": "2026-02-28T16:54:55+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Explosions Continue Near Bahrain's Capital",
    "relevant": true,
    "summary_en": "Explosions are occurring near Bahrain's capital, likely indicating ongoing hostilities or attacks in the vicinity of a critical US naval base in the Gulf region. This could involve Houthi or Iranian-backed elements targeting US or coalition assets in Bahrain. The situation is significant due to Bahrain's importance as a hub for US Navy operations in the Middle East.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "houthi"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "high",
      "parties_involved": [
        "United States",
        "Iran",
        "Houthi/Ansar Allah",
        "Bahrain"
      ],
      "location": "near Bahrain's capital",
      "brief": "Explosions near Bahrain's capital threaten a critical US naval base, indicating potential escalation in the Gulf region."
    },
    "lat": 26.2171775,
    "lng": 50.6089975
  },
  {
    "id": "776ae1b0bf459fcf",
    "title_original": "Al Ikhbaria: в провинциях Дамаск и Дераа произошли взрывы",
    "content_original": "Al Ikhbaria: в провинциях Дамаск и Дераа произошли взрывы",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26590253",
    "published": "2026-02-28T16:51:25+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Explosions reported in Damascus and Daraa provinces",
    "relevant": true,
    "summary_en": "Explosions occurred in the Damascus and Daraa provinces of Syria. This is significant as these areas are strategically important and have seen conflict related to the ongoing Iran-US war, potentially involving Iranian proxies or other actors. The incidents could indicate escalating tensions or attacks impacting regional stability.",
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "conflict",
      "war"
    ],
    "classification": {
      "is_attack": true,
      "category": "proxy_operation",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "Syrian forces",
        "Iranian proxy groups"
      ],
      "location": "Damascus and Daraa provinces, Syria",
      "brief": "Explosions in strategically important areas of Syria suggest ongoing proxy operations, potentially involving Iranian-backed forces, impacting regional stability and US interests."
    },
    "lat": 33.51,
    "lng": 36.29
  },
  {
    "id": "39a7a20997273e6d",
    "title_original": "🇧🇭 🇮🇷 ⚡️ - Scenes from Manama, Bahrain showing an Iranian suicide drone hitting an apartment building.",
    "content_original": "🇧🇭 🇮🇷 ⚡️ - Scenes from Manama, Bahrain showing an Iranian suicide drone hitting an apartment building.",
    "url": "https://t.me/CIG_telegram/69634",
    "published": "2026-02-28T16:50:09+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "Iranian suicide drone hits apartment building in Manama, Bahrain",
    "translated": true,
    "relevant": true,
    "summary_en": "An Iranian suicide drone struck an apartment building in Manama, Bahrain, marking an escalation of hostilities in the Gulf region. This attack demonstrates Iran's willingness to target civilian infrastructure in areas with significant US military presence. The incident is likely to prompt a swift response from US forces stationed in Bahrain and escalate regional tensions.",
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "suicide",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "US",
        "Bahrain"
      ],
      "location": "Manama, Bahrain",
      "brief": "The Iranian drone strike on a civilian apartment building in Bahrain, a location with significant US military presence, represents a direct escalation targeting US interests and infrastructure in the Gulf region."
    },
    "lat": 26.07,
    "lng": 50.55
  },
  {
    "id": "0c8082592534aca8",
    "title_original": "IRGC launches new wave of retaliatory missile strikes on US bases across region",
    "content_original": "IRGC launches new wave of retaliatory missile strikes on US bases across region",
    "url": "https://presstv.ir/Detail/2026/02/28/764837/irgc-launches-new-wave-attacks-us-bases-region",
    "published": "2026-02-28T16:49:46.314784+00:00",
    "source_name": "Press TV",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "IRGC launches new wave of retaliatory missile strikes on US bases across region",
    "translated": true,
    "relevant": true,
    "summary_en": "The IRGC has initiated another round of missile attacks targeting US military bases in the region, likely in response to previous US strikes on Iranian assets. This escalation indicates ongoing hostilities and direct engagement between Iran and US forces. The strategic significance includes heightened risks of further escalation and potential impacts on regional stability.",
    "keyword_matches": 4,
    "matched_keywords": [
      "irgc",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "US military bases across the region",
      "brief": "The IRGC's missile strikes on US bases mark a direct escalation in hostilities, posing significant risks of further escalation and regional instability."
    },
    "lat": 45.6577432,
    "lng": -68.7105289
  },
  {
    "id": "eda3d5eba421d264",
    "title_original": "🇺🇸 🇮🇷 ⚡️ - Scences from Zanjan, north western Iran shows strikes against ballistic missile infrastructure.",
    "content_original": "🇺🇸 🇮🇷 ⚡️ - Scences from Zanjan, north western Iran shows strikes against ballistic missile infrastructure.",
    "url": "https://t.me/CIG_telegram/69633",
    "published": "2026-02-28T16:47:33+00:00",
    "source_name": "Conflict Intelligence Team (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "russia",
    "skip_translation": true,
    "title_en": "US strikes target ballistic missile infrastructure in Zanjan, northwestern Iran",
    "translated": true,
    "relevant": true,
    "summary_en": "The US has conducted strikes against ballistic missile infrastructure in Zanjan, northwestern Iran. This action is part of ongoing efforts to degrade Iran's missile capabilities amid the conflict. The strikes on missile facilities are strategically significant as they aim to limit Iran's ability to launch further attacks against US forces and interests in the region.",
    "keyword_matches": 7,
    "matched_keywords": [
      "conflict",
      "missile",
      "ballistic"
    ],
    "classification": {
      "is_attack": true,
      "category": "us_strike_on_iran",
      "severity": "high",
      "parties_involved": [
        "United States",
        "Iran"
      ],
      "location": "Zanjan, northwestern Iran",
      "brief": "The US strikes on ballistic missile infrastructure in Zanjan are a strategic move to degrade Iran's missile capabilities and reduce the threat to US forces and interests in the region."
    },
    "lat": 36.515854,
    "lng": 48.4777616,
    "merged_source_count": 2
  },
  {
    "id": "8fec10127e840e44",
    "title_original": "В иранском порту Чабахар прогремели взрывы",
    "content_original": "В иранском порту Чабахар прогремели взрывы",
    "url": "https://ria.ru/20260228/iran-2077455093.html",
    "published": "2026-02-28T16:31:55+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Explosions Reported in Iranian Port of Chabahar",
    "relevant": true,
    "summary_en": "Explosions occurred in the Iranian port of Chabahar. The incident's cause and impact are currently unclear but could affect regional maritime operations and Iran's strategic infrastructure. This development is significant given Chabahar's importance as a key port for Iran, especially amid ongoing conflict.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [
        "Iran"
      ],
      "location": "Chabahar, Iran",
      "brief": "Explosions at the strategic Iranian port of Chabahar could impact regional maritime operations and Iran's infrastructure, signaling potential escalation amid ongoing conflict."
    },
    "lat": 25.29,
    "lng": 60.64
  },
  {
    "id": "c5d0adb51ac71edb",
    "title_original": "На юге Ирана не менее 60 детей погибли при ударе по школе",
    "content_original": "На юге Ирана не менее 60 детей погибли при ударе по школе",
    "url": "https://ria.ru/20260228/iran-2077454540.html",
    "published": "2026-02-28T16:27:57+03:00",
    "source_name": "RIA Novosti",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "At least 60 children killed in school strike in southern Iran",
    "relevant": true,
    "summary_en": "An airstrike resulted in the deaths of at least 60 children at a school in southern Iran. The strike's origin and responsible party are not specified, but it signifies a significant escalation in civilian casualties and potential war crimes concerns. This incident could provoke international condemnation and further complicate the conflict dynamics.",
    "translated": true,
    "keyword_matches": 7,
    "matched_keywords": [
      "strike",
      "airstrike",
      "deaths",
      "killed",
      "war",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "unknown"
      ],
      "location": "southern Iran",
      "brief": "The airstrike resulting in the deaths of at least 60 children in southern Iran represents a significant escalation with potential international repercussions, posing a critical risk of further complicating the conflict dynamics and provoking broader regional instability."
    },
    "lat": 29.0,
    "lng": 54.0,
    "merged_source_count": 3
  },
  {
    "id": "19b3dd0ccefac4c9",
    "title_original": "IRGC Navy pounds US MST ship with a volley of missiles after Israeli-US aggression  As part of its retaliatory operat...",
    "content_original": "IRGC Navy pounds US MST ship with a volley of missiles after Israeli-US aggression As part of its retaliatory operations against the latest Israeli-American aggression on the Islamic Republic of Iran, the Islamic Revolution Guards Corps (IRGC) launched a volley of missiles on Saturday at a US Maritime Strike Tomahawk (MST) support vessel. @PressTV",
    "url": "https://t.me/presstv/177246",
    "published": "2026-02-28T16:16:20+00:00",
    "source_name": "Press TV (TG)",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "IRGC Navy attacks US MST ship with missiles in retaliation for Israeli-US aggression",
    "translated": true,
    "relevant": true,
    "summary_en": "The IRGC launched a missile attack on a US Maritime Strike Tomahawk support vessel in response to recent Israeli-American actions against Iran. This retaliatory strike by the IRGC Navy signifies an escalation in the conflict and demonstrates Iran's willingness to target US naval assets. The incident underscores the heightened tensions and direct military engagements between Iran and the US in the region.",
    "keyword_matches": 8,
    "matched_keywords": [
      "strike",
      "conflict",
      "missile",
      "irgc",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "IRGC Navy",
        "United States"
      ],
      "location": "Maritime region (specific location not provided)",
      "brief": "The IRGC Navy's missile attack on a US MST support vessel marks a significant escalation, demonstrating direct military engagement between Iran and the US and posing a direct threat to US naval assets."
    },
    "lat": 6.5175177,
    "lng": 1.2045805
  },
  {
    "id": "d068df8a105b50f8",
    "title_original": "Israeli army kills Palestinian child, wounds another in Gaza despite ceasefire",
    "content_original": "Israeli artillery fire killed a 15-year-old Palestinian boy and wounded another teenager east of Gaza City on Saturday, marking a fresh breach of the ceasefire in the enclave, Anadolu reports. Medical sources told Anadolu that Abed Raed Radi was killed near Israeli-controlled areas east of the Zeitoun neighborhood. Salman Yahya al-Malalha, 16, was wounded in the same shelling and remains in moderate condition. Earlier in the day, two Palestinians were wounded when Israeli naval forces opened fire on fishing boats off Gaza City and in the Sheikh Ajlin area. A Palestinian woman was also shot in the foot in the Mawasi area west of Khan Younis, the sources added. Israel has killed 618 Palestinians and wounded 1,663 since a ceasefire [&#8230;]",
    "url": "https://www.middleeastmonitor.com/20260228-israeli-army-kills-palestinian-child-wounds-another-in-gaza-despite-ceasefire/",
    "published": "2026-02-28T16:09:54+00:00",
    "source_name": "Middle East Monitor",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Israeli army kills Palestinian child, wounds another in Gaza despite ceasefire",
    "translated": true,
    "relevant": true,
    "summary_en": "Israeli artillery fire killed a 15-year-old Palestinian boy and wounded another teenager in Gaza, breaching the ceasefire. The incident occurred near Israeli-controlled areas east of Zeitoun neighborhood. Additional incidents involved Israeli naval forces firing on fishing boats off Gaza City and in the Sheikh Ajlin area, further escalating tensions.",
    "keyword_matches": 4,
    "matched_keywords": [
      "ceasefire",
      "wounded",
      "killed"
    ],
    "classification": {
      "is_attack": true,
      "category": "ceasefire_violation",
      "severity": "low",
      "parties_involved": [
        "Israel",
        "Palestinians in Gaza"
      ],
      "location": "Gaza City, Zeitoun neighborhood, Sheikh Ajlin area",
      "brief": "The incident, while a ceasefire violation, does not directly involve US or Iranian forces and has limited direct impact on the Iran–US conflict."
    },
    "lat": 29.2696663,
    "lng": 91.2419862
  },
  {
    "id": "997ced139c5bc1b1",
    "title_original": "КСИР: 200 военных США стали жертвами ударов Ирана по американским базам",
    "content_original": "КСИР: 200 военных США стали жертвами ударов Ирана по американским базам",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26589771",
    "published": "2026-02-28T16:05:07+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "IRGC Claims 200 US Military Personnel Killed in Iranian Strikes on American Bases",
    "relevant": true,
    "summary_en": "The IRGC has claimed that 200 US military personnel were killed in Iranian strikes targeting American bases, though this has not been independently verified. This statement is part of ongoing Iranian retaliation against US forces in the region following escalating hostilities. The claim, if true, would indicate a significant escalation in casualties and potential for further conflict.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "irgc",
      "killed",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "American bases in the region",
      "brief": "The IRGC claims to have inflicted mass casualties on US forces, indicating a significant escalation in direct hostilities between Iran and the United States."
    },
    "lat": 29.0,
    "lng": 47.0
  },
  {
    "id": "913d2f47c61de258",
    "title_original": "Death Toll from Israeli Aggression on Gaza Rises to 72,095",
    "content_original": "Gaza, February 28 (QNA) - The death toll from the Israeli aggression on the Gaza Strip, since October 7, 2023, has risen to 72,095 martyrs, in addition to 171,784 wounded.",
    "url": "https://qna.org.qa/en/News-Area/News/2026-2/28/death-toll-from-israeli-aggression-on-gaza-rises-to-72095",
    "published": "2026-02-28T16:03:44+00:00",
    "source_name": "QNA General (English)",
    "source_category": "state",
    "language": "en",
    "region": "gulf",
    "skip_translation": true,
    "title_en": "Death Toll from Israeli Aggression on Gaza Rises to 72,095",
    "relevant": true,
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "death"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hamas"
      ],
      "location": "Gaza",
      "brief": "The article describes an ongoing conflict between Israel and Hamas in Gaza, which could indirectly affect the Iran–US conflict if Iran decides to escalate tensions in support of Hamas."
    },
    "lat": 31.5,
    "lng": 34.47
  },
  {
    "id": "3c04ffe49087bbda",
    "title_original": "Tasnim: Иран нанес новый удар по базе США в Кувейте",
    "content_original": "Tasnim: Иран нанес новый удар по базе США в Кувейте",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26589665",
    "published": "2026-02-28T15:57:57+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Iran Strikes US Base in Kuwait",
    "relevant": true,
    "summary_en": "Iran reportedly launched a new attack targeting a US military base in Kuwait. This action represents an escalation in the ongoing conflict, demonstrating Iran's continued efforts to target US assets in the region. The strike's impact on US forces and potential retaliatory measures are likely to be significant for regional stability.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "strike",
      "attack",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "Kuwait"
      ],
      "location": "US military base in Kuwait",
      "brief": "Iran's direct strike on a US military base in Kuwait marks a significant escalation, posing a direct threat to US forces and regional stability."
    },
    "lat": 29.39,
    "lng": 47.54
  },
  {
    "id": "6d8e0779418f10c5",
    "title_original": "🚨 گزارش های مردمی از شنیده شدن صدای انفجار مهیب در بندر عباس ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات ...",
    "content_original": "🚨 گزارش های مردمی از شنیده شدن صدای انفجار مهیب در بندر عباس ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44850",
    "published": "2026-02-28T15:47:04+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Explosion Heard in Bandar Abbas, Iran",
    "relevant": true,
    "summary_en": "An explosion has been reported in Bandar Abbas, Iran, with local reports indicating a loud blast. This is significant as Bandar Abbas is a major port city and home to significant IRGC naval assets, suggesting potential military targeting by US forces or a related incident amidst ongoing hostilities.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "irgc",
      "explosion"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "United States",
        "Iran",
        "IRGC"
      ],
      "location": "Bandar Abbas, Iran",
      "brief": "The explosion in Bandar Abbas, home to significant IRGC naval assets, suggests a potential US airstrike targeting critical military infrastructure, escalating ongoing hostilities."
    },
    "lat": 27.1901938,
    "lng": 56.2842212
  },
  {
    "id": "0bf22a45212319a2",
    "title_original": "🚨 شلیک موشک های سجیل به سرزمین اشغالی ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات و اخبار جدید ایران و آم...",
    "content_original": "🚨 شلیک موشک های سجیل به سرزمین اشغالی ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44849",
    "published": "2026-02-28T15:46:27+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Missile Strikes on Occupied Territories",
    "relevant": true,
    "summary_en": "Iranian forces have launched Sajil missiles targeting occupied territories, likely referring to Israeli positions. This represents a significant escalation in the ongoing conflict, demonstrating Iran's continued willingness to engage in direct military action against its adversaries in the region.",
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "missile",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Israel",
        "Islamic Resistance Iraq"
      ],
      "location": "Occupied Territories (likely Israeli positions)",
      "brief": "Iran's ballistic missile strikes on Israeli positions signal a significant escalation, demonstrating direct military engagement and increased regional instability."
    },
    "lat": 50.429608,
    "lng": 30.4558968
  },
  {
    "id": "dac58ef9de664840",
    "title_original": "سپاه پاسداران از انهدام سه پهپاد هرمس در آسمان کشور خبر داد",
    "content_original": "سپاه پاسداران از انهدام سه پهپاد هرمس در آسمان کشور خبر داد",
    "url": "https://www.irna.ir/news/86089695/%D8%B3%D9%BE%D8%A7%D9%87-%D9%BE%D8%A7%D8%B3%D8%AF%D8%A7%D8%B1%D8%A7%D9%86-%D8%A7%D8%B2-%D8%A7%D9%86%D9%87%D8%AF%D8%A7%D9%85-%D8%B3%D9%87-%D9%BE%D9%87%D9%BE%D8%A7%D8%AF-%D9%87%D8%B1%D9%85%D8%B3-%D8%AF%D8%B1-%D8%A2%D8%B3%D9%85%D8%A7%D9%86-%DA%A9%D8%B4%D9%88%D8%B1-%D8%AE%D8%A8%D8%B1-%D8%AF%D8%A7%D8%AF",
    "published": "2026-02-28T15:44:41+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "IRGC Claims Destruction of Three Hermes Drones Over Iran",
    "relevant": true,
    "summary_en": "The IRGC announced the destruction of three Hermes drones in Iranian airspace. This incident highlights ongoing tensions and the use of unmanned aerial systems in the conflict. The strategic significance involves Iran's air defense capabilities and potential foreign involvement in surveillance or attacks.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "irgc",
      "conflict",
      "air defense"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "medium",
      "parties_involved": [
        "Iran",
        "IRGC"
      ],
      "location": "Iranian airspace",
      "brief": "The incident highlights Iran's use of air defense systems against foreign drones, reflecting ongoing surveillance and potential escalation in unmanned system engagements."
    },
    "lat": 30.3354128,
    "lng": 48.2896822
  },
  {
    "id": "20a8d0c2a2a5414c",
    "title_original": "اسرائیل در شوک؛ اصابت‌های پیاپی و آژیرهایی که خاموش نمی‌شوند",
    "content_original": "اسرائیل در شوک؛ اصابت‌های پیاپی و آژیرهایی که خاموش نمی‌شوند",
    "url": "https://www.irna.ir/news/86089685/%D8%A7%D8%B3%D8%B1%D8%A7%D8%A6%DB%8C%D9%84-%D8%AF%D8%B1-%D8%B4%D9%88%DA%A9-%D8%A7%D8%B5%D8%A7%D8%A8%D8%AA-%D9%87%D8%A7%DB%8C-%D9%BE%DB%8C%D8%A7%D9%BE%DB%8C-%D9%88-%D8%A2%DA%98%DB%8C%D8%B1%D9%87%D8%A7%DB%8C%DB%8C-%DA%A9%D9%87-%D8%AE%D8%A7%D9%85%D9%88%D8%B4-%D9%86%D9%85%DB%8C-%D8%B4%D9%88%D9%86%D8%AF",
    "published": "2026-02-28T15:44:29+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Israel in Shock: Continuous Strikes and Unending Sirens",
    "relevant": true,
    "summary_en": "The article likely describes a significant escalation in attacks on Israel, with ongoing strikes and persistent air raid sirens. This suggests a major offensive by Hezbollah or other Iranian-backed groups, indicating heightened conflict on Israel's northern border and potential strategic implications for regional stability.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "offensive",
      "raid",
      "hezbollah"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran"
      ],
      "location": "Israel's northern border",
      "brief": "The continuous strikes and persistent air raid sirens indicate a major offensive by Hezbollah, a key Iranian proxy, posing a significant threat to regional stability and potentially drawing in broader Iran-US conflict dynamics."
    },
    "lat": 31.0501487,
    "lng": 34.3312446
  },
  {
    "id": "63677fc60448dd7e",
    "title_original": "Более 20 провинций Ирана подверглись атакам США и Израиля",
    "content_original": "Данные привели представители Красного Полумесяца Ирана",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26589481",
    "published": "2026-02-28T15:41:54+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Over 20 Iranian provinces targeted by US and Israeli attacks",
    "relevant": true,
    "summary_en": "The US and Israel have launched attacks on more than 20 provinces in Iran, as reported by the Iranian Red Crescent. This indicates a significant escalation in the conflict, with widespread strikes across Iranian territory, likely targeting IRGC assets and infrastructure.",
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "irgc",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Iran (over 20 provinces)",
      "brief": "The coordinated US and Israeli airstrikes on over 20 Iranian provinces mark a critical escalation, indicating direct targeting of IRGC infrastructure and a significant expansion of the conflict's geographic scope."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "caed700fa6f9b8f7",
    "title_original": "ادامه فعالیت رادیو مقاومت دزفول با وجود اصابت موشک",
    "content_original": "ادامه فعالیت رادیو مقاومت دزفول با وجود اصابت موشک",
    "url": "https://www.irna.ir/news/86089654/%D8%A7%D8%AF%D8%A7%D9%85%D9%87-%D9%81%D8%B9%D8%A7%D9%84%DB%8C%D8%AA-%D8%B1%D8%A7%D8%AF%DB%8C%D9%88-%D9%85%D9%82%D8%A7%D9%88%D9%85%D8%AA-%D8%AF%D8%B2%D9%81%D9%88%D9%84-%D8%A8%D8%A7-%D9%88%D8%AC%D9%88%D8%AF-%D8%A7%D8%B5%D8%A7%D8%A8%D8%AA-%D9%85%D9%88%D8%B4%DA%A9",
    "published": "2026-02-28T15:40:50+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "Radio Resistance Dezful Continues Broadcasting Despite Missile Strike",
    "relevant": true,
    "summary_en": "An unidentified party launched a missile strike targeting Radio Resistance Dezful in Iran, but the station remains operational. This incident highlights ongoing efforts to disrupt local media and communication channels amid the conflict. The strategic significance lies in attempts to undermine information dissemination within Iran during the war.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "war",
      "missile",
      "conflict",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [
        "unknown"
      ],
      "location": "Dezful, Iran",
      "brief": "The missile strike on Radio Resistance Dezful demonstrates ongoing efforts to disrupt Iranian communication channels, impacting information dissemination within Iran during the conflict."
    },
    "lat": 32.3780257,
    "lng": 48.4032064,
    "merged_source_count": 2
  },
  {
    "id": "e1880caac684cd43",
    "title_original": "یک شهید و ۳۵ مجروح در آذربایجان شرقی بر اثر تهاجم اسرائیل و آمریکا",
    "content_original": "یک شهید و ۳۵ مجروح در آذربایجان شرقی بر اثر تهاجم اسرائیل و آمریکا",
    "url": "https://www.irna.ir/news/86089658/%DB%8C%DA%A9-%D8%B4%D9%87%DB%8C%D8%AF-%D9%88-%DB%B3%DB%B5-%D9%85%D8%AC%D8%B1%D9%88%D8%AD-%D8%AF%D8%B1-%D8%A2%D8%B0%D8%B1%D8%A8%D8%A7%DB%8C%D8%AC%D8%A7%D9%86-%D8%B4%D8%B1%D9%82%DB%8C-%D8%A8%D8%B1-%D8%A7%D8%AB%D8%B1-%D8%AA%D9%87%D8%A7%D8%AC%D9%85-%D8%A7%D8%B3%D8%B1%D8%A7%D8%A6%DB%8C%D9%84-%D9%88-%D8%A2%D9%85%D8%B1%DB%8C%DA%A9%D8%A7",
    "published": "2026-02-28T15:29:30+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "One Killed and 35 Injured in East Azerbaijan Due to Israeli and US Aggression",
    "relevant": true,
    "summary_en": "An attack attributed to Israeli and US forces resulted in one fatality and 35 injuries in East Azerbaijan. This incident highlights the regional escalation and potential spillover of the Iran-US conflict into neighboring countries. The strategic significance remains unclear without additional details on the nature of the attack and the targets involved.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "conflict",
      "killed",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "United States",
        "Iran"
      ],
      "location": "East Azerbaijan, Iran",
      "brief": "The incident represents a significant escalation with direct US and Israeli involvement in Iran, resulting in casualties and potential regional spillover of the conflict."
    },
    "lat": 38.9376054,
    "lng": 45.6252101
  },
  {
    "id": "6931d9cd09fc3b35",
    "title_original": "Yemen's Iranian-backed Houthi rebels to resume attacks on shipping in Red Sea corridor: Officials",
    "content_original": "One of the officials said the rebels' first attack could come as soon as “tonight”",
    "url": "https://www.thehindu.com/news/international/yemens-iranian-backed-houthi-rebels-to-resume-attacks-on-shipping-in-red-sea-corridor-officials/article70687579.ece",
    "published": "2026-02-28T15:22:12+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Houthi rebels to resume attacks on Red Sea shipping",
    "relevant": true,
    "translated": true,
    "summary_en": "Yemen's Houthi rebels, backed by Iran, plan to resume attacks on shipping in the Red Sea corridor, with the first attack potentially occurring as soon as tonight. This development indicates an escalation in the conflict and poses a direct threat to international maritime trade in the strategically vital waterway. The move is likely to provoke a response from the US and its allies, who have previously targeted Houthi naval capabilities in the region.",
    "keyword_matches": 6,
    "matched_keywords": [
      "houthi",
      "conflict",
      "threat",
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "houthi_attack",
      "severity": "medium",
      "parties_involved": [
        "Houthi rebels",
        "Iran",
        "US",
        "international maritime forces"
      ],
      "location": "Red Sea",
      "brief": "The planned Houthi attacks on Red Sea shipping represent a significant escalation, threatening international maritime trade and likely prompting a response from US-led naval forces."
    },
    "lat": 20.0,
    "lng": 38.0
  },
  {
    "id": "39e953a907c65d55",
    "title_original": "⚡️  An American radar in Qatar was completely destroyed today in an Iranian drone strike.",
    "content_original": "⚡️ An American radar in Qatar was completely destroyed today in an Iranian drone strike.",
    "url": "https://t.me/warmonitors/40048",
    "published": "2026-02-28T15:19:10+00:00",
    "source_name": "War Monitors (TG)",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "⚡️  An American radar in Qatar was completely destroyed today in an Iranian drone strike.",
    "relevant": true,
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "drone",
      "strike"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Iran"
      ],
      "location": "Qatar",
      "brief": "The destruction of a US radar system in Qatar by an Iranian drone strike represents a direct escalation in the Iran-US conflict with significant strategic implications."
    },
    "lat": 25.33,
    "lng": 51.23,
    "merged_source_count": 4
  },
  {
    "id": "e57493a7b51656a2",
    "title_original": "موج جدید حملات موشکی علیه پایگاه های آمریکایی آغاز شد",
    "content_original": "موج جدید حملات موشکی علیه پایگاه های آمریکایی آغاز شد",
    "url": "https://www.irna.ir/news/86089661/%D9%85%D9%88%D8%AC-%D8%AC%D8%AF%DB%8C%D8%AF-%D8%AD%D9%85%D9%84%D8%A7%D8%AA-%D9%85%D9%88%D8%B4%DA%A9%DB%8C-%D8%B9%D9%84%DB%8C%D9%87-%D9%BE%D8%A7%DB%8C%DA%AF%D8%A7%D9%87-%D9%87%D8%A7%DB%8C-%D8%A2%D9%85%D8%B1%DB%8C%DA%A9%D8%A7%DB%8C%DB%8C-%D8%A2%D8%BA%D8%A7%D8%B2-%D8%B4%D8%AF",
    "published": "2026-02-28T15:16:08+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "New wave of missile attacks on US bases begins",
    "relevant": true,
    "summary_en": "Iranian forces have initiated a fresh series of missile attacks targeting US military bases in the region. The strikes are likely aimed at US installations in Iraq, Syria, and the Gulf, escalating ongoing hostilities. This development signifies a significant escalation in the conflict and poses a direct threat to US personnel and assets in the area.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "threat",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States"
      ],
      "location": "Iraq, Syria, and the Gulf region",
      "brief": "The missile attacks on US military bases in multiple strategic locations represent a direct and significant escalation by Iran, posing a critical threat to US forces and regional stability."
    },
    "lat": 36.3832089,
    "lng": 42.9927784,
    "merged_source_count": 3
  },
  {
    "id": "6f5876af6a2d383c",
    "title_original": "IRGC Navy pounds US MST ship with a volley of missiles after Israeli-US aggression",
    "content_original": "IRGC Navy pounds US MST ship with a volley of missiles after Israeli-US aggression",
    "url": "https://presstv.ir/Detail/2026/02/28/764832/irgc-navy-pounds-us-mst-ship-volley-missiles-after-israeli-us-aggression",
    "published": "2026-02-28T15:04:50.397841+00:00",
    "source_name": "Press TV",
    "source_category": "state",
    "language": "en",
    "region": "iran",
    "skip_translation": true,
    "title_en": "IRGC Navy pounds US MST ship with a volley of missiles after Israeli-US aggression",
    "relevant": true,
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "IRGC Navy",
        "United States"
      ],
      "location": "Unspecified maritime location",
      "brief": "The IRGC Navy's missile attack on a US MST ship represents a direct engagement between Iranian and US military forces, posing a significant escalation risk in the conflict."
    },
    "lat": 26.0,
    "lng": 56.0
  },
  {
    "id": "220851ee3ee1917c",
    "title_original": "🚨 موج جدید حملات موشکی سپاه ایران به پایگاه های آمریکا آغاز شد ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولا...",
    "content_original": "🚨 موج جدید حملات موشکی سپاه ایران به پایگاه های آمریکا آغاز شد ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44845",
    "published": "2026-02-28T14:54:51+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "New Wave of IRGC Missile Attacks on US Bases Begins",
    "relevant": true,
    "summary_en": "The IRGC has initiated a fresh series of missile strikes targeting US military bases, marking an escalation in hostilities. This development signifies a direct confrontation with US forces and underscores the ongoing conflict's intensification. The strategic significance lies in the potential for further escalation and retaliatory measures by the US.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "missile",
      "irgc",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "US military bases",
      "brief": "The IRGC's missile strikes on US military bases represent a direct and significant escalation in the Iran–US conflict, posing a critical threat to regional stability and increasing the likelihood of retaliatory measures by the US."
    },
    "lat": 29.0,
    "lng": 47.0
  },
  {
    "id": "d86f61565cbb85d2",
    "title_original": "۴۲۴ نقطه در مرکز فلسطین اشغالی زیر آژیر قرمز؛ تل‌آویو در وضعیت اضطراری",
    "content_original": "۴۲۴ نقطه در مرکز فلسطین اشغالی زیر آژیر قرمز؛ تل‌آویو در وضعیت اضطراری",
    "url": "https://www.irna.ir/news/86089635/%DB%B4%DB%B2%DB%B4-%D9%86%D9%82%D8%B7%D9%87-%D8%AF%D8%B1-%D9%85%D8%B1%DA%A9%D8%B2-%D9%81%D9%84%D8%B3%D8%B7%DB%8C%D9%86-%D8%A7%D8%B4%D8%BA%D8%A7%D9%84%DB%8C-%D8%B2%DB%8C%D8%B1-%D8%A2%DA%98%DB%8C%D8%B1-%D9%82%D8%B1%D9%85%D8%B2-%D8%AA%D9%84-%D8%A2%D9%88%DB%8C%D9%88-%D8%AF%D8%B1-%D9%88%D8%B6%D8%B9%DB%8C%D8%AA",
    "published": "2026-02-28T14:49:38+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "424 locations in central occupied Palestine under red alert; Tel Aviv in emergency state",
    "relevant": true,
    "summary_en": "A significant number of locations in central occupied Palestine have been placed under a red alert, indicating a potential security threat. Tel Aviv has been put in an emergency state, likely due to escalating tensions or security incidents. This development highlights the ongoing volatility and security challenges in the region amid the broader conflict.",
    "translated": true,
    "keyword_matches": 2,
    "matched_keywords": [
      "threat",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran (indirect)"
      ],
      "location": "Central occupied Palestine, Tel Aviv",
      "brief": "The escalation in central occupied Palestine and the emergency state in Tel Aviv indicate a significant Hezbollah action, likely supported by Iran, posing a direct threat to Israeli security and potentially drawing in broader regional actors."
    },
    "lat": 32.08,
    "lng": 34.78
  },
  {
    "id": "d7b94a70d30211f7",
    "title_original": "🚨 عربستان سعودی تأیید کرد که ایران دو پایگاه آمریکایی در ریاض و منطقه شرقی را هدف قرار داده است ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ...",
    "content_original": "🚨 عربستان سعودی تأیید کرد که ایران دو پایگاه آمریکایی در ریاض و منطقه شرقی را هدف قرار داده است ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44836",
    "published": "2026-02-28T14:33:52+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Iran strikes two US bases in Riyadh and Eastern Saudi Arabia",
    "relevant": true,
    "summary_en": "Iran has targeted two US military bases in Riyadh and Eastern Saudi Arabia, as confirmed by Saudi authorities. This attack signifies an escalation in the ongoing conflict, demonstrating Iran's willingness to strike US assets within Saudi territory. The incident is likely to provoke a strong response from the US and its allies in the region.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "strike",
      "attack",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "Saudi Arabia"
      ],
      "location": "Riyadh and Eastern Saudi Arabia",
      "brief": "Iran's direct strike on US military bases in Saudi Arabia marks a significant escalation, demonstrating Iran's capability and willingness to target US assets in the region."
    },
    "lat": 24.71,
    "lng": 46.68
  },
  {
    "id": "823876c44245df84",
    "title_original": "ناو پشتیبانی رزمی آمریکا مورد اصابت شدید موشک های ایران قرار گرفت",
    "content_original": "ناو پشتیبانی رزمی آمریکا مورد اصابت شدید موشک های ایران قرار گرفت",
    "url": "https://www.irna.ir/news/86089621/%D9%86%D8%A7%D9%88-%D9%BE%D8%B4%D8%AA%DB%8C%D8%A8%D8%A7%D9%86%DB%8C-%D8%B1%D8%B2%D9%85%DB%8C-%D8%A2%D9%85%D8%B1%DB%8C%DA%A9%D8%A7-%D9%85%D9%88%D8%B1%D8%AF-%D8%A7%D8%B5%D8%A7%D8%A8%D8%AA-%D8%B4%D8%AF%DB%8C%D8%AF-%D9%85%D9%88%D8%B4%DA%A9-%D9%87%D8%A7%DB%8C-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86-%D9%82%D8%B1%D8%A7%D8%B1",
    "published": "2026-02-28T14:32:49+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "US Military Support Ship Struck by Iranian Missiles",
    "relevant": true,
    "summary_en": "An American military support ship was hit by multiple Iranian missiles in the Gulf region. This attack represents a significant escalation in direct engagements between US and Iranian forces at sea. The incident will likely prompt a swift US military response and raises tensions in the maritime domain.",
    "translated": true,
    "keyword_matches": 1,
    "matched_keywords": [
      "attack"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "major",
      "parties_involved": [
        "US",
        "Iran"
      ],
      "location": "Gulf region",
      "brief": "The direct engagement between US and Iranian forces with the use of Iranian missiles against a US military support ship marks a significant escalation in the maritime domain of the conflict."
    },
    "lat": 26.0,
    "lng": 52.0
  },
  {
    "id": "590e05d3defa8bd6",
    "title_original": "🚨  ناو پشتیبانی رزمیMST آمریکا مورد هدف موشک های سپاه پاسداران انقلاب اسلامی قرار گرفت ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ...",
    "content_original": "🚨 ناو پشتیبانی رزمیMST آمریکا مورد هدف موشک های سپاه پاسداران انقلاب اسلامی قرار گرفت ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44835",
    "published": "2026-02-28T14:19:01+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "US Navy Support Ship Targeted by IRGC Missiles",
    "relevant": true,
    "summary_en": "The IRGC has launched missiles targeting a US Navy support ship, MST, in an escalation of hostilities. This incident occurred in an unspecified location, likely in the Gulf or Arabian Sea region. The attack signifies a direct engagement with US naval forces and raises the risk of further military escalation in the maritime domain.",
    "translated": true,
    "keyword_matches": 3,
    "matched_keywords": [
      "attack",
      "irgc"
    ],
    "classification": {
      "is_attack": true,
      "category": "naval_incident",
      "severity": "major",
      "parties_involved": [
        "United States",
        "Iran",
        "IRGC"
      ],
      "location": "Gulf or Arabian Sea region",
      "brief": "The IRGC's direct missile attack on a US Navy support ship marks a significant escalation in the maritime domain, posing a direct threat to US forces and increasing the risk of broader military confrontation."
    },
    "lat": 24.0,
    "lng": 58.0
  },
  {
    "id": "6a68520b14e12627",
    "title_original": "🚨 اصابت موشک به کویت  ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات و اخبار جدید ایران و آمریکا  🌐 ✅   @SAB...",
    "content_original": "🚨 اصابت موشک به کویت ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44833",
    "published": "2026-02-28T14:10:10+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Missile Strikes Kuwait",
    "relevant": true,
    "summary_en": "A missile struck Kuwait, likely as part of the ongoing Iran-US conflict. This indicates an escalation in the regional theater, potentially involving Iranian-backed groups or Iranian forces targeting US interests or regional allies. The incident highlights the risk of the conflict spreading beyond current active fronts.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "proxy_operation",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "Kuwait",
        "Iranian-backed proxies"
      ],
      "location": "Kuwait",
      "brief": "The missile strike on Kuwait represents a significant escalation as Iranian-backed proxies expand the conflict zone, targeting US allies in the region."
    },
    "lat": 29.38,
    "lng": 47.99,
    "merged_source_count": 4
  },
  {
    "id": "b03c540c5943e9b3",
    "title_original": "ISNA: в Иране результате удара по зданию школы в городе Абийек погиб ученик",
    "content_original": "По данным агентства, еще несколько детей получили ранения",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26587531",
    "published": "2026-02-28T13:54:48+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "Student killed and several injured in school strike in Abiyek, Iran",
    "relevant": true,
    "summary_en": "A student was killed and several others injured after a strike hit a school building in Abiyek, Iran. The incident highlights the ongoing conflict's impact on civilian infrastructure and raises concerns about potential escalation. The responsible party for the strike is not specified, but it adds to the growing civilian casualties in the region.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "strike",
      "conflict",
      "killed"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [
        "Iran"
      ],
      "location": "Abiyek, Iran",
      "brief": "The incident highlights the impact of the conflict on civilian infrastructure and raises concerns about potential escalation, though direct attribution to the Iran-US conflict is unclear."
    },
    "lat": 36.04,
    "lng": 50.52
  },
  {
    "id": "2a51d25a5f0e549c",
    "title_original": "🚨 ارتش اسرائیل ویدیو هایی منتشر کرده که در آن لانچر موشک آماده شلیک را هدف قرار میدهد  ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ...",
    "content_original": "🚨 ارتش اسرائیل ویدیو هایی منتشر کرده که در آن لانچر موشک آماده شلیک را هدف قرار میدهد ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44826",
    "published": "2026-02-28T13:44:35+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Israeli military releases videos targeting missile launchers ready for firing",
    "relevant": true,
    "summary_en": "The Israeli military has released videos showing strikes on missile launchers prepared for firing, likely in response to recent escalations. This indicates ongoing operations targeting missile threats, potentially from Hezbollah or other Iran-backed groups. The strikes highlight Israel's focus on neutralizing immediate threats along its borders amid regional tensions.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "hezbollah"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Iran"
      ],
      "location": "Israel-Lebanon border region",
      "brief": "Israel's strikes on missile launchers highlight ongoing efforts to neutralize missile threats from Iran-backed Hezbollah, escalating regional tensions."
    },
    "lat": 33.1,
    "lng": 35.3
  },
  {
    "id": "54cf4e21314b855e",
    "title_original": "شهادت ۵۷ دانش‌آموز و معلم در حمله تروریستی به مدرسه میناب/ حمله به ۱۱۵ نقطه در ۲۴ استان",
    "content_original": "شهادت ۵۷ دانش‌آموز و معلم در حمله تروریستی به مدرسه میناب/ حمله به ۱۱۵ نقطه در ۲۴ استان",
    "url": "https://www.irna.ir/news/86089581/%D8%B4%D9%87%D8%A7%D8%AF%D8%AA-%DB%B5%DB%B7-%D8%AF%D8%A7%D9%86%D8%B4-%D8%A2%D9%85%D9%88%D8%B2-%D9%88-%D9%85%D8%B9%D9%84%D9%85-%D8%AF%D8%B1-%D8%AD%D9%85%D9%84%D9%87-%D8%AA%D8%B1%D9%88%D8%B1%DB%8C%D8%B3%D8%AA%DB%8C-%D8%A8%D9%87-%D9%85%D8%AF%D8%B1%D8%B3%D9%87-%D9%85%DB%8C%D9%86%D8%A7%D8%A8-%D8%AD%D9%85%D9%84%D9%87",
    "published": "2026-02-28T13:40:45+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "57 Students and Teachers Killed in Terrorist Attack on Minab School/Attacks on 115 Locations Across 24 Provinces",
    "relevant": true,
    "summary_en": "A terrorist attack on a school in Minab resulted in the deaths of 57 students and teachers. Concurrently, attacks occurred at 115 locations across 24 provinces in Iran. This escalation in domestic attacks could be linked to ongoing regional conflicts and may strain Iran's internal security apparatus.",
    "translated": true,
    "keyword_matches": 4,
    "matched_keywords": [
      "deaths",
      "attack",
      "killed"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "unknown terrorist groups"
      ],
      "location": "Minab and 24 provinces, Iran",
      "brief": "The coordinated attacks across Iran, including a deadly school assault, indicate significant domestic instability and potential escalation of internal conflict, which could distract Iranian resources from external military engagements."
    },
    "lat": 27.1,
    "lng": 57.08
  },
  {
    "id": "ade01bf3ad52be34",
    "title_original": "Минобороны ОАЭ: один человек погиб в Абу-Даби из-за иранского ракетного обстрела",
    "content_original": "Минобороны ОАЭ: один человек погиб в Абу-Даби из-за иранского ракетного обстрела",
    "url": "https://tass.ru/mezhdunarodnaya-panorama/26587105",
    "published": "2026-02-28T13:27:54+03:00",
    "source_name": "TASS",
    "source_category": "state",
    "language": "ru",
    "region": "russia",
    "skip_translation": false,
    "title_en": "One Person Killed in Abu Dhabi by Iranian Missile Strike",
    "relevant": true,
    "summary_en": "An Iranian missile strike resulted in one fatality in Abu Dhabi, UAE. This incident highlights the direct threat under which Gulf states are operating due to the ongoing conflict. The attack is likely to escalate tensions and provoke a response from the UAE and its allies, including the US.",
    "translated": true,
    "keyword_matches": 8,
    "matched_keywords": [
      "attack",
      "conflict",
      "killed",
      "missile",
      "strike",
      "threat"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE",
        "US"
      ],
      "location": "Abu Dhabi, UAE",
      "brief": "The missile strike in Abu Dhabi by Iran demonstrates a direct escalation and threat to US allies in the Gulf region, likely prompting a response from the US and its partners."
    },
    "lat": 24.4538352,
    "lng": 54.3774014,
    "merged_source_count": 3
  },
  {
    "id": "4cfecf1a40ca009f",
    "title_original": "Israel's largest ever military flyover hammers Iranian military targets",
    "content_original": "Israel pummeled Iranian targets with simultaneous airstrikes from roughly 200 fighter jets in what the Israeli military dubbed its largest ever military flyover in its history. The Israel Defense Forces (IDF) on Saturday published video of its airstrike on missile launchers in western Iran as Israel and the U.S. take part in a joint effort against Tehran. The IDF said the fighter jets flew under the direction of IDF intelligence and the Israeli Air Force and executed an \"extensive attack\" against the Iranian regime's missile and defense systems in western and central Iran. \"This is the largest military flyover in the history of the Israeli Air Force (IAF), conducted following accurate planning and based on high-quality intelligence, while synchronizing hundreds of fighter jets at the same time,\" the IDF said. TRUMP TELLS IRANIANS 'THE HOUR OF YOUR FREEDOM IS AT HAND' AS US-ISRAEL LAUNCH STRIKES AGAINST IRAN Fighter jets dropped hundreds of munitions on about 500 targets, including aeri...",
    "url": "https://www.foxnews.com/world/israels-largest-ever-military-flyover-hammers-iranian-military-targets",
    "published": "2026-02-28T13:14:51-05:00",
    "source_name": "FOX News",
    "source_category": "independent",
    "language": "en",
    "region": "western",
    "skip_translation": true,
    "title_en": "Israel's largest ever military flyover targets Iranian military sites",
    "translated": true,
    "relevant": true,
    "summary_en": "Israel conducted its largest-ever military flyover, with approximately 200 fighter jets striking missile launchers and defense systems in western and central Iran. The operation, directed by IDF intelligence and the Israeli Air Force, represents a significant escalation in joint Israeli-US efforts against Tehran. This extensive attack on Iranian military infrastructure highlights the deepening conflict between Israel and Iran.",
    "keyword_matches": 4,
    "matched_keywords": [
      "missile",
      "attack",
      "conflict",
      "idf"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran",
        "United States (indirect involvement)"
      ],
      "location": "Western and Central Iran",
      "brief": "Israel's largest-ever airstrike on Iranian military sites marks a significant escalation in the conflict, showcasing deepening Israeli-US cooperation against Tehran."
    },
    "lat": 32.65,
    "lng": 54.56
  },
  {
    "id": "b40a8278e0302dfb",
    "title_original": "Israel Army strikes Hezbollah infrastructure in south Lebanon",
    "content_original": "Israel and Iran-backed Hezbollah agreed a ceasefire in November 2024 after a year of war, but Israel has continued regular strikes, saying it is enforcing ceasefire provisions against the group rearming",
    "url": "https://www.thehindu.com/news/international/israel-army-strikes-hezbollah-infrastructure-in-south-lebanon/article70687168.ece",
    "published": "2026-02-28T12:47:04+05:30",
    "source_name": "The Hindu International",
    "source_category": "independent",
    "language": "en",
    "region": "south_asia",
    "skip_translation": true,
    "title_en": "Israel Army strikes Hezbollah infrastructure in south Lebanon",
    "relevant": true,
    "translated": true,
    "summary_en": "The Israeli military conducted strikes targeting Hezbollah infrastructure in southern Lebanon. This action follows a ceasefire agreement in November 2024, with Israel claiming it is enforcing the ceasefire by preventing Hezbollah from rearming. The strikes highlight ongoing tensions and potential for renewed conflict along Israel's northern border.",
    "keyword_matches": 6,
    "matched_keywords": [
      "conflict",
      "ceasefire",
      "hezbollah"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah"
      ],
      "location": "southern Lebanon",
      "brief": "The strikes by Israel on Hezbollah infrastructure in southern Lebanon signal ongoing tensions and potential escalation risks in the region, indirectly impacting the broader Iran–US conflict dynamics."
    },
    "lat": 33.54,
    "lng": 35.37
  },
  {
    "id": "e38e9dc0ed6216c6",
    "title_original": "🚨 حملات موشکی ایران به پایگاه آمریکایی در اربیل عراق ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات و اخبار ...",
    "content_original": "🚨 حملات موشکی ایران به پایگاه آمریکایی در اربیل عراق ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44816",
    "published": "2026-02-28T12:45:18+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Iranian Missile Strikes on US Base in Erbil, Iraq",
    "relevant": true,
    "summary_en": "Iran launched missile attacks targeting a US base in Erbil, Iraq. This represents a significant escalation in the ongoing conflict, demonstrating Iran's continued willingness to strike US military assets in the region. The attack could provoke further US military responses and raises tensions in Iraq and the broader Middle East.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "missile",
      "attack",
      "strike",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "United States",
        "IRGC"
      ],
      "location": "Erbil, Iraq",
      "brief": "Iran's missile strikes on a US base in Erbil mark a critical escalation, demonstrating direct engagement and posing a significant threat to regional stability."
    },
    "lat": 36.19,
    "lng": 44.01,
    "merged_source_count": 2
  },
  {
    "id": "214fbb9998e914bf",
    "title_original": "🚨 نقطه زنی پهپاد شاهد ایرانی  پایگاه امریکایی-قطر ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨  تحولات و اخبار جدی...",
    "content_original": "🚨 نقطه زنی پهپاد شاهد ایرانی پایگاه امریکایی-قطر ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44811",
    "published": "2026-02-28T12:38:35+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "Iranian Shahed Drone targets US base in Qatar",
    "relevant": true,
    "summary_en": "An Iranian Shahed drone has struck a US military base in Qatar. This attack represents an escalation in the conflict as it directly targets a critical US facility in the region. The strike's strategic significance lies in its potential to disrupt US operations and logistics in the Middle East.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "strike",
      "attack",
      "drone",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "drone_strike",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "United States",
        "Islamic Resistance Iraq (proxy)"
      ],
      "location": "US military base in Qatar",
      "brief": "The drone strike on a US base in Qatar by an Iranian Shahed drone marks a direct escalation in the conflict, posing a significant threat to US operations and logistics in the Middle East."
    },
    "lat": 25.12,
    "lng": 51.32
  },
  {
    "id": "91339ea76c2704a7",
    "title_original": "Gulf states on frontlines of Israel-US war on Iran",
    "content_original": "Iran launched missile and drone strikes across multiple Arab states hosting US military bases on Saturday, hours after coordinated US-Israeli attacks on Iranian territory . The strikes threaten to widen the conflict to involve at least six countries across the Gulf and Levant , most of whom have long feared they would be on the front lines of any regional war. Air defences were activated in Qatar, the UAE, Bahrain, Kuwait, Jordan, Iraq and Saudi Arabia as Iranian projectiles targeted US-linked military infrastructure across the region. At least one civilian was killed in Abu Dhabi when debris from intercepted missiles struck a residential area, according to Emirati authorities. The escalation followed large-scale unprovoked US and Israeli strikes on Iranian military and strategic targets earlier in the day, including in and around Tehran. US President Donald Trump described the campaign as \"massive and ongoing combat operations\" aimed at countering Iranian threats. Israeli officials fr...",
    "url": "https://www.newarab.com/news/gulf-states-frontlines-israel-us-war-iran",
    "published": "2026-02-28T11:50:07+00:00",
    "source_name": "The New Arab",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Gulf states on frontlines of Israel-US war on Iran",
    "relevant": true,
    "translated": true,
    "summary_en": "Iran launched missile and drone strikes targeting US military bases across multiple Arab states, including Qatar, UAE, Bahrain, Kuwait, Jordan, Iraq, and Saudi Arabia, following coordinated US-Israeli attacks on Iranian territory. The escalation threatens to widen the conflict, involving at least six countries in the Gulf and Levant. The activation of air defenses and the death of at least one civilian in Abu Dhabi highlight the direct impact on regional stability and civilian populations.",
    "keyword_matches": 5,
    "matched_keywords": [
      "missile",
      "drone",
      "death",
      "conflict",
      "war"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "US",
        "Qatar",
        "UAE",
        "Bahrain",
        "Kuwait",
        "Jordan",
        "Iraq",
        "Saudi Arabia"
      ],
      "location": "Qatar, UAE, Bahrain, Kuwait, Jordan, Iraq, Saudi Arabia",
      "brief": "Iran's missile and drone strikes on US military bases across multiple Arab states mark a significant escalation with direct engagement and regional instability."
    },
    "lat": 25.33,
    "lng": 51.23,
    "merged_source_count": 2
  },
  {
    "id": "d580087824341479",
    "title_original": "Explosion at Dubai landmark The Palm: witnesses",
    "content_original": "Two witnesses told AFP they heard an explosion and saw a plume of smoke rising from Dubai's famed man-made island The Palm as authorities reported four injured. The attack came as Iran carried out retaliatory strikes in the oil-rich Gulf following US and Israeli attacks -- rattling a region long seen as a haven of peace and security. One of the witnesses said he saw thick black smoke rising from a hotel on the Palm and heard ambulances rushing towards the scene.",
    "url": "https://www.al-monitor.com/originals/2026/02/explosion-dubai-landmark-palm-witnesses",
    "published": "2026-02-28T11:30:20-05:00",
    "source_name": "Al-Monitor",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Explosion at Dubai landmark The Palm",
    "translated": true,
    "relevant": true,
    "summary_en": "An explosion occurred at Dubai's Palm Jumeirah, injuring four people. This incident comes amid escalating tensions as Iran retaliates against US and Israeli attacks in the Gulf region. The attack highlights the potential for regional instability and the spillover of the Iran-US conflict into areas previously considered secure.",
    "keyword_matches": 4,
    "matched_keywords": [
      "attack",
      "conflict",
      "explosion"
    ],
    "classification": {
      "is_attack": true,
      "category": "other",
      "severity": "medium",
      "parties_involved": [],
      "location": "Unknown",
      "brief": "Classified by keyword matching (LLM unavailable)"
    },
    "merged_source_count": 2
  },
  {
    "id": "6b7cf8761b7856f9",
    "title_original": "وزارة الدفاع الإماراتية تعلن التصدي لهجوم بصواريخ باليستية",
    "content_original": "أبوظبي في 28 فبراير /قنا/ أعلنت وزارة الدفاع الإماراتية عن تعرض الإمارات، اليوم، لهجوم بصواريخ باليستية إيرانية، \"حيث تعاملت معها الدفاعات الجوية الإماراتية بكفاءة عالية وتم التصدي بنجاح لعدد من الصواريخ\".",
    "url": "https://qna.org.qa/ar-QA/News-Area/News/2026-2/28/وزارة-الدفاع-الاماراتية-تعلن-التصدي-لهجوم-بصواريخ-باليستية",
    "published": "2026-02-28T11:22:10.251349+00:00",
    "source_name": "QNA General (Arabic)",
    "source_category": "state",
    "language": "ar",
    "region": "gulf",
    "skip_translation": false,
    "title_en": "UAE Defense Ministry Reports Successful Interception of Iranian Ballistic Missile Attack",
    "relevant": true,
    "summary_en": "The UAE Defense Ministry announced that the UAE successfully intercepted multiple Iranian ballistic missiles targeting the country. UAE air defenses demonstrated high efficiency in countering the attack. This incident highlights the ongoing threat posed by Iranian missile capabilities in the region and the UAE's readiness to defend against such attacks.",
    "translated": true,
    "keyword_matches": 7,
    "matched_keywords": [
      "attack",
      "ballistic",
      "threat",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE"
      ],
      "location": "United Arab Emirates",
      "brief": "Iran's ballistic missile attack on the UAE demonstrates the direct threat posed by Iranian missile capabilities and the potential for regional escalation in the Iran–US conflict."
    },
    "lat": 24.0002488,
    "lng": 53.9994829,
    "merged_source_count": 2
  },
  {
    "id": "73ceba22645da477",
    "title_original": "الأردن يعلن إسقاط صاروخين باليستيين فوق أراضيه",
    "content_original": "عمان في 28 فبراير /قنا/ صرح مصدر عسكري مسؤول في القيادة العامة للقوات المسلحة الأردنية، بأنه تم اليوم، إسقاط صاروخين باليستيين استهدفا الأراضي الأردنية، مبينا أنه جرى التصدي لها بنجاح من قبل أنظمة الدفاع الجوي الأردنية.",
    "url": "https://qna.org.qa/ar-QA/News-Area/News/2026-2/28/الاردن-يعلن-اسقاط-صاروخين-باليستيين-فوق-اراضيه",
    "published": "2026-02-28T11:22:10.251252+00:00",
    "source_name": "QNA General (Arabic)",
    "source_category": "state",
    "language": "ar",
    "region": "gulf",
    "skip_translation": false,
    "title_en": "Jordan Announces Interception of Two Ballistic Missiles Over Its Territory",
    "relevant": true,
    "summary_en": "Jordanian armed forces successfully intercepted and downed two ballistic missiles targeting its territory. The incident highlights the ongoing threat to regional stability as the conflict between Iran and the US continues to spill over into neighboring countries. This event underscores the importance of air defense systems in protecting against potential threats in the region.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "ballistic",
      "threat",
      "air defense",
      "conflict"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "medium",
      "parties_involved": [
        "Jordan",
        "Iran"
      ],
      "location": "Jordan",
      "brief": "The interception of ballistic missiles over Jordan highlights the regional spillover of the Iran–US conflict and the persistent threat to neighboring countries' security."
    },
    "lat": 31.1667049,
    "lng": 36.941628
  },
  {
    "id": "7023f3f26f7711bf",
    "title_original": "رسانه های عراقی: آمریکا مقر الحشد الشعبی را در بغداد هدف قرار داد",
    "content_original": "رسانه های عراقی: آمریکا مقر الحشد الشعبی را در بغداد هدف قرار داد",
    "url": "https://www.irna.ir/news/86089424/%D8%B1%D8%B3%D8%A7%D9%86%D9%87-%D9%87%D8%A7%DB%8C-%D8%B9%D8%B1%D8%A7%D9%82%DB%8C-%D8%A2%D9%85%D8%B1%DB%8C%DA%A9%D8%A7-%D9%85%D9%82%D8%B1-%D8%A7%D9%84%D8%AD%D8%B4%D8%AF-%D8%A7%D9%84%D8%B4%D8%B9%D8%A8%DB%8C-%D8%B1%D8%A7-%D8%AF%D8%B1-%D8%A8%D8%BA%D8%AF%D8%A7%D8%AF-%D9%87%D8%AF%D9%81-%D9%82%D8%B1%D8%A7%D8%B1",
    "published": "2026-02-28T10:39:31+00:00",
    "source_name": "IRNA",
    "source_category": "state",
    "language": "fa",
    "region": "iran",
    "skip_translation": false,
    "title_en": "US Strikes PMF Headquarters in Baghdad",
    "relevant": true,
    "summary_en": "The US has targeted a PMF (Popular Mobilization Forces) headquarters in Baghdad, Iraq. This strike is part of ongoing US operations against Iran-backed militias in the region. The attack signifies continued US efforts to counter proxy forces threatening its interests in Iraq.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "proxy",
      "strike",
      "pmf"
    ],
    "classification": {
      "is_attack": true,
      "category": "us_strike_on_iran",
      "severity": "medium",
      "parties_involved": [
        "United States",
        "Popular Mobilization Forces (PMF)",
        "Iran"
      ],
      "location": "Baghdad, Iraq",
      "brief": "The US airstrike on a PMF headquarters in Baghdad demonstrates ongoing efforts to counter Iran-backed militias, escalating tensions in Iraq."
    },
    "lat": 33.3061701,
    "lng": 44.3872213
  },
  {
    "id": "80e96ba90ee434c0",
    "title_original": "🚨 امارات: از سوی ایران مورد حمله موشکی قرار گرفتیم / با موشک ها مقابله کردیم ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ...",
    "content_original": "🚨 امارات: از سوی ایران مورد حمله موشکی قرار گرفتیم / با موشک ها مقابله کردیم ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ ـ 🚨 تحولات و اخبار جدید ایران و آمریکا 🌐 ✅ @SABERIN_NEWS",
    "url": "https://t.me/saberin_news/44787",
    "published": "2026-02-28T10:05:35+00:00",
    "source_name": "Islamic Resistance Iraq (TG)",
    "source_category": "proxy",
    "language": "ar",
    "region": "proxies",
    "skip_translation": false,
    "title_en": "UAE Reports Missile Attack from Iran and Intercepts",
    "relevant": true,
    "summary_en": "The UAE claims it was targeted by a missile attack from Iran and successfully intercepted the missiles. This incident signifies an escalation in regional hostilities and direct engagement between Iran and a US ally, raising concerns about further conflict in the Gulf region.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "attack",
      "conflict",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "iran_strike_on_us",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "UAE",
        "US"
      ],
      "location": "UAE",
      "brief": "Iran's missile attack on the UAE, a key US ally, represents a direct escalation in regional hostilities and raises the risk of broader conflict in the Gulf region."
    },
    "lat": 24.0002488,
    "lng": 53.9994829
  },
  {
    "id": "71bae25a767d67f6",
    "title_original": "איראן משגרת איום ישיר לעבר ישראל וארה\"ב: \"אין קווים אדומים\"",
    "content_original": "גורם איראני בכיר הצהיר כי \"אין קווים אדומים\" וכי כל הנכסים והאינטרסים האמריקאיים והישראליים במזרח התיכון הם מטרה לגיטימית. משמרות המהפכה הודיעו כי החל גל ראשון של מתקפות טילים וכטב\"מים כתגובה למתקפה",
    "url": "https://www.maariv.co.il/news/military/article-1290077",
    "published": "2026-02-28T09:17:53+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Iran Threatens Israel and US: 'No Red Lines'",
    "relevant": true,
    "summary_en": "A senior Iranian official declared that there are 'no red lines' and that all US and Israeli assets and interests in the Middle East are legitimate targets. The IRGC announced the start of a first wave of missile and drone attacks in response to a previous strike, indicating a significant escalation in the ongoing conflict.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "irgc",
      "conflict",
      "missile",
      "strike",
      "drone"
    ],
    "classification": {
      "is_attack": true,
      "category": "escalation",
      "severity": "high",
      "parties_involved": [
        "Iran",
        "US",
        "Israel",
        "IRGC"
      ],
      "location": "Middle East",
      "brief": "Iran's declaration of 'no red lines' and initiation of missile and drone attacks against US and Israeli assets marks a significant escalation in the conflict."
    },
    "lat": 29.0,
    "lng": 47.0
  },
  {
    "id": "8c0ffea0f88472e6",
    "title_original": "إيران ترد برشقات صاروخية على كيان الاحتلال",
    "content_original": "المركز الفلسطيني للإعلام بدأت إيران الرد على العدوان الأمريكي الإسرائيلي، بإطلاق موجة من الصواريخ الباليستية صوب أهداف في كيان الاحتلال. وأعلن الحرس الثوري الإيراني في بيان: ردًا على عدوان العدو المعتدي والقاتل على الجمهورية الإسلامية الإيرانية، بدأت أول موجة من الهجمات الصاروخية والطائرات المسيرة الواسعة للجمهورية الإسلامية الإيرانية نحو الأراضي المحتلة. وقالت مواقع عبرية، إن صفارات الإنذار دوت في جميع مدن إسرائيل مع صدور تعليمات بالدخول إلى الملاجئ، بعد إعلان حالة &#8220;طوارئ خاصة&#8221;. وأورد موقع والا الإسرائيلي أن أصوات الانفجارات سُمعت في منطقة حيفا، كما ذكرت وسائل إعلام إسرائيلية أخرى دوي انفجارات قوية في منطقة الجليل شمال إسرائيل. وتحدثث وسائل إعلام عبرية عن إسقاط صاروخ في سماء تل أبيب، وسقوط صاروخين في منطقة مفتوحة أخرى شمال فلسطين المحتلة. ولاحقا أقرت وسائل إعلام عبرية باستهدف مبنى مباشرة في عسقلان ومبنى في تل أبيب. وفي تطور لاحق، رصدت وسائل إعلام انطلاق موجة صواريخ إيرانية جديدة على كيان الاحتلال. الحرب على إيران .. هجمات إسرائيلية وأميركية على طهران وفي أول تعليق على الحر...",
    "url": "https://palinfo.com/news/2026/02/28/994398/",
    "published": "2026-02-28T08:41:50+00:00",
    "source_name": "Hamas (Palestine Info)",
    "source_category": "proxy",
    "language": "en",
    "region": "proxies",
    "skip_translation": true,
    "title_en": "Iran launches ballistic missile barrage at Israel",
    "relevant": true,
    "summary_en": "Iran's IRGC launched ballistic missiles and drones targeting Israel in response to US-Israeli aggression against Iran. Air raid sirens sounded across Israeli cities, with reports of explosions in Haifa and the Galilee region. This escalation signifies a significant expansion of the conflict with potential regional implications.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "irgc",
      "ballistic",
      "conflict",
      "raid",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel",
        "IRGC",
        "US"
      ],
      "location": "Haifa, Galilee region, Israel",
      "brief": "Iran's ballistic missile barrage against Israel marks a critical escalation, directly involving Iran in the conflict and posing significant regional security risks."
    },
    "lat": 32.79,
    "lng": 34.99
  },
  {
    "id": "257cbfd900415a15",
    "title_original": "Lebanon refuses to be drawn into Iran conflict: PM",
    "content_original": "Lebanese Prime Minister Nawaf Salam said Saturday that his country refused to be dragged into war, after Israel and the United States launched strikes against Iran. Authorities fear the Iran-backed Lebanese militant group Hezbollah could become involved in the conflict, which saw the US and Israel bomb Iran on Saturday and Tehran respond with missile attacks. Just before the operation began, Israel announced it was carrying out strikes on Hezbollah infrastructure in south Lebanon.",
    "url": "https://www.al-monitor.com/originals/2026/02/lebanon-refuses-be-drawn-iran-conflict-pm",
    "published": "2026-02-28T08:30:20-05:00",
    "source_name": "Al-Monitor",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Lebanon refuses to be drawn into Iran conflict: PM",
    "relevant": true,
    "translated": true,
    "summary_en": "Lebanese Prime Minister Nawaf Salam stated that Lebanon will not be drawn into the ongoing conflict after US and Israeli strikes on Iran, amid concerns that Hezbollah might get involved. Israel preemptively struck Hezbollah infrastructure in south Lebanon before the operation began. This highlights Lebanon's efforts to avoid escalation and the potential for regional spillover as the conflict intensifies.",
    "keyword_matches": 5,
    "matched_keywords": [
      "conflict",
      "hezbollah"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah",
        "Lebanon"
      ],
      "location": "south Lebanon",
      "brief": "Israel's preemptive strikes on Hezbollah infrastructure in Lebanon signal potential escalation risks as Lebanon seeks to avoid involvement in the broader Iran conflict."
    },
    "lat": 39.3710358,
    "lng": -84.2128058
  },
  {
    "id": "9fd3872aa08b23e9",
    "title_original": "כל המדינה במקלטים: אחרי מתקפת המנע - ישראל תחת מתקפה נרחבת מאיראן",
    "content_original": "אזעקות נשמעו בכל הארץ בעקבות זיהוי שיגור טילים לעבר שטח המדינה. \"הציבור מתבקש לגלות אחריות ולפעול על פי ההנחיות - הן מצילות חיים\", מסר פיקוד העורף",
    "url": "https://www.maariv.co.il/news/military/Blog-1290046",
    "published": "2026-02-28T08:20:08+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Israel Under Wide-Ranging Attack from Iran After Missile Barrage",
    "relevant": true,
    "summary_en": "Iran launched a widespread missile attack on Israel, triggering nationwide air raid sirens and prompting the Home Front Command to urge citizens to follow safety protocols. This represents a significant escalation in the ongoing conflict between Iran and Israel, with potential regional implications.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "attack",
      "conflict",
      "raid",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "major",
      "parties_involved": [
        "Iran",
        "Israel"
      ],
      "location": "Israel",
      "brief": "Iran's ballistic missile attack on Israel marks a critical escalation, posing a direct threat to regional stability and potentially drawing in US forces."
    },
    "lat": 30.8124247,
    "lng": 34.8594762,
    "merged_source_count": 3
  },
  {
    "id": "3a956bc35a06523b",
    "title_original": "אזעקות בישראל: התרעות נשמעו באזורים נרחבים בצפון בעקבות שיגור מאיראן",
    "content_original": "אזעקות נשמעו באזורים נרחבים בצפון ישראל בעקבות זיהוי שיגור טילים לעבר שטח המדינה. \"הציבור מתבקש לגלות אחריות ולפעול על פי ההנחיות - הן מצילות חיים\", מסר פיקוד העורף",
    "url": "https://www.maariv.co.il/news/military/article-1290043",
    "published": "2026-02-28T08:16:44+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "Missile Alerts in Northern Israel Triggered by Suspected Iranian Launch",
    "relevant": true,
    "summary_en": "Missile alerts were activated across northern Israel following the detection of missile launches from Iran towards Israeli territory. The Home Front Command urged citizens to follow safety protocols, emphasizing that they save lives. This incident signifies a significant escalation in the ongoing conflict between Israel and Iran, highlighting the direct threat under which Israeli civilians are placed.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "conflict",
      "threat",
      "missile"
    ],
    "classification": {
      "is_attack": true,
      "category": "ballistic_missile",
      "severity": "high",
      "parties_involved": [
        "Israel",
        "Iran"
      ],
      "location": "Northern Israel",
      "brief": "Iran's ballistic missile launch towards Israel represents a significant escalation, posing a direct threat to Israeli territory and civilians."
    },
    "lat": 33.0601833,
    "lng": 35.2448195
  },
  {
    "id": "c57d69035fc81a0a",
    "title_original": "תיעוד: הותקפו פירים תת-קרקעיים של חיזבאללה בדרום לבנון",
    "content_original": "בצה\"ל אמרו כי עמדות השיגור שהותקפו לצד הפירים התת-קרקעיים של ארגון הטרור שימשו אותו ל\"קידום מתווי טרור\". בצבא הזהירו כי \"חיזבאללה פועל לשקם את הארגון - ומפר את ההבנות\"",
    "url": "https://www.ynet.co.il/news/article/skl6l11gkzx",
    "published": "2026-02-28T07:49:54+02:00",
    "source_name": "Ynet",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "IDF strikes Hezbollah underground tunnels in southern Lebanon",
    "relevant": true,
    "summary_en": "The IDF targeted Hezbollah underground tunnels and launch positions in southern Lebanon, citing their use for 'terror activities.' The military warned that Hezbollah is attempting to rebuild and violating previous understandings, indicating ongoing tensions and potential escalation in the region.",
    "translated": true,
    "keyword_matches": 5,
    "matched_keywords": [
      "hezbollah",
      "idf"
    ],
    "classification": {
      "is_attack": true,
      "category": "hezbollah_action",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah"
      ],
      "location": "southern Lebanon",
      "brief": "The IDF airstrikes on Hezbollah tunnels in southern Lebanon indicate ongoing tensions and potential escalation in the Israel-Lebanon border region, which could impact the broader Iran–US conflict through Hezbollah's role as an Iranian proxy."
    },
    "lat": 33.5393039,
    "lng": 35.3716495
  },
  {
    "id": "57d8639051cc0794",
    "title_original": "מתקפת המנע של ארה\"ב וישראל באיראן: \"אלפי הרוגים במשמרות המהפכה\"",
    "content_original": "ישראל וארה\"ב פתחו במתקפת מנע נגד איראן - הוכרז מצב חירום מיוחד ומיידי בכל שטחי המדינה. הותקפו מוקדים משמעותיים בטהרן, כולל מוקדי שלטון. טראמפ: \"יצאנו למלחמה. לא יהיה נשק גרעיני\"",
    "url": "https://www.maariv.co.il/news/military/article-1289990",
    "published": "2026-02-28T06:16:12+00:00",
    "source_name": "Maariv",
    "source_category": "state-aligned",
    "language": "he",
    "region": "israel",
    "skip_translation": false,
    "title_en": "US and Israel Launch Preventive Attack on Iran: 'Thousands of IRGC Casualties'",
    "relevant": true,
    "summary_en": "The US and Israel have initiated a preventive attack on Iran, with Tehran's key centers, including government facilities, targeted. A state of emergency has been declared across Iran. The attack aims to prevent Iran's nuclear capabilities, with President Trump stating the objective is to ensure Iran does not acquire nuclear weapons.",
    "translated": true,
    "keyword_matches": 6,
    "matched_keywords": [
      "irgc",
      "attack",
      "nuclear"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "major",
      "parties_involved": [
        "US",
        "Israel",
        "Iran"
      ],
      "location": "Iran",
      "brief": "The US and Israel launched a coordinated airstrike on Iran targeting government facilities and IRGC centers, marking a significant escalation in the conflict with mass casualties reported."
    },
    "lat": 32.6475314,
    "lng": 54.5643516,
    "merged_source_count": 5
  },
  {
    "id": "60a39b4823d7b9e8",
    "title_original": "Syrian teen killed in Israeli airstrike in eastern Lebanon",
    "content_original": "A Syrian teen was killed and 29 others injured Thursday in Israeli airstrikes in eastern Lebanon despite a ceasefire deal that has been in place since November 2024, Lebanese state media reported, Anadolu reports. The National News Agency (NNA) said a 17-year-old boy was killed in the strike that targeted the Beit Mshik farms area near Kfar Dan in western Baalbek. The fatality came as Israeli warplanes launched a series of airstrikes targeting the western Baalbek area, with fighter jets flying at low altitude above the region. The Israeli army said the strikes targeted infrastructure belonging to the Lebanese group Hezbollah’s “Radwan Force” in the Baalbek area. In southern Lebanon, an Israeli drone carried out a strike with a guided [&#8230;]",
    "url": "https://www.middleeastmonitor.com/20260226-syrian-teen-killed-in-israeli-airstrike-in-eastern-lebanon/",
    "published": "2026-02-26T21:20:29+00:00",
    "source_name": "Middle East Monitor",
    "source_category": "independent",
    "language": "en",
    "region": "middle_east",
    "skip_translation": true,
    "title_en": "Syrian teen killed in Israeli airstrike in eastern Lebanon",
    "relevant": true,
    "translated": true,
    "summary_en": "An Israeli airstrike in eastern Lebanon killed a Syrian teenager and injured 29 others near Kfar Dan in Baalbek. The strikes targeted Hezbollah's 'Radwan Force' infrastructure in the area, violating the existing ceasefire deal since November 2024. This incident highlights ongoing tensions and potential escalation between Israel and Hezbollah despite the ceasefire.",
    "keyword_matches": 8,
    "matched_keywords": [
      "ceasefire",
      "airstrike",
      "killed",
      "hezbollah"
    ],
    "classification": {
      "is_attack": true,
      "category": "airstrike",
      "severity": "medium",
      "parties_involved": [
        "Israel",
        "Hezbollah"
      ],
      "location": "eastern Lebanon, Kfar Dan, Baalbek",
      "brief": "The Israeli airstrike targeting Hezbollah's 'Radwan Force' infrastructure in Lebanon, despite the ceasefire, signifies ongoing tensions and potential escalation in the region, indirectly impacting the Iran–US conflict through Hezbollah's role as an Iranian proxy."
    },
    "lat": 33.85,
    "lng": 35.86
  }
]